Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: * Perl shift returns the first array item and drop it from the array. * Perl unshift prepends an item to the array as the first array item. * Perl pop returns the last array item and drop it from the array. * Perl push appends an item to the array as the last array item.
zh_hans: * Perl shift 返回第一个数组项并将其从数组中删除。 * Perl unshift 将项作为第一个数组项添加到数组中。 * Perl pop 返回最后一个数组项并将其从数组中删除。 * Perl push 将一项作为最后一个数组项追加到数组中。
zh_hant: * Perl shift 返回第一個陣列項並將其從陣列中刪除。 * Perl unshift 將項作為第一個陣列項新增到陣列中。 * Perl pop 返回最後一個數組項並將其從陣列中刪除。 * Perl push 將一項作為最後一個數組項追加到陣列中。

source: Copyright © 2005 SPI, Inc.
zh_hans: 版权所有 © 2005 SPI, Inc.
zh_hant: 版權所有 © 2005 SPI, Inc.

source: Copyright © 2004 Yves Rütschlé <po4a@rutschle.net> Copyright © 2007-2008 Nicolas François <nicolas.francois@centraliens.net>
zh_hans: 版权所有 © 2004 Yves Rütschlé <po4a@rutschle.net> 版权所有 © 2007-2008 Nicolas François <nicolas.francois@centraliens.net>
zh_hant: 版權所有 © 2004 Yves Rütschlé <po4a@rutschle.net> 版權所有 © 2007-2008 Nicolas François <nicolas.francois@centraliens.net>

source: Copyright © 2004 Jordi Vilalta <jvprat@gmail.com> Copyright © 2008-2009 Nicolas François <nicolas.francois@centraliens.net>
zh_hans: 版权所有 © 2004 Jordi Vilalta <jvprat@gmail.com> 版权所有 © 2008-2009 Nicolas François <nicolas.francois@centraliens.net>
zh_hant: 版權所有 © 2004 Jordi Vilalta <jvprat@gmail.com> 版權所有 © 2008-2009 Nicolas François <nicolas.francois@centraliens.net>
