Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Unfortunately, po4a still lacks support for several documentation formats. Many of them would be easy to support in po4a. This includes formats not just used for documentation, such as, package descriptions (deb and rpm), package installation scripts questions, package changelogs, and all the specialized file formats used by programs such as game scenarios or wine resource files.
sv: Tyvärr saknar po4a fortfarande stöd för flera dokumentationsformat. Många av dem skulle vara lätta att stödja i po4a. Detta inkluderar format som inte bara används för dokumentation, såsom paketbeskrivningar (deb och rpm), frågor om paketinstallationsskript, paketändringsloggar och alla specialiserade filformat som används av program såsom spelscenarier eller wine-resursfiler.
zh_hans: 不幸的是，po4a 仍然缺乏对几种文档格式的支持。它们中的许多在 po4a 中都很容易支持。这不仅包括用于文档的格式，例如软件包描述 (deb 和 rpm)、软件包安装脚本问题、软件包更改日志，以及游戏场景或 wine 资源文件等程序使用的所有专用文件格式。
zh_hant: 不幸的是，po4a 仍然缺乏對幾種文件格式的支援。它們中的許多在 po4a 中都很容易支持。這不僅包括用於文件的格式，例如軟體包描述 (deb 和 rpm)、軟體包安裝指令碼問題、軟體包更改日誌，以及遊戲場景或 wine 資原始檔等程式使用的所有專用檔案格式。

source: Using po4a
sv: Använda po4a
zh_hans: 使用 po4a
zh_hant: 使用 po4a

source: The easiest way to use this tool in your project is to write a configuration file for the B<po4a> program, and only interact with this program. Please refer to its documentation, in L<po4a(1)>. The rest of this section provides more details for the advanced users of po4a wanting to deepen their understanding.
sv: Det enklaste sättet att använda detta verktyg i ditt projekt är att skriva en konfigurationsfil för programmet B<po4a> och endast interagera med detta program. Se dokumentationen på L<po4a(1)>. Resten av detta avsnitt innehåller mer detaljerad information för avancerade användare av po4a som vill fördjupa sina kunskaper.

source: Detailed schema of the po4a workflow
sv: Detaljerad översikt över po4a-arbetsflödet

source: Make sure to read L<po4a(1)> before this overly detailed section to get a simplified overview of the po4a workflow. Come back here when you want to get the full scary picture, with almost all details.
sv: Läs L<po4a(1)> innan du går vidare till detta mycket detaljerade avsnitt för att få en förenklad översikt över po4a-arbetsflödet. Kom tillbaka hit när du vill få en fullständig bild, med nästan alla detaljer.

source: In the following schema, F<master.doc> is an example name for the documentation to be translated; F<XX.doc> is the same document translated in the language XX while F<doc.XX.po> is the translation catalog for that document in the XX language. Documentation authors will mostly be concerned with F<master.doc> (which can be a manpage, an XML document, an AsciiDoc file, etc); the translators will be mostly concerned with the PO file, while the end users will only see the F<XX.doc> file.
sv: I följande schema är F<master.doc> ett exempel på namnet på dokumentationen som ska översättas; F<XX.doc> är samma dokument översatt till språket XX, medan F<doc.XX.po> är översättningskatalogen för det dokumentet på språket XX. Dokumentationsförfattare kommer främst att arbeta med F<master.doc> (som kan vara en man-sida, ett XML-dokument, en AsciiDoc-fil etc.), översättarna kommer främst att arbeta med PO-filen, medan slutanvändarna endast kommer att se filen F<XX.doc>.

source: Transitions with square brackets such as C<[po4a updates po]> represent the execution of a po4a tool while transitions with curly brackets such as C<{update of master.doc}> represent a manual modification of the project's files.
sv: Övergångar med hakparenteser, såsom C<[po4a uppdaterar po]>, representerar körningen av ett po4a-verktyg, medan övergångar med klamrar, såsom C<{uppdatering av master.doc}> representerar en manuell modifiering av projektets filer.

source: Again, this schema is overly complicated. Check on L<po4a(1)> for a simplified overview.
sv: Återigen är detta schema alltför komplicerat. Se L<po4a(1)> för en förenklad översikt.

source: The left part depicts how L<po4a-gettextize(1)> can be used to convert an existing translation project to the po4a infrastructure. This script takes an original document and its translated counterpart, and tries to build the corresponding PO file. Such manual conversion is rather cumbersome (see the L<po4a-gettextize(1)> documentation for more details), but it is only needed once to convert your existing translations. If you don't have any translation to convert, you can forget about this and focus on the right part of the schema.
sv: Den vänstra delen visar hur L<po4a-gettextize(1)> kan användas för att konvertera ett befintligt översättningsprojekt till po4a-infrastrukturen. Detta skript tar ett originaldokument och dess översatta motsvarighet och försöker skapa motsvarande PO-fil. En sådan manuell konvertering är ganska omständlig (se dokumentationen för L<po4a-gettextize(1)> för mer information), men den behövs bara en gång för att konvertera dina befintliga översättningar. Om du inte har några översättningar att konvertera kan du strunta i detta och fokusera på den högra delen av schemat.
zh_hans: 左侧部分描述了如何使用 L<po4a-gettexalize(1)> 将现有的翻译项目转换为 po4a 基础设施。此脚本获取原始文档及其翻译的副本，并尝试构建相应的 PO 文件。这种手动转换相当麻烦(有关更多详细信息，请参阅 L<po4a-gettexalize(1)> 文档)，但转换现有翻译只需要一次。如果您没有任何要转换的翻译，您可以忘掉这一点，专注于模式的正确部分。
zh_hant: 左側部分描述瞭如何使用 L<po4a-gettexalize(1)> 將現有的翻譯專案轉換為 po4a 基礎設施。此指令碼獲取原始文件及其翻譯的副本，並嘗試構建相應的 PO 檔案。這種手動轉換相當麻煩(有關更多詳細資訊，請參閱 L<po4a-gettexalize(1)> 文件)，但轉換現有翻譯只需要一次。如果您沒有任何要轉換的翻譯，您可以忘掉這一點，專注於模式的正確部分。

source: On the top right part, the action of the original author is depicted, updating the documentation. The middle right part depicts the automatic updates of translation files: the new material is extracted and compared against the exiting translation. The previous translation is used for the parts that didn't change, while partially modified parts are connected to the previous translation with a "fuzzy" marker indicating that the translation must be updated. New or heavily modified material is left untranslated.
sv: I den övre högra delen visas den ursprungliga författarens åtgärd, uppdatering av dokumentationen. Den mellersta högra delen visar de automatiska uppdateringarna av översättningsfilerna: det nya materialet extraheras och jämförs med den befintliga översättningen. Den tidigare översättningen används för de delar som inte har ändrats, medan delvis modifierade delar kopplas till den tidigare översättningen med en "fuzzy"-markör som indikerar att översättningen måste uppdateras. Nytt eller kraftigt modifierat material lämnas oöversatt.

source: Then, the I<manual editing> block depicts the action of the translators, that modify the PO files to provide translations to every original string and paragraph. This can be done using either a specific editor such as the B<GNOME Translation Editor>, KDE's B<Lokalize> or B<poedit>, or using an online localization platform such as B<weblate> or B<pootle>. The translation result is a set of PO files, one per language. Please refer to the gettext documentation for more details.
sv: Sedan visar I-<manual editing> -blocket översättarnas arbete, som modifierar PO-filerna för att tillhandahålla översättningar till varje originalsträng och originalstycke. Detta kan göras med hjälp av antingen en specifik editor såsom B-<GNOME Translation Editor>, KDE:s B-<Lokalize> eller B-<poedit>, eller med hjälp av en online-lokaliseringsplattform såsom B-<weblate> eller B-<pootle>. Översättningsresultatet är en uppsättning PO-filer, en per språk. Se gettext-dokumentationen för mer information.

source: The bottom part of the figure shows how B<po4a> creates a translated source document from the F<master.doc> original document and the F<doc.XX.po> translation catalog that was updated by the translators. The structure of the document is reused, while the original content is replaced by its translated counterpart. Optionally, an addendum can be used to add some extra text to the translation. This is often used to add the name of the translator to the final document. See below for details.
sv: Den nedre delen av figuren visar hur B<po4a> skapar ett översatt källdokument från F<master.doc> originaldokumentet och F<doc.XX.po> översättningskatalogen som uppdaterats av översättarna. Dokumentets struktur återanvänds, medan det ursprungliga innehållet ersätts med dess översatta motsvarighet. Valfritt kan ett tillägg användas för att lägga till extra text till översättningen. Detta används ofta för att lägga till översättarens namn till det slutliga dokumentet. Se nedan för mer information.

source: Upon invocation, B<po4a> updates both the translation files and the translated documentation files automatically.
sv: När B<po4a> anropas uppdateras både översättningsfilerna och de översatta dokumentationsfilerna automatiskt.

source: Starting a new translation project
sv: Starta ett nytt översättningsprojekt

source: If you start from scratch, you just have to write a configuration file for po4a, and you are set. The relevant templates are created for the missing files, allowing your contributors to translate your project to their language. Please refer to L<po4a(1)> for a quick start tutorial and for all details.
sv: Om du börjar från grunden behöver du bara skriva en konfigurationsfil för po4a, så är du klar. Relevanta mallar skapas för de filer som saknas, så att dina bidragsgivare kan översätta ditt projekt till sitt språk. Se L<po4a(1)> för en snabbstartsguide och alla detaljer.

source: If you have an existing translation, i.e. a documentation file that was translated manually, you can integrate its content in your po4a workflow using B<po4a-gettextize>. This task is a bit cumbersome (as described in the tool's manpage), but once your project is converted to po4a workflow, everything will be updated automatically.
sv: Om du har en befintlig översättning, dvs. en dokumentationsfil som har översatts manuellt, kan du integrera dess innehåll i ditt po4a-arbetsflöde med hjälp av B<po4a-gettextize>. Denna uppgift är lite besvärlig (som beskrivs i verktygets manual), men när ditt projekt väl har konverterats till po4a-arbetsflöde kommer allt att uppdateras automatiskt.

source: Updating the translations and documents
sv: Uppdatering av översättningar och dokument

source: Once setup, invoking B<po4a> is enough to update both the translation PO files and translated documents. You may pass the C<--no-translations> to B<po4a> to not update the translations (thus only updating the PO files) or C<--no-update> to not update the PO files (thus only updating the translations). This roughly corresponds to the individual B<po4a-updatepo> and B<po4a-translate> scripts which are now deprecated (see "Why are the individual scripts deprecated" in the FAQ below).
sv: När det är konfigurerat räcker det att anropa B<po4a> för att uppdatera både översättningsfilerna (PO-filer) och de översatta dokumenten. Du kan skicka C<--no-translations> till B<po4a> för att inte uppdatera översättningarna (och därmed bara uppdatera PO-filerna) eller C<--no-update> för att inte uppdatera PO-filerna (och därmed bara uppdatera översättningarna). Detta motsvarar ungefär de enskilda skripten B<po4a-updatepo> och B<po4a-translate> som nu är föråldrade (se "Varför är de enskilda skripten föråldrade" i FAQ nedan).

source: Using addenda to add extra text to translations
sv: Använda tillägg för att lägga till extra text i översättningar
zh_hans: 使用附录向翻译添加额外文本
zh_hant: 使用附錄向翻譯新增額外文字

source: Adding new text to the translation is probably the only thing that is easier in the long run when you translate files manually :). This happens when you want to add an extra section to the translated document, not corresponding to any content in the original document. The classical use case is to give credits to the translation team, and to indicate how to report translation-specific issues.
sv: Att lägga till ny text i översättningen är förmodligen det enda som är enklare på lång sikt när du översätter filer manuellt :). Detta inträffar när du vill lägga till ett extra avsnitt i det översatta dokumentet, som inte motsvarar något innehåll i originaldokumentet. Det klassiska användningsfallet är att ge krediter till översättningsteamet och att ange hur man rapporterar översättningsspecifika problem.
zh_hans: 从长远来看，在手动翻译文件时，向翻译中添加新文本可能是唯一更容易的事情 :)。当您想要向翻译后的文档添加额外的部分，而不是与原始文档中的任何内容相对应时，就会发生这种情况。典型的用例是给翻译团队加分，并指出如何报告特定于翻译的问题。
zh_hant: 從長遠來看，在手動翻譯檔案時，向翻譯中新增新文字可能是唯一更容易的事情 :)。當您想要向翻譯後的文件新增額外的部分，而不是與原始文件中的任何內容相對應時，就會發生這種情況。典型的用例是給翻譯團隊加分，並指出如何報告特定於翻譯的問題。

source: With po4a, you have to specify B<addendum> files, that can be conceptually viewed as patches applied to the localized document after processing. Each addendum must be provided as a separate file, which format is however very different from the classical patches. The first line is a I<header line>, defining the insertion point of the addendum (with an unfortunately cryptic syntax -- see below) while the rest of the file is added verbatim at the determined position.
sv: Med po4a måste du ange B-<addendum> -filer, som konceptuellt kan ses som patchar som appliceras på det lokaliserade dokumentet efter bearbetning. Varje tillägg måste tillhandahållas som en separat fil, vars format dock skiljer sig mycket från de klassiska patcharna. Den första raden är en I-<header line>, som definierar infogningspunkten för tillägget (med en tyvärr kryptisk syntax – se nedan), medan resten av filen läggs till ordagrant på den bestämda positionen.
zh_hans: 对于 po4a，您必须指定 B<addendum> 文件，这些文件在概念上可以被视为在处理后应用于本地化文档的补丁。每个附录必须作为单独的文件提供，但其格式与经典补丁程序非常不同。第一行是 I<header>，它定义了附录的插入点(不幸的是，使用了隐晦的语法--见下文)，而文件的其余部分被逐字添加到确定的位置。
zh_hant: 對於 po4a，您必須指定 B<addendum> 檔案，這些檔案在概念上可以被視為在處理後應用於本地化文件的補丁。每個附錄必須作為單獨的檔案提供，但其格式與經典補丁程式非常不同。第一行是 I<header>，它定義了附錄的插入點(不幸的是，使用了隱晦的語法--見下文)，而檔案的其餘部分被逐字新增到確定的位置。

source: The header line must begin with the string B<PO4A-HEADER:>, followed by a semi-colon separated list of I<key>B<=>I<value> fields.
sv: Rubrikraden måste börja med strängen B<PO4A-HEADER:>, följt av en semikolonseparerad lista med fälten I<key>B<=>I<value>.
zh_hans: 标题行必须以字符串 B<PO4A-HEADER:> 开头，后跟分号分隔的 I<key>B<=>I<value> 字段列表。
zh_hant: 標題行必須以字串 B<PO4A-HEADER:> 開頭，後跟分號分隔的 I<key>B<=>I<value> 字段列表。

source: For example, the following header declares an addendum that must be placed at the very end of the translation.
sv: Till exempel deklarerar följande rubrik ett tillägg som måste placeras i slutet av översättningen.
zh_hans: 例如，下面的标题声明了一个附录，该附录必须放在翻译的最后。
zh_hant: 例如，下面的標題聲明瞭一個附錄，該附錄必須放在翻譯的最後。

source: Things are more complex when you want to add your extra content in the middle of the document. The following header declares an addendum that must be placed after the XML section containing the string C<About this document> in translation.
sv: Det blir mer komplicerat när du vill lägga till extra innehåll mitt i dokumentet. Följande rubrik deklarerar ett tillägg som måste placeras efter XML-sektionen som innehåller strängen C<About this document> i översättningen.
zh_hans: 当您想要在文档中间添加额外内容时，事情会更加复杂。下面的标题声明了一个附录，翻译时必须放在包含字符串 C<About this document> 的 XML 部分之后。
zh_hant: 當您想要在文件中間新增額外內容時，事情會更加複雜。下面的標題聲明瞭一個附錄，翻譯時必須放在包含字串 C<About this document> 的 XML 部分之後。

source: PO4A-HEADER: position=About this document; mode=after; endboundary=</section>
sv: PO4A-HEADER: position=Om detta dokument; mode=after; endboundary=</section>

source: In practice, when trying to apply an addendum, po4a searches for the first line matching the C<position> argument (this can be a regexp). Do not forget that po4a considers the B<translated> document here. This documentation is in English, but your line should probably read as follows if you intend your addendum to apply to the French translation of the document.
sv: I praktiken söker po4a, när det försöker tillämpa ett tillägg, efter den första raden som matchar argumentet C<position> (detta kan vara ett reguljärt uttryck). Glöm inte att po4a här beaktar dokumentet B<translated>. Denna dokumentation är på engelska, men din rad bör antagligen se ut som följer om du vill att ditt tillägg ska tillämpas på den franska översättningen av dokumentet.
zh_hans: 实际上，当尝试应用附录时，po4a 会搜索与 C<position> 参数匹配的第一行(这可以是 regexp(正则表达式))。不要忘记，po4a 在这里考虑 B<translated> 文档。本文档是英文的，但如果您打算将附录应用于文档的法语翻译，则您的行可能应该如下所示。
zh_hant: 實際上，當嘗試應用附錄時，po4a 會搜尋與 C<position> 引數匹配的第一行(這可以是 regexp(正則表示式))。不要忘記，po4a 在這裡考慮 B<translated> 文件。本文件是英文的，但如果您打算將附錄應用於文件的法語翻譯，則您的行可能應該如下所示。

source: PO4A-HEADER: position=À propos de ce document; mode=after; endboundary=</section>
sv: PO4A-HEADER: position=Om detta dokument; mode=after; endboundary=</section>

source: Once the C<position> is found in the target document, po4a searches for the next line after the C<position> that matches the provided C<endboundary>. The addendum is added right B<after> that line (because we provided an I<endboundary>, i.e. a boundary ending the current section).
sv: När C-<position> en har hittats i måldokumentet söker po4a efter nästa rad efter C-<position> en som matchar den angivna C-<endboundary> en. Tillägget läggs till direkt B-<after> om den raden (eftersom vi angav en I-<endboundary>, dvs. en gräns som avslutar det aktuella avsnittet).
zh_hans: 一旦在目标文档中找到 C<position>,po4a 就会搜索 C<position> 之后的下一行，它与所提供的 C<endboundary> 匹配。附录被添加到该行的右侧 B<after> (因为我们提供了 I<endboundary>，即结束于当前部分的边界)。
zh_hant: 一旦在目標文件中找到 C<position>,po4a 就會搜尋 C<position> 之後的下一行，它與所提供的 C<endboundary> 匹配。附錄被新增到該行的右側 B<after> (因為我們提供了 I<endboundary>，即結束於當前部分的邊界)。

source: The exact same effect could be obtained with the following header, that is equivalent:
sv: Exakt samma effekt kan uppnås med följande rubrik, som är likvärdig:
zh_hans: 使用下面的 Header 可以获得完全相同的效果，即等效：
zh_hant: 使用下面的 Header 可以獲得完全相同的效果，即等效：

source: PO4A-HEADER: position=About this document; mode=after; beginboundary=<section>
sv: PO4A-HEADER: position=Om detta dokument; mode=after; beginboundary=<section>

source: Here, po4a searches for the first line matching C<< <section> >> after the line matching C<About this document> in the translation, and add the addendum B<before> that line since we provided a I<beginboundary>, i.e. a boundary marking the beginning of the next section. So this header line requires placing the addendum after the section containing C<About this document>, and instruct po4a that a section starts with a line containing the C<< <section> >> tag. This is equivalent to the previous example because what you really want is to add this addendum either after C<< </section> >> or before C<< <section> >>.
sv: Här söker po4a efter den första raden som matchar C<< <section> >> efter raden som matchar C<About this document> i översättningen, och lägger till tillägget B<before> den raden eftersom vi har angett en I<beginboundary>, dvs. en gräns som markerar början på nästa avsnitt. Denna rubrikrad kräver alltså att tillägget placeras efter avsnittet som innehåller C<About this document> och att po4a instrueras att ett avsnitt börjar med en rad som innehåller <section> taggen </section> C<< <section> >>. Detta motsvarar föregående exempel eftersom det du egentligen vill är att lägga till detta tillägg antingen efter C<< </section> >>:</section> > eller före C<< <section> >>.

source: You can also set the insertion I<mode> to the value C<before>, with a similar semantic: combining C<mode=before> with an C<endboundary> will put the addendum just B<after> the matched boundary, that is the last potential boundary line before the C<position>. Combining C<mode=before> with an C<beginboundary> will put the addendum just B<before> the matched boundary, that is the last potential boundary line before the C<position>.
sv: Du kan också ställa in infognings<mode> en till värdet C<before>, med en liknande semantik: genom att kombinera C<mode=before> med en C<endboundary> kommer tillägget att placeras precis B<after> den matchade gränsen, det vill säga den sista potentiella gränsen före C<position>. Genom att kombinera C<mode=before> med en C<beginboundary> kommer tillägget att placeras precis B<before> den matchade gränsen, det vill säga den sista potentiella gränsen före C<position>.

source: Mode | Boundary kind | Used boundary | Insertion point compared to the boundary ========|===============|========================|========================================= 'before'| 'endboundary' | last before 'position' | Right after the selected boundary 'before'|'beginboundary'| last before 'position' | Right before the selected boundary 'after' | 'endboundary' | first after 'position' | Right after the selected boundary 'after' |'beginboundary'| first after 'position' | Right before the selected boundary 'eof' | (none) | n/a | End of file
sv: Läge | Gränstyp | Använd gräns | Infogningspunkt jämfört med gränsen ========|===============|========================|========================================= 'before'| 'endboundary' | last before 'position' | Direkt efter den valda gränsen 'before'|'beginboundary'| last before 'position' | Direkt före den valda gränsen 'after' | 'endboundary' | first after 'position' | Direkt efter den valda gränsen 'after' |'beginboundary'| first after 'position' | Direkt före den valda gränsen 'eof' | (none) | n/a | Slut på fil

source: Hint and tricks about addenda
sv: Tips och tricks om tillägg
zh_hans: 关于附录的提示和技巧
zh_hant: 關於附錄的提示和技巧

source: Remember that these are regexp. For example, if you want to match the end of a nroff section ending with the line C<.fi>, do not use C<.fi> as B<endboundary>, because it will match with C<the[ fi]le>, which is obviously not what you expect. The correct B<endboundary> in that case is: C<^\.fi$>.
sv: Kom ihåg att detta är reguljära uttryck. Om du till exempel vill matcha slutet på en nroff-sektion som slutar med raden C<.fi>, ska du inte använda C<.fi> som B<endboundary>, eftersom det kommer att matcha C<the[ fi]le>, vilket uppenbarligen inte är vad du förväntar dig. Det korrekta B<endboundary> i det fallet är: C<^\.fi$>.
zh_hans: 请记住，这些是 regexp(正则表达式)。例如，如果您希望匹配以行 C<.fi> 结尾的 nroff 部分的末尾，请不要将 C<.fi> 用作 B<endboundary>，因为它将与 C<the[fi]le> 匹配，这显然不是您所期望的。在这种情况下，正确的 B<endboundary> 是：C<^\.fi$>。
zh_hant: 請記住，這些是 regexp(正則表示式)。例如，如果您希望匹配以行 C<.fi> 結尾的 nroff 部分的末尾，請不要將 C<.fi> 用作 B<endboundary>，因為它將與 C<the[fi]le> 匹配，這顯然不是您所期望的。在這種情況下，正確的 B<endboundary> 是：C<^\.fi$>。

source: White spaces ARE important in the content of the C<position> and boundaries. So the two following lines B<are different>. The second one will only be found if there is enough trailing spaces in the translated document.
sv: Vita utrymmen ÄR viktiga i innehållet i C<position> och gränserna. Så de två följande raderna B<are different>. Den andra kommer endast att hittas om det finns tillräckligt med efterföljande utrymmen i det översatta dokumentet.
zh_hans: 空格在 C<position> 和边界的内容中很重要。所以下面的两行 B<are different>。只有在翻译的文档中有足够的尾随空格时，才会找到第二个空格。
zh_hant: 空格在 C<position> 和邊界的內容中很重要。所以下面的兩行 B<are different>。只有在翻譯的文件中有足夠的尾隨空格時，才會找到第二個空格。

source: PO4A-HEADER: position=About this document; mode=after; beginboundary=<section> PO4A-HEADER: position=About this document ; mode=after; beginboundary=<section>
sv: PO4A-HEADER: position=Om detta dokument; mode=after; beginboundary=<section> PO4A-HEADER: position=Om detta dokument ; mode=after; beginboundary=<section>
