Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: By default, msgids containing only one entity (like C<&version;>) are skipped for the translators' comfort. Activating this option prevents this optimisation. It can be useful if the document contains a construction like C<< <title>&Aacute;</title> >>, even if I doubt such things to ever happen...
sv: Som standard hoppas msgids som endast innehåller en entitet (som C<&version;>) över för att underlätta för översättarna. Om du aktiverar den här flaggan förhindras denna optimering. Det kan vara användbart om dokumentet innehåller en konstruktion som C<< <title>Á</title> >>, även om jag tvivlar på att sådant någonsin skulle inträffa...

source: Space-separated list of entities that won't be inlined. Use this option with caution: it may cause L<onsgmls(1)> (used internally) to add tags and render the output document invalid.
sv: Mellanslagsavgränsad lista över enheter som inte kommer att infogas. Använd denna option med försiktighet: det kan leda till att L<onsgmls(1)> (används internt) lägger till taggar och gör utdatadokumentet ogiltigt.

source: The result is perfect. I.e., the generated documents are exactly the same as the originals. But there are still some problems:
sv: Resultatet är perfekt. Det vill säga, de genererade dokumenten är exakt samma som originalen. Men det finns fortfarande några problem:

source: The error output of L<onsgmls(1)> is redirected to /dev/null by default, which is clearly bad. I don't know how to avoid that.
sv: Felmeddelandet från L<onsgmls(1)> omdirigeras som standard till /dev/null, vilket uppenbarligen är fel. Jag vet inte hur man undviker det.

source: The problem is that I have to "protect" the conditional inclusions (i.e. the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) from L<onsgmls(1)>. Otherwise L<onsgmls(1)> eats them, and I don't know how to restore them in the final document. To prevent that, I rewrite them to C<{PO4A-beg-foo}> and C<{PO4A-end}>.
sv: Problemet är att jag måste "skydda" de villkorliga inkluderingarna (dvs. C<E<lt>! [ %foo [> och C<]]E<gt>>) från L<onsgmls(1)>. Annars äter L<onsgmls(1)> upp dem, och jag vet inte hur jag ska återställa dem i det slutliga dokumentet. För att förhindra det skriver jag om dem till C<{PO4A-beg-foo}> och C<{PO4A-end}>.

source: The problem with this is that the C<{PO4A-end}> and such I add are invalid in the document (not in a E<lt>pE<gt> tag or so).
sv: Problemet med detta är att C-<{PO4A-end}> en och liknande som jag lägger till är ogiltiga i dokumentet (inte i en E-<lt>-pE-<gt> -tagg eller liknande).
zh_hans: 这样做的问题是，C<{PO4A-end}> 和 I 添加的内容在文档中无效(不在 E<lt>pE<gt> 标记中)。
zh_hant: 這樣做的問題是，C<{PO4A-end}> 和 I 新增的內容在文件中無效(不在 E<lt>pE<gt> 標記中)。

source: If you want to view the L<onsgmls(1)> output, just add the following to your command line (or po4a configuration line):
sv: Om du vill visa L<onsgmls(1)>-utdata, lägg bara till följande i din kommandorad (eller po4a-konfigurationsrad):

source: It does work only with the DebianDoc and DocBook DTD. Adding support for a new DTD should be very easy. The mechanism is the same for every DTD, you just have to give a list of the existing tags and some of their characteristics.
sv: Det fungerar endast med DebianDoc och DocBook DTD. Att lägga till stöd för en ny DTD bör vara mycket enkelt. Mekanismen är densamma för alla DTD, du behöver bara ange en lista över befintliga taggar och några av deras egenskaper.
zh_hans: 它只适用于 DebianDoc 和 DocBook DTD。添加对新 DTD 的支持应该非常容易。该机制对于每个 DTD 都是相同的，您只需给出现有标记及其一些特征的列表。
zh_hant: 它只適用於 DebianDoc 和 DocBook DTD。新增對新 DTD 的支援應該非常容易。該機制對於每個 DTD 都是相同的，您只需給出現有標記及其一些特徵的列表。

source: I agree, this needs some more documentation, but it is still considered as beta, and I hate to document stuff which may/will change.
sv: Jag håller med, det behövs mer dokumentation, men det är fortfarande i betaversion, och jag avskyr att dokumentera saker som kan/kommer att ändras.
zh_hans: 我同意，这需要更多的文档，但它仍然被认为是测试版，我讨厌记录可能/将会改变的东西。
zh_hant: 我同意，這需要更多的文件，但它仍然被認為是測試版，我討厭記錄可能/將會改變的東西。

source: Warning, support for DTDs is quite experimental. I did not read any reference manual to find the definition of every tag. I did add tag definition to the module 'till it works for some documents I found on the net. If your document use more tags than mine, it won't work. But as I said above, fixing that should be quite easy.
sv: Varning, stödet för DTD:er är ganska experimentellt. Jag har inte läst någon referensmanual för att hitta definitionen av varje tagg. Jag har lagt till taggdefinitioner i modulen tills den fungerar för vissa dokument som jag hittat på nätet. Om ditt dokument använder fler taggar än mitt kommer det inte att fungera. Men som jag sa ovan bör det vara ganska enkelt att fixa det.
zh_hans: 警告，对 DTD 的支持只是试验性的。我没有阅读任何参考手册来查找每个标签的定义。我确实在模块中添加了标签定义，直到它适用于我在网上找到的一些文档。如果你的文档使用的标签比我的多，它就不会起作用。但正如我上面所说的，修复这个问题应该是相当容易的。
zh_hant: 警告，對 DTD 的支援只是試驗性的。我沒有閱讀任何參考手冊來查詢每個標籤的定義。我確實在模組中添加了標籤定義，直到它適用於我在網上找到的一些文件。如果你的文檔使用的標籤比我的多，它就不會起作用。但正如我上面所說的，修復這個問題應該是相當容易的。

source: I did test DocBook against the SAG (System Administrator Guide) only, but this document is quite big, and should use most of the DocBook specificities.
sv: Jag testade DocBook endast mot SAG (System Administrator Guide), men detta dokument är ganska stort och bör använda de flesta av DocBooks specifika funktioner.
zh_hans: 我只针对 SAG (系统管理员指南)测试了 DocBook，但是这个文档相当大，应该使用大多数 DocBook 特性。
zh_hant: 我只針對 SAG (系統管理員指南)測試了 DocBook，但是這個文件相當大，應該使用大多數 DocBook 特性。

source: For DebianDoc, I tested some of the manuals from the DDP, but not all yet.
sv: För DebianDoc testade jag några av manualerna från DDP, men ännu inte alla.
zh_hans: 对于 DebianDoc，我测试了 DDP 的一些手册，但还没有全部测试。
zh_hant: 對於 DebianDoc，我測試了 DDP 的一些手冊，但還沒有全部測試。

source: In case of file inclusion, string reference of messages in PO files (i.e. lines like C<#: en/titletoc.sgml:9460>) will be wrong.
sv: Vid filinkludering kommer strängreferenser för meddelanden i PO-filer (dvs. rader som C<#: en/titletoc.sgml:9460>) att bli felaktiga.
zh_hans: 在包含文件的情况下，PO 文件中消息的字符串引用(即类似 C<#: en/titletoc.sgml:9460> 的行)将是错误的。
zh_hant: 在包含檔案的情況下，PO 檔案中訊息的字串引用(即類似 C<#: en/titletoc.sgml:9460> 的行)將是錯誤的。

source: This is because I preprocess the file to protect the conditional inclusion (i.e. the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) and some entities (like C<&version;>) from L<onsgmls(1)> because I want them verbatim to the generated document. For that, I make a temp copy of the input file and do all the changes I want to this before passing it to L<onsgmls(1)> for parsing.
sv: Detta beror på att jag förbehandlar filen för att skydda den villkorliga inkluderingen (dvs. C<E<lt>! [ %foo [> och C<]]E<gt>>) och vissa enheter (som C<&version;>) från L<onsgmls(1)> eftersom jag vill att de ska vara ordagrant identiska med det genererade dokumentet. För att göra detta skapar jag en tillfällig kopia av inmatningsfilen och gör alla ändringar jag vill ha innan jag skickar den till L<onsgmls(1)> för parsning.

source: So that it works, I replace the entities asking for a file inclusion by the content of the given file (so that I can protect what needs to be in a subfile also). But nothing is done so far to correct the references (i.e., filename and line number) afterward. I'm not sure what the best thing to do is.
sv: För att det ska fungera ersätter jag enheterna som begär en filinkludering med innehållet i den angivna filen (så att jag också kan skydda det som behöver finnas i en underfil). Men hittills har ingenting gjorts för att korrigera referenserna (dvs. filnamn och radnummer) efteråt. Jag är inte säker på vad som är bäst att göra.
zh_hans: 为了使其正常工作，我将请求包含文件的实体替换为给定文件的内容 (这样我也可以保护子文件中需要的内容)。但是到目前为止，没有采取任何措施来纠正后面的引用 (即文件名和行号)。我不确定最好的办法是什么。
zh_hant: 為了使其正常工作，我將請求包含檔案的實體替換為給定檔案的內容 (這樣我也可以保護子檔案中需要的內容)。但是到目前為止，沒有采取任何措施來糾正後面的引用 (即文件名和行號)。我不確定最好的辦法是什麼。

source: This module is an adapted version of sgmlspl (SGML postprocessor for the ONSGMLS parser) which was:
sv: Denna modul är en anpassad version av sgmlspl (SGML-efterbehandlare för ONSGMLS-parsern) som var:
zh_hans: 此模块是 sgmlspl (用于 ONSGMLS 解析器的 SGML 后处理器) 的改编版本，它是：
zh_hant: 此模組是 sgmlspl (用於 ONSGMLS 解析器的 SGML 後處理器) 的改編版本，它是：

source: The adaptation for po4a was done by:
sv: Anpassningen för po4a gjordes av:
zh_hans: 对 po4a 的改编是通过以下方式完成的：
zh_hant: 對 po4a 的改編是透過以下方式完成的：

source: __END__
sv: __SLUT__

source: Locale::Po4a::SimplePod - convert POD data from/to PO files, with Pod::Simple
sv: Locale::Po4a::SimplePod – konvertera POD-data från/till PO-filer med Pod::Simple

source: [po4a_paths] /path/to/pot $lang:/path/to/po [type:SimplePod] /path/to/source.pod $lang:/path/to/localized.pod
sv: [po4a_paths] /sökväg/till/pot $lang:/sökväg/till/po [type:SimplePod] /sökväg/till/källa.pod $lang:/sökväg/till/lokalanpassad.pod

source: or
sv: eller

source: [po4a_paths] /path/to/pot $lang:/path/to/po [po4a_alias:pod] SimplePod [type:pod] /path/to/source.pod $lang:/path/to/localized.pod
sv: [po4a_paths] /sökväg/till/pot $lang:/sökväg/till/po [po4a_alias:pod] SimplePod [type:pod] /sökväg/till/källa.pod $lang:/sökväg/till/lokalanpassad.pod

source: This is a module to help the translation of documentation in the POD format (the preferred language for documenting Perl) into other human languages.
sv: Detta är ett modul som hjälper till att översätta dokumentation i POD-format (det föredragna språket för dokumentation av Perl) till andra mänskliga språk.

source: The main differences between the current Pod format and the SimplePod format are as follows:
sv: De viktigaste skillnaderna mellan det nuvarande Pod-formatet och SimplePod-formatet är följande:

source: SimplePod format never includes additional newlines in messages to be translated. The current Pod format, however, may contain extra newlines, particularly in verbatim message entries.
sv: SimplePod-formatet innehåller aldrig extra radbrytningar i meddelanden som ska översättas. Det nuvarande Pod-formatet kan dock innehålla extra radbrytningar, särskilt i ordagrant återgivna meddelanden.

source: Paragraphs may be rendered with line wrapping. The L<Pod::Parser> module might apply special handling for line wrapping, making it difficult to replicate with L<Pod::Simple>. However, L<Pod::Simple> appears to produce a more natural output.
sv: Avsnitt kan återges med radbrytning. L-<Pod::Parser> -modulen kan tillämpa särskild hantering för radbrytning, vilket gör det svårt att replikera med L-<Pod::Simple>. L-<Pod::Simple> verkar dock ge ett mer naturligt resultat.

source: In SimplePod, the C<=for> message (e.g., C<=for comment text>) does not include a format name (such as C<comment>), so the message consists solely of text. In contrast, the current Pod format retains the format name, resulting in a message like C<comment text>. The former behavior is considered more comfortable for translators.
sv: I SimplePod innehåller C-<=for> -meddelandet (t.ex. C<=for comment text>) inte något formatnamn (som C<comment>), så meddelandet består enbart av text. Däremot behåller det nuvarande Pod-formatet formatnamnet, vilket resulterar i ett meddelande som C<comment text>. Det förstnämnda beteendet anses vara bekvämare för översättare.

source: Entries like the one below, which denote C<=end comment>, are no longer present as seen in the current Pod module. Since these are not translatable messages, their absence is an improvement.
sv: Inlägg som det nedan, som betecknar C<=end comment>, finns inte längre i den aktuella Pod-modulen. Eftersom dessa inte är översättningsbara meddelanden är deras frånvaro en förbättring.

source: #. type: =end #: sample.pod:10 msgid "comment" msgstr ""
sv: #. type: =end #: sample.pod:10 msgid "kommentar" msgstr ""

source: Text blocks whose POD format validity is uncertain are now treated as C<no-wrap>. This applies, for example, to the content within a C<=begin html> block. In the Pod module, these were not treated as C<no-wrap>, which sometimes resulted in line wrapping.
sv: Textblock vars POD-format är osäkert behandlas nu som C-<no-wrap>. Detta gäller till exempel innehållet i ett C-<=begin html> -block. I Pod-modulen behandlades dessa inte som C-<no-wrap>, vilket ibland resulterade i radbrytningar.

source: The C<=begin> parameter section is no longer subject to translation. In the current Pod module, it is included. If there is a demand to include it in translation, please report it.
sv: Parametersektionen C<=begin> översätts inte längre. I den aktuella Pod-modulen ingår den. Om det finns ett behov av att inkludera den i översättningen, vänligen rapportera detta.

source: This module is still newly developed, so it is less stable than L<Locale::Po4a::Pod>. It continues to evolve, and there is room for further refinement. Its behavior might change over time, and additional options may be introduced to better optimize the translation experience for users. Feedback and use cases from real-world applications will play a key role in guiding its future development.
sv: Denna modul är fortfarande nyutvecklad, så den är mindre stabil än L<Locale::Po4a::Pod>. Den fortsätter att utvecklas och det finns utrymme för ytterligare förbättringar. Dess beteende kan komma att förändras över tid och ytterligare flaggor kan introduceras för att optimera översättningsupplevelsen för användarna. Återkoppling och användningsfall från verkliga tillämpningar kommer att spela en viktig roll för att styra dess framtida utveckling.

source: The code is fully covered by our test suite, and we're not aware of any existing bugs. However, as of 2025, it hasn't been battle-tested in real-world translation workflows by external projects. That said, we believe the module is ready for production use, even if some bugs may inevitably be discovered as it gains wider adoption.
sv: Koden täcks helt av vår testserie och vi känner inte till några befintliga buggar. Men 2025 har den ännu inte testats i verkliga översättningsarbetsflöden i externa projekt. Vi anser dock att modulen är redo för produktionsanvändning, även om vissa buggar oundvikligen kan upptäckas när den får bredare användning.

source: This module is intended to replace the current L<Locale::Po4a::Pod> module. The reason is that L<Pod::Parser>, which is used by the current L<Locale::Po4a::Pod>, is now deprecated, and it is recommended to use L<Pod::Simple> instead. See also L<GitHub issue #256 "Consider migrating away from deprecated C<Pod::Parser>"|https://github.com/mquinson/po4a/issues/256>.
sv: Denna modul är avsedd att ersätta den nuvarande L<Locale::Po4a::Pod> -modulen. Anledningen är att L<Pod::Parser>, som används av den nuvarande L<Locale::Po4a::Pod>, nu är föråldrad, och det rekommenderas att använda L<Pod::Simple> istället. Se även L<GitHub issue #256 "Consider migrating away from deprecated C<Pod::Parser>"|https://github.com/mquinson/po4a/issues/256>.

source: Locale::Po4a::TeX - convert TeX documents and derivatives from/to PO files
sv: Locale::Po4a::TeX - konvertera TeX-dokument och derivat från/till PO-filer
zh_hans: Locale::Po4a::TeX - 将 TeX 文档和衍生品从/转换为 PO 文件
zh_hant: Locale::Po4a::TeX - 將 TeX 文件和衍生品從/轉換為 PO 檔案

source: Locale::Po4a::TeX is a module to help the translation of TeX documents into other [human] languages. It can also be used as a base to build modules for TeX-based documents.
sv: Locale::Po4a::TeX är ett modul som hjälper till att översätta TeX-dokument till andra [mänskliga] språk. Det kan också användas som bas för att bygga moduler för TeX-baserade dokument.
zh_hans: Locale::Po4a::TeX 是一个帮助将 TeX 文档翻译成其他 [人类] 语言的模块。它还可以用作构建基于 TeX 文档的模块的基础。
zh_hant: Locale::Po4a::TeX 是一個幫助將 TeX 文件翻譯成其他 [人類] 語言的模組。它還可以用作構建基於 TeX 文件的模組的基礎。

source: Users should probably use the LaTeX module, which inherits from the TeX module and contains the definitions of common LaTeX commands.
sv: Användare bör antagligen använda LaTeX-modulen, som ärver från TeX-modulen och innehåller definitioner av vanliga LaTeX-kommandon.
zh_hans: 用户可能应该使用 LaTeX 模块，它继承自 TeX 模块并包含常见 LaTeX 命令的定义。
zh_hant: 使用者可能應該使用 LaTeX 模組，它繼承自 TeX 模組幷包含常見 LaTeX 命令的定義。

source: TRANSLATING WITH PO4A::TEX
sv: ÖVERSÄTTNING MED PO4A::TEX
zh_hans: 使用 PO4A::TEX 进行翻译
zh_hant: 使用 PO4A::TEX 進行翻譯

source: This module can be used directly to handle generic TeX documents. This will split your document in smaller blocks (paragraphs, verbatim blocks, or even smaller like titles or indexes).
sv: Denna modul kan användas direkt för att hantera generiska TeX-dokument. Detta delar upp ditt dokument i mindre block (stycken, verbatim-block eller ännu mindre som titlar eller index).
zh_hans: 此模块可直接用于处理通用 TeX 文档。这将把您的文档拆分成更小的块 (段落、逐字块，甚至更小的块，如标题或索引)。
zh_hant: 此模組可直接用於處理通用 TeX 文件。這將把您的文件拆分成更小的塊 (段落、逐字塊，甚至更小的塊，如標題或索引)。

source: There are some options (described in the next section) that can customize this behavior. If this doesn't fit to your document format you're encouraged to write your own derivative module from this, to describe your format's details. See the section B<WRITING DERIVATE MODULES> below, for the process description.
sv: Det finns några flaggor (beskrivna i nästa avsnitt) som kan anpassa detta beteende. Om detta inte passar ditt dokumentformat uppmuntras du att skriva din egen derivatmodul utifrån denna, för att beskriva detaljerna i ditt format. Se avsnittet B-<WRITING DERIVATE MODULES> en nedan för en beskrivning av processen.

source: This module can also be customized by lines starting with "% po4a:" in the TeX file. This process is described in the B<INLINE CUSTOMIZATION> section.
sv: Denna modul kan också anpassas med rader som börjar med "% po4a:" i TeX-filen. Denna process beskrivs i avsnittet B-<INLINE CUSTOMIZATION>.
zh_hans: 该模块还可以通过 TeX 文件中以 "% po4a:" 开头的行进行定制。此过程在 B<INLINE CUSTOMIZATION> 一节中介绍。
zh_hant: 該模組還可以透過 TeX 檔案中以 "% po4a:" 開頭的行進行定製。此過程在 B<INLINE CUSTOMIZATION> 一節中介紹。

source: Comma-separated list of environments which should not be re-wrapped.
sv: Kommaseparerad lista över miljöer som inte ska ombrytas.
zh_hans: 不应重新封装的环境的逗号分隔列表。
zh_hant: 不應重新封裝的環境的逗號分隔列表。

source: Note that there is a difference between verbatim and no_wrap environments. There is no command and comments analysis in verbatim blocks.
sv: Observera att det finns en skillnad mellan verbatim- och no_wrap-miljöer. Det finns ingen kommando- och kommentaranalys i verbatim-block.
zh_hans: 请注意，逐字和 no_wrap 环境之间存在差异。在逐字逐句的块中没有命令和注释分析。
zh_hant: 請注意，逐字和 no_wrap 環境之間存在差異。在逐字逐句的塊中沒有命令和註釋分析。

source: If this environment was not already registered, po4a will consider that this environment does not take any parameters.
sv: Om denna miljö inte redan har registrerats kommer po4a att anta att denna miljö inte tar emot några parametrar.
zh_hans: 如果此环境尚未注册，则 po4a 将考虑此环境不会接受任何参数。
zh_hant: 如果此環境尚未註冊，則 po4a 將考慮此環境不會接受任何引數。

source: Colon-separated list of files that should not be included by \input and \include.
sv: Kolonavgränsad lista över filer som inte ska inkluderas av \input och \include.
zh_hans: 不应由 \input 和 \include 包含的文件的冒号分隔列表。
zh_hant: 不應由 \input 和 \include 包含的檔案的冒號分隔列表。

source: Comma-separated list of environments which should be taken as verbatim.
sv: Kommaseparerad lista över miljöer som ska tas bokstavligt.
zh_hans: 应逐字处理的环境的逗号分隔列表。
zh_hant: 應逐字處理的環境的逗號分隔列表。

source: Use these options to override the default behavior of the defined commands.
sv: Använd dessa flaggor för att åsidosätta standardbeteendet för de definierade kommandona.
zh_hans: 使用这些选项可以替代已定义命令的默认行为。
zh_hant: 使用這些選項可以替代已定義命令的預設行為。

source: The TeX module can be customized with lines starting by B<% po4a:>. These lines are interpreted as commands to the parser. The following commands are recognized:
sv: TeX-modulen kan anpassas med rader som börjar med B<% po4a:>. Dessa rader tolkas som kommandon till parsern. Följande kommandon känns igen:
zh_hans: TeX 模块可以使用以 B<% po4a:> 开头的行进行自定义。这些行被解释为解析器的命令。可以识别以下命令：
zh_hant: TeX 模組可以使用以 B<% po4a:> 開頭的行進行自定義。這些行被解釋為解析器的命令。可以識別以下命令：

source: Indicates that the arguments of the I<command1> command should be treated as the arguments of the I<command2> command.
sv: Anger att argumenten för kommandot I<command1> ska behandlas som argument för kommandot I<command2>.
zh_hans: 指示 I<command1> 命令的参数应作为 I<command2> 命令的参数处理。
zh_hant: 指示 I<command1> 命令的引數應作為 I<command2> 命令的引數處理。

source: This describes in detail the parameters of the I<command1> command. This information will be used to check the number of arguments and their types.
sv: Här beskrivs i detalj parametrarna för kommandot I<command1>. Denna information kommer att användas för att kontrollera antalet argument och deras typer.
zh_hans: 这详细描述了 I<command1> 命令的参数。此信息将用于检查参数的数量及其类型。
zh_hant: 這詳細描述了 I<command1> 命令的引數。此資訊將用於檢查引數的數量及其型別。

source: You can precede the I<command1> command by
sv: Du kan föregå kommandot I<command1> med
zh_hans: 您可以在 I<command1> 之前加上
zh_hant: 您可以在 I<command1> 之前加上

source: an asterisk (B<*>)
sv: en asterisk (B<*>)
zh_hans: 一个星号 (B<*>)
zh_hant: 一個星號 (B<*>)

source: po4a will extract this command from paragraphs (if it is located at the beginning or the end of a paragraph). The translators will then have to translate the parameters that are marked as translatable.
sv: po4a extraherar detta kommando från stycken (om det finns i början eller slutet av ett stycke). Översättarna måste sedan översätta de parametrar som är markerade som översättningsbara.
zh_hans: po4a 将从段落中提取此命令 (如果它位于段落的开头或结尾)。然后，翻译者必须翻译标记为可翻译的参数。
zh_hant: po4a 將從段落中提取此命令 (如果它位於段落的開頭或結尾)。然後，翻譯者必須翻譯標記為可翻譯的引數。

source: a plus (B<+>)
sv: ett plus (B<+>)
zh_hans: 一个加号 (B<+>)
zh_hant: 一個加號 (B<+>)

source: As for an asterisk, the command will be extracted if it appear at an extremity of a block, but the parameters won't be translated separately. The translator will have to translate the command concatenated to all its parameters. This keeps more context, and is useful for commands with small words in parameter, which can have multiple meanings (and translations).
sv: När det gäller asterisker extraheras kommandot om det förekommer i slutet av ett block, men parametrarna översätts inte separat. Översättaren måste översätta kommandot tillsammans med alla dess parametrar. Detta bevarar mer sammanhang och är användbart för kommandon med korta ord i parametrarna, som kan ha flera betydelser (och översättningar).
zh_hans: 对于星号，如果它出现在块的末端，命令将被提取，但参数不会单独转换。翻译器将不得不翻译连接到其所有参数的命令。这保留了更多的上下文，并且对于参数中包含较小单词的命令非常有用，这些命令可以有多种含义(和翻译)。
zh_hant: 對於星號，如果它出現在塊的末端，命令將被提取，但引數不會單獨轉換。翻譯器將不得不翻譯連線到其所有引數的命令。這保留了更多的上下文，並且對於引數中包含較小單詞的命令非常有用，這些命令可以有多種含義(和翻譯)。

source: Note: In this case you don't have to specify which parameters are translatable, but po4a must know the type and number of parameters.
sv: Observera: I detta fall behöver du inte ange vilka parametrar som är översättningsbara, men po4a måste känna till parametrarna typ och antal.
zh_hans: 注意：在这种情况下，您不必指定哪些参数是可翻译的，但 po4a 必须知道参数的类型和数量。
zh_hant: 注意：在這種情況下，您不必指定哪些引數是可翻譯的，但 po4a 必須知道引數的型別和數量。

source: a minus (B<->)
sv: ett minus (B<->)
zh_hans: 一个减号 (B<->)
zh_hant: 一個減號 (B<->)
