Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: A regular expression matching lines which introduce breaks. The regular expression will be anchored so that the whole line must match.
sv: Ett reguljärt uttryck som matchar rader som introducerar brytningar. Det reguljära uttrycket kommer att förankras så att hela raden måste matcha.
zh_hans: 引入中断的正则表达式匹配行。 正则表达式将锚定，以便整行必须匹配。
zh_hant: 引入中斷的正則表示式匹配行。 正則表示式將錨定，以便整行必須匹配。

source: Handle the header and footer of released versions, which only contain non translatable information.
sv: Hantera sidhuvudet och sidfoten i släppta versioner, som endast innehåller information som inte kan översättas.
zh_hans: 处理仅包含不可翻译信息的已发布版本的页眉和页脚。
zh_hant: 處理僅包含不可翻譯資訊的已釋出版本的頁首和頁尾。

source: Handle the fortunes format, which separate fortunes with a line which consists in '%' or '%%', and use '%%' as the beginning of a comment.
sv: Hantera formatet för lyckosamma ord, som separerar lyckosamma ord med en rad som består av '%' eller '%%', och använd '%%' som början på en kommentar.
zh_hans: 处理富文本格式，该格式用位于 '%' 或 '%%' 中的一行分隔财富，并使用 '%%' 作为注释的开头。
zh_hant: 處理富文字格式，該格式用位於 '%' 或 '%%' 中的一行分隔財富，並使用 '%%' 作為注釋的開頭。

source: Handle some special markup in Markdown-formatted texts.
sv: Hantera vissa specialmarkeringar i Markdown-formaterade texter.
zh_hans: 处理 Markdown 格式文本中的一些特殊标记。
zh_hant: 處理 Markdown 格式文字中的一些特殊標記。

source: B<yfm_keys> (markdown-only)
sv: B<yfm_keys> (endast markdown)
zh_hans: B<yfm_keys> (仅限 markdown)
zh_hant: B<yfm_keys> (僅限 markdown)

source: B<yfm_lenient> (markdown only)
sv: B<yfm_lenient> (endast markdown)

source: Allow the YAML Front Matter parser to fail on malformated headers. This is particularly helpful when your file starts with a horizontal ruler instead of a YAML Front Matter, but you insist on using three dashes only for your ruler.
sv: Tillåt YAML Front Matter-parsern att misslyckas med felaktigt formaterade rubriker. Detta är särskilt användbart när din fil börjar med en horisontell linjal istället för en YAML Front Matter, men du insisterar på att endast använda tre streck för din linjal.

source: B<yfm_paths> (markdown only)
sv: B<yfm_paths> (endast markdown)

source: B<yfm_skip_array> (markdown-only)
sv: B<yfm_skip_array> (endast markdown)
zh_hans: B<yfm_skip_array> (仅限 markdown)
zh_hant: B<yfm_skip_array> (僅限 markdown)

source: Handle Debian's control files. A comma-separated list of fields to be translated can be provided.
sv: Hantera Debians kontrollfiler. En kommaseparerad lista över fält som ska översättas kan tillhandahållas.

source: Prevent po4a from wrapping any lines. This means that every content is handled verbatim, even simple paragraphs.
sv: Förhindra att po4a bryter några rader. Detta innebär att allt innehåll hanteras ordagrant, även enkla stycken.
zh_hans: 防止 po4a 换行。这意味着每个内容都是逐字处理的，即使是简单的段落。
zh_hant: 防止 po4a 換行。這意味著每個內容都是逐字處理的，即使是簡單的段落。

source: Tested successfully on simple text files and NEWS.Debian files.
sv: Testad med framgång på enkla textfiler och NEWS.Debian-filer.
zh_hans: 在简单文本文件和 NEWS.Debian 文件上测试成功。
zh_hant: 在簡單文字檔案和 NEWS.Debian 檔案上測試成功。

source: Locale::Po4a::TransTractor - generic trans(lator ex)tractor.
sv: Locale::Po4a::TransTractor – generisk trans(lator ex)tractor.
zh_hans: Locale::Po4a::TransTractor - 通用翻译提取器。
zh_hant: Locale::Po4a::TransTractor - 通用翻譯提取器。

source: This class is the ancestor of every po4a parser used to parse a document, to search translatable strings, to extract them to a PO file and to replace them by their translation in the output document.
sv: Denna klass är föregångaren till alla po4a-parsers som används för att analysera ett dokument, söka efter översättningsbara strängar, extrahera dem till en PO-fil och ersätta dem med deras översättning i utdatadokumentet.
zh_hans: 这个类是每个 po4a 解析器的祖先，用于解析文档、搜索可翻译字符串、将它们提取到 PO 文件并在输出文档中用它们的翻译替换它们。
zh_hant: 這個類是每個 po4a 解析器的祖先，用於解析文件、搜尋可翻譯字串、將它們提取到 PO 檔案並在輸出文件中用它們的翻譯替換它們。

source: More formally, it takes the following arguments as input:
sv: Mer formellt tar den följande argument som indata:
zh_hans: 更正式地说，它接受以下参数作为输入：
zh_hant: 更正式地說，它接受以下引數作為輸入：

source: a document to translate;
sv: ett dokument att översätta;
zh_hans: 要翻译的文档;
zh_hant: 要翻譯的文件;

source: a PO file containing the translations to use.
sv: en PO-fil som innehåller de översättningar som ska användas.
zh_hans: 包含要使用的翻译的 PO 文件。
zh_hant: 包含要使用的翻譯的 PO 檔案。

source: As output, it produces:
sv: Som utdata producerar den:
zh_hans: 作为输出，它产生：
zh_hant: 作為輸出，它產生：

source: another PO file, resulting of the extraction of translatable strings from the input document;
sv: en annan PO-fil, som är resultatet av extraheringen av översättningsbara strängar från indatadokumentet;
zh_hans: 另一个 PO 文件，其结果是从输入文档中提取可翻译字符串;
zh_hant: 另一個 PO 檔案，其結果是從輸入文件中提取可翻譯字串;

source: a translated document, with the same structure than the one in input, but with all translatable strings replaced with the translations found in the PO file provided in input.
sv: ett översatt dokument med samma struktur som det ursprungliga, men där alla översättningsbara strängar har ersatts med översättningarna i den PO-fil som angetts som indata.
zh_hans: 翻译的文档，其结构与输入中的文档相同，但所有可翻译字符串都替换为输入中提供的 PO 文件中的翻译。
zh_hant: 翻譯的文件，其結構與輸入中的文件相同，但所有可翻譯字串都替換為輸入中提供的 PO 檔案中的翻譯。

source: Here is a graphical representation of this:
sv: Här är en grafisk representation av detta:
zh_hans: 以下是这一点的图形表示：
zh_hant: 以下是這一點的圖形表示：

source: FUNCTIONS YOUR PARSER SHOULD OVERRIDE
sv: FUNKTIONER SOM DIN PARSARE BÖR ÖVERSKRIVA
zh_hans: 解析器应该重写的函数
zh_hant: 解析器應該重寫的函式

source: This is where all the work takes place: the parsing of input documents, the generation of output, and the extraction of the translatable strings. This is pretty simple using the provided functions presented in the section B<INTERNAL FUNCTIONS> below. See also the B<SYNOPSIS>, which presents an example.
sv: Det är här allt arbete utförs: analys av indata, generering av utdata och extrahering av översättningsbara strängar. Detta är ganska enkelt med hjälp av de funktioner som presenteras i avsnittet B<INTERNAL FUNCTIONS> nedan. Se även B<SYNOPSIS>, som innehåller ett exempel.
zh_hans: 所有工作都在这里进行：解析输入文档、生成输出和提取可翻译字符串。使用下面 B<INTERNAL FUNCTIONS> 章节中提供的函数可以非常简单地实现这一点。另请参阅 B<SYNOPSIS>，它提供了一个示例。
zh_hant: 所有工作都在這裡進行：解析輸入文件、生成輸出和提取可翻譯字串。使用下面 B<INTERNAL FUNCTIONS> 章節中提供的函式可以非常簡單地實現這一點。另請參閱 B<SYNOPSIS>，它提供了一個示例。

source: This function is called by the process() function below, but if you choose to use the new() function, and to add content manually to your document, you will have to call this function yourself.
sv: Denna funktion anropas av funktionen process() nedan, men om du väljer att använda funktionen new() och lägga till innehåll manuellt i ditt dokument måste du själv anropa denna funktion.
zh_hans: 此函数由下面的 process() 函数调用，但如果您选择使用 new() 函数，并手动将内容添加到文档中，则必须自己调用此函数。
zh_hant: 此函式由下面的 process() 函式呼叫，但如果您選擇使用 new() 函式，並手動將內容新增到文件中，則必須自己呼叫此函式。

source: This function returns the header we should add to the produced document, quoted properly to be a comment in the target language. See the section B<Educating developers about translations>, from L<po4a(7)|po4a.7>, for what it is good for.
sv: Denna funktion returnerar den rubrik som vi ska lägga till i det producerade dokumentet, korrekt citerad för att vara en kommentar på målspråket. Se avsnittet B<Educating developers about translations>, från L<po4a(7)|po4a.7>, för information om vad den är bra för.
zh_hans: 此函数返回我们应该添加到生成的文档中的标题，并将其正确引用为目标语言中的注释。有关它的好处，请参阅 L<po4a(7)|po4a.7> 中的 B<Educating developers about translations> 章节。
zh_hant: 此函式返回我們應該新增到生成的文件中的標題，並將其正確引用為目標語言中的注釋。有關它的好處，請參閱 L<po4a(7)|po4a.7> 中的 B<Educating developers about translations> 章節。

source: The following example parses a list of paragraphs beginning with "<p>". For the sake of simplicity, we assume that the document is well formatted, i.e. that '<p>' tags are the only tags present, and that this tag is at the very beginning of each paragraph.
sv: Följande exempel analyserar en lista med stycken som börjar med "<p>". För enkelhetens skull antar vi att dokumentet är välformaterat, dvs. att '<p>" är de enda taggarna som finns, och att denna tagg finns i början av varje stycke.
zh_hans: 下面的示例解析以 "<p>" 开头的段落列表。为简单起见，我们假定文档格式良好，即 "<p>" 标记是唯一存在的标记，并且该标记位于每个段落的最开始。
zh_hant: 下面的示例解析以 "<p>" 開頭的段落列表。為簡單起見，我們假定文件格式良好，即 "<p>" 標記是唯一存在的標記，並且該標記位於每個段落的最開始。

source: sub parse { my $self = shift; PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # Not the first time we see <p>. # Reput the current line in input, # and put the built paragraph to output $self->unshiftline($line,$lref); # Now that the document is formed, translate it: # - Remove the leading tag $paragraph =~ s/^<p>//s; # - push to output the leading tag (untranslated) and the # rest of the paragraph (translated) $self->pushline( "<p>" . $self->translate($paragraph,$pararef) ); next PARAGRAPH; } else { # Append to the paragraph $paragraph .= $line; $pararef = $lref unless(length($pararef)); } # Reinit the loop ($line,$lref)=$self->shiftline(); } # Did not get a defined line? End of input file. return; } }
sv: sub parse { my $self = shift; PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ &amp;&amp; !$first--; ) { # Inte första gången vi ser <p>. # Sätt tillbaka den aktuella raden i indata, # och lägg den byggda paragrafen till utdata $self->unshiftline($line,$lref); # Nu när dokumentet är format, översätt det: # - Ta bort den inledande taggen $paragraph =~ s/^<p>//s; # - skicka den inledande taggen (oöversatt) och # resten av stycket (översatt) till utdata $self->pushline( "<p>" . $self->translate($paragraph,$pararef) ); nästa PARAGRAF; } else { # Lägg till i paragrafen $paragraph .= $line; $pararef = $lref unless(length($pararef)); } # Starta om slingan ($line,$lref)=$self->shiftline(); } # Fick du inte en definierad rad? Slut på inmatningsfilen. return; } }

source: Once you've implemented the parse function, you can use your document class, using the public interface presented in the next section.
sv: När du har implementerat parse-funktionen kan du använda din dokumentklass med hjälp av det offentliga gränssnittet som presenteras i nästa avsnitt.
zh_hans: 一旦实现了解析函数，就可以使用下一节中介绍的公共接口来使用 document 类。
zh_hant: 一旦實現瞭解析函式，就可以使用下一節中介紹的公共介面來使用 document 類。

source: By default, your document class will only read from the user-provided file. To handle file inclusion (e.g. with \include in LaTeX or similar), you need to call C<read()> on each file to be included. See the Tex.pm module for an example of an overridden C<read()> function that not only loads the master file but also search for inclusion requests and gracefully adds the included files to the array of lines to be parsed. The included files are inlined in the translated document by the Tex.pm module: all the content is placed in the output translation document instead of creating separate files for the translation of included files. This is somewhat suboptimal, in particular if an included file is used in many files, but changing this would be quite complex and no document class does it so far. It would imply overloading the C<write()> function that is in charge of writing the content into the produced localized file, but I'm not sure that the usage benefit would worth the code complexity. Localized files are worthless files that can be removed from disk once the document compilation is done, so the waste of space is very discutable.
sv: Som standard läser din dokumentklass endast från den fil som användaren tillhandahåller. För att hantera filinkludering (t.ex. med \include i LaTeX eller liknande) måste du anropa C<read()> för varje fil som ska inkluderas. Se modulen Tex.pm för ett exempel på en överskriven C<read()>-funktion som inte bara laddar huvudfilen utan också söker efter inkluderingsförfrågningar och elegant lägger till de inkluderade filerna i raden av rader som ska analyseras. De inkluderade filerna infogas i det översatta dokumentet av modulen Tex.pm: allt innehåll placeras i det översatta dokumentet istället för att skapa separata filer för översättningen av inkluderade filer. Detta är något suboptimalt, särskilt om en inkluderad fil används i många filer, men att ändra detta skulle vara ganska komplicerat och ingen dokumentklass gör det hittills. Det skulle innebära att man överbelastar C<write()>-funktionen som ansvarar för att skriva innehållet till den producerade lokaliserade filen, men jag är inte säker på att användningsfördelen skulle vara värd kodkomplexiteten. Lokaliserade filer är värdelösa filer som kan tas bort från disken när dokumentkompileringen är klar, så slöseriet med utrymme är mycket diskutabelt.

source: Please note that using C<read()> to add content to the list and C<shiftline()> to get this content is optional. For example, the Sgml.pm module does not use this mechanism because it uses an external parser instead. Check the C<read()> function from Sgml.pm to see how the filenames are saved in a private array, and then how C<parse()> is overridden to not use the classical parse features but a SGML-specific C<parse_file()> instead. This later function is very different from the rest of the po4a code base, as all the grunt work is done by the C<onsgmls> external binary.
sv: Observera att det är valfritt att använda C<read()> för att lägga till innehåll i listan och C<shiftline()> för att hämta detta innehåll. Modulen Sgml.pm använder till exempel inte denna mekanism, eftersom den istället använder en extern parser. Kontrollera funktionen C<read()> från Sgml.pm för att se hur filnamnen sparas i en privat array och hur C<parse()> sedan åsidosätts för att inte använda de klassiska parsningsfunktionerna utan istället en SGML-specifik C<parse_file()>. Den senare funktionen skiljer sig mycket från resten av po4a-kodbasen, eftersom allt grovjobb utförs av den externa binären C<onsgmls>.

source: PUBLIC INTERFACE for scripts using your parser
sv: PUBLIC INTERFACE för skript som använder din parser
zh_hans: 使用解析器的脚本的公共接口
zh_hant: 使用解析器的指令碼的公共介面

source: Constructor
sv: Konstruktör
zh_hans: 构造 函数
zh_hant: 構造 函式

source: This function can do all you need to do with a po4a document in one invocation. Its arguments must be packed as a hash. ACTIONS:
sv: Denna funktion kan göra allt du behöver göra med ett po4a-dokument i ett enda anrop. Dess argument måste packas som en hash. ÅTGÄRDER:
zh_hans: 此函数可以在一次调用中完成处理 po4a 文档所需的所有操作。它的参数必须打包为散列。操作：
zh_hant: 此函式可以在一次呼叫中完成處理 po4a 文件所需的所有操作。它的引數必須打包為散列。操作：

source: Reads all the PO files specified in po_in_name
sv: Läser alla PO-filer som anges i po_in_name
zh_hans: 读取 po_in_name 中指定的所有 PO 文件
zh_hant: 讀取 po_in_name 中指定的所有 PO 檔案

source: Reads all original documents specified in file_in_name
sv: Läser alla originaldokument som anges i file_in_name
zh_hans: 读取在 file_in_name 中指定的所有原始文档
zh_hant: 讀取在 file_in_name 中指定的所有原始文件

source: Parses the document
sv: Analyserar dokumentet
zh_hans: 解析文档
zh_hant: 解析文件

source: Reads and applies all the addenda specified
sv: Läser och tillämpar alla angivna tillägg
zh_hans: 读取并应用所有指定的附录
zh_hant: 讀取並應用所有指定的附錄

source: Writes the translated document to file_out_name (if given)
sv: Skriver det översatta dokumentet till file_out_name (om angivet)
zh_hans: 将翻译的文档写入 file_out_name (如果给定)
zh_hant: 將翻譯的文件寫入 file_out_name (如果給定)

source: Writes the extracted PO file to po_out_name (if given)
sv: Skriver den extraherade PO-filen till po_out_name (om angivet)
zh_hans: 将提取的 PO 文件写入 po_out_name (如果给定)
zh_hant: 將提取的 PO 檔案寫入 po_out_name (如果給定)

source: ARGUMENTS, beside the ones accepted by new() (with expected type):
sv: ARGUMENT, förutom de som accepteras av new() (med förväntad typ):
zh_hans: 参数，除了 new() 接受的参数(具有预期类型)：
zh_hant: 引數，除了 new() 接受的引數(具有預期型別)：

source: file_in_name (@)
sv: fil_i_namn (@)

source: List of filenames where we should read the input document.
sv: Lista över filnamn där vi ska läsa in dokumentet.
zh_hans: 我们应该在其中读取输入文档的文件名列表。
zh_hant: 我們應該在其中讀取輸入文件的檔名列表。

source: Charset used in the input document (if it isn't specified, use UTF-8).
sv: Teckenuppsättning som används i indatadokumentet (om det inte anges, använd UTF-8).

source: file_out_name ($)
sv: filnamn_ut ($)

source: Filename where we should write the output document.
sv: Filnamn där vi ska skriva ut dokumentet.
zh_hans: 我们应该在其中写入输出文档的文件名。
zh_hant: 我們應該在其中寫入輸出文件的檔名。

source: Charset used in the output document (if it isn't specified, use UTF-8).
sv: Teckenuppsättning som används i utdatadokumentet (om det inte anges, använd UTF-8).

source: List of filenames where we should read the input PO files from, containing the translation which will be used to translate the document.
sv: Lista över filnamn där vi ska läsa in PO-filerna, som innehåller översättningen som kommer att användas för att översätta dokumentet.
zh_hans: 我们应该从中读取输入 PO 文件的文件名列表，其中包含将用于翻译文档的翻译。
zh_hant: 我們應該從中讀取輸入 PO 檔案的檔名列表，其中包含將用於翻譯文件的翻譯。

source: Filename where we should write the output PO file, containing the strings extracted from the input document.
sv: Filnamn där vi ska skriva ut PO-filen, som innehåller strängarna som extraherats från indokumentet.
zh_hans: 我们应该在其中写入输出 PO 文件的文件名，其中包含从输入文档提取的字符串。
zh_hant: 我們應該在其中寫入輸出 PO 檔案的檔名，其中包含從輸入文件提取的字串。

source: List of filenames where we should read the addenda from.
sv: Lista över filnamn där vi ska läsa tilläggen från.
zh_hans: 我们应该从中读取附录的文件名列表。
zh_hant: 我們應該從中讀取附錄的檔名列表。

source: Charset for the addenda.
sv: Teckenuppsättning för tillägget.
zh_hans: 附录的字符集。
zh_hant: 附錄的字符集。

source: new(%)
sv: ny(%)

source: Create a new po4a document. Accepted options (in the hash passed as a parameter):
sv: Skapa ett nytt po4a-dokument. Godkända flaggor (i hash som skickas som parameter):
zh_hans: 创建新的 po4a 文档。接受的选项 (在作为参数传递的哈希中)：
zh_hant: 建立新的 po4a 文件。接受的選項 (在作為引數傳遞的雜湊中)：

source: verbose ($)
sv: verbos ($)

source: Sets the verbosity.
sv: Ställer in detaljeringsgraden.
zh_hans: 设置详细程度。
zh_hant: 設定詳細程度。

source: debug ($)
sv: felsökning ($)

source: Sets the debugging.
sv: Ställer in felsökningen.
zh_hans: 设置调试。
zh_hant: 設定除錯。

source: The column at which we should wrap text in output document (default: 76).
sv: Den kolumn där vi ska bryta texten i utdatadokumentet (standard: 76).

source: The negative value means not to wrap lines at all.
sv: Det negativa värdet innebär att raderna inte ska brytas alls.

source: Also it accepts next options for underlying Po-files: B<porefs>, B<copyright-holder>, B<msgid-bugs-address>, B<package-name>, B<package-version>, B<wrap-po>.
sv: Det accepterar också följande flaggor för underliggande Po-filer: B<porefs>, B<copyright-holder>, B<msgid-bugs-address>, B<package-name>, B<package-version>, B<wrap-po>.

source: Manipulating document files
sv: Manipulera dokumentfiler
zh_hans: 操作文档文件
zh_hant: 操作文件檔案

source: read($$$)
sv: läs ($$$)

source: Add another input document data at the end of the existing array C<< @{$self->{TT}{doc_in}} >>.
sv: Lägg till ytterligare ett indatadokument i slutet av den befintliga matrisen C<< @{$self->{TT}{doc_in}} >>.

source: This function takes two mandatory arguments and an optional one. * The filename to read on disk; * The name to use as filename when building the reference in the PO file; * The charset to use to read that file (UTF-8 by default)
sv: Denna funktion tar två obligatoriska argument och ett valfritt. * Filnamnet som ska läsas på disken. * Namnet som ska användas som filnamn när referensen skapas i PO-filen. * Teckenuppsättningen som ska användas för att läsa filen (UTF-8 som standard)

source: This array C<< @{$self->{TT}{doc_in}} >> holds this input document data as an array of strings with alternating meanings. * The string C<$textline> holding each line of the input text data. * The string C<< $filename:$linenum >> holding its location and called as "reference" (C<linenum> starts with 1).
sv: Denna matris C<< @{$self->{TT}{doc_in}} >> innehåller data från det inmatade dokumentet som en matris av strängar med alternerande betydelser. * Strängen C<$textline> innehåller varje rad i den inmatade textdata. * Strängen C<< $filename:$linenum >> innehåller dess plats och kallas "referens" (C<linenum> börjar med 1).

source: Please note that it does not parse anything. You should use the parse() function when you're done with packing input files into the document.
sv: Observera att den inte analyserar något. Du bör använda funktionen parse() när du är klar med att packa inmatningsfilerna i dokumentet.
zh_hans: 请注意，它不解析任何内容。当您完成将输入文件打包到文档中时，应该使用 parse() 函数。
zh_hant: 請注意，它不解析任何內容。當您完成將輸入檔案打包到文件中時，應該使用 parse() 函式。

source: Write the translated document to the given filename.
sv: Skriv det översatta dokumentet till det angivna filnamnet.
zh_hans: 将翻译后的文档写入给定的文件名。
zh_hant: 將翻譯後的文件寫入給定的檔名。

source: This translated document data are provided by: * C<< $self->docheader() >> holding the header text for the plugin, and * C<< @{$self->{TT}{doc_out}} >> holding each line of the main translated text in the array.
sv: Dessa översatta dokumentdata tillhandahålls av: * C<< $self->docheader() >> som innehåller rubriktexten för tillägget, och * C<< @{$self->{TT}{doc_out}} >> som innehåller varje rad av den huvudsakliga översatta texten i arrayen.

source: Manipulating PO files
sv: Manipulera PO-filer
zh_hans: 操作 PO 文件
zh_hant: 操作 PO 檔案

source: Add the content of a file (which name is passed as argument) to the existing input PO. The old content is not discarded.
sv: Lägg till innehållet i en fil (vars namn anges som argument) till den befintliga inmatnings-PO:n. Det gamla innehållet raderas inte.
zh_hans: 将文件的内容（该名称作为参数传递）添加到现有输入 PO。旧内容不会丢弃。
zh_hant: 將檔案的內容（該名稱作為引數傳遞）新增到現有輸入 PO。舊內容不會丟棄。

source: Write the extracted PO file to the given filename.
sv: Skriv den extraherade PO-filen till det angivna filnamnet.
zh_hans: 将提取的 PO 文件写入给定的文件名。
zh_hant: 將提取的 PO 檔案寫入給定的檔名。

source: Returns some statistics about the translation done so far. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's stats about recent usage of the PO file, while msgfmt reports the status of the file. It is a wrapper to the Locale::Po4a::Po::stats_get function applied to the input PO file. Example of use:
sv: Returnerar statistik om den översättning som hittills har gjorts. Observera att det inte är samma statistik som den som skrivs ut av msgfmt --statistic. Här är det statistik om den senaste användningen av PO-filen, medan msgfmt rapporterar filens status. Det är ett skalprogram till funktionen Locale::Po4a::Po::stats_get som tillämpas på den inmatade PO-filen. Exempel på användning:
zh_hans: 返回到目前为止完成的转换的一些统计信息。请注意，它与 msgfmt --statistic 打印的统计数据不同。在这里，它是关于 PO 文件最近使用情况的统计信息，而 msgfmt 则报告该文件的状态。它是应用于输入 PO 文件的 Locale::Po4a::Po::stats_get 函数的封装。使用示例：
zh_hant: 返回到目前為止完成的轉換的一些統計資訊。請注意，它與 msgfmt --statistic 列印的統計資料不同。在這裡，它是關於 PO 檔案最近使用情況的統計資訊，而 msgfmt 則報告該檔案的狀態。它是應用於輸入 PO 檔案的 Locale::Po4a::Po::stats_get 函式的封裝。使用示例：

source: [normal use of the po4a document...] ($percent,$hit,$queries) = $document->stats(); print "We found translations for $percent\% ($hit from $queries) of strings.\n";
sv: [normal användning av po4a-dokumentet...] ($percent,$hit,$queries) = $document->stats(); print "Vi hittade översättningar för $percent\% ($hit från $queries) av strängar.\n";

source: Manipulating addenda
sv: Manipulering av tillägg
zh_hans: 操作附录
zh_hant: 操作附錄
