Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Argument can be followed by a comma and either B<wrap> or B<nowrap> keyword. References are written by default on a single line. The B<wrap> option wraps references on several lines, to mimic B<gettext> tools (B<xgettext> and B<msgmerge>). This option will become the default in a future release, because it is more sensible. The B<nowrap> option is available so that users who want to keep the old behavior can do so.
zh_hans: 参数后跟逗号和 B<wrap> B<nowrap> 关键字。 默认情况下，引用在一行上写入。 B<wrap> 将引用封装在多行上，以模拟 B<gettext>工具（B<xgettext> B<msgmerge>）。 此选项将成为将来版本中的默认值，因为它更明智。 B<nowrap> 选项可用，以便想要保留旧行为的用户可以这样做。
zh_hant: 引數後跟逗號和 B<wrap> B<nowrap> 關鍵字。 預設情況下，引用在一行上寫入。 B<wrap> 將引用封裝在多行上，以模擬 B<gettext>工具（B<xgettext> B<msgmerge>）。 此選項將成為將來版本中的預設值，因為它更明智。 B<nowrap> 選項可用，以便想要保留舊行為的使用者可以這樣做。

source: Po4a can also handle some more rare or specialized formats, such as the documentation of compilation options for the 2.4+ Linux kernels (L<Locale::Po4a::KernelHelp>) or the diagrams produced by the dia tool (L<Locale::Po4a:Dia>). Adding a new format is often very easy and the main task is to come up with a parser for your target format. See L<Locale::Po4a::TransTractor(3pm)> for more information about this.
zh_hans: Po4a 还可以处理一些比较罕见或专门的格式，比如 2.4+ Linux 内核 (L<Locale::Po4a::KernelHelp>) 的编译选项文档或 dia 工具 (L<Locale::Po4a:Dia>)生成的图表。添加新格式通常非常简单，主要任务是为您的目标格式提供一个解析器。有关这方面的更多信息，请参见 L<Locale::Po4a::TransTractor(3pm)>。
zh_hant: Po4a 還可以處理一些比較罕見或專門的格式，比如 2.4+ Linux 核心 (L<Locale::Po4a::KernelHelp>) 的編譯選項文件或 dia 工具 (L<Locale::Po4a:Dia>)生成的圖表。新增新格式通常非常簡單，主要任務是為您的目標格式提供一個解析器。有關這方面的更多資訊，請參見 L<Locale::Po4a::TransTractor(3pm)>。

source: PO4A-HEADER: position=About this document; mode=after; endboundary=</section>
zh_hans: PO4A-HEADER: position=关于本文档; mode=after; endboundary=</section>
zh_hant: PO4A-HEADER: position=關於本文件; mode=after; endboundary=</section>

source: PO4A-HEADER: position=À propos de ce document; mode=after; endboundary=</section>
zh_hans: PO4A-HEADER: position=关于本文档; mode=after; endboundary=</section>
zh_hant: PO4A-HEADER: position=關於本文件; mode=after; endboundary=</section>

source: PO4A-HEADER: position=About this document; mode=after; beginboundary=<section>
zh_hans: PO4A-HEADER: position=关于本文档; mode=after; beginboundary=<section>
zh_hant: PO4A-HEADER: position=關於本文件; mode=after; beginboundary=<section>

source: Mode | Boundary kind | Used boundary | Insertion point compared to the boundary ========|===============|========================|========================================= 'before'| 'endboundary' | last before 'position' | Right after the selected boundary 'before'|'beginboundary'| last before 'position' | Right before the selected boundary 'after' | 'endboundary' | first after 'position' | Right after the selected boundary 'after' |'beginboundary'| first after 'position' | Right before the selected boundary 'eof' | (none) | n/a | End of file
zh_hans: 模式 | 边界种类 | 使用的边界 | 与边界比较的插入点 ========|===============|========================|========================================= 'before'(之前)| 'endboundary'(结束边界) | last before 'position'(‘位置’之前的最后一个) | Right after the selected boundary(就在所选边界之后) 'before'(之前)|'beginboundary'(开始边界)| last before 'position' (‘位置’之前的最后一个)| Right before the selected boundary(就在所选边界之前) 'after'(之后) | 'endboundary'(结束边界) | first after 'position'(‘位置’之后的第一个) | Right after the selected boundary(就在所选边界之后) 'after'(之后) |'beginboundary'(开始边界)| first after 'position'(‘位置’之后的第一个) | Right before the selected boundary(就在所选边界之前) 'eof'(EOF) | (none) (无) | n/a | End of file(文件结尾)
zh_hant: 模式 | 邊界種類 | 使用的邊界 | 與邊界比較的插入點 ========|===============|========================|========================================= 'before'(之前)| 'endboundary'(結束邊界) | last before 'position'(‘位置’之前的最後一個) | Right after the selected boundary(就在所選邊界之後) 'before'(之前)|'beginboundary'(開始邊界)| last before 'position' (‘位置’之前的最後一個)| Right before the selected boundary(就在所選邊界之前) 'after'(之後) | 'endboundary'(結束邊界) | first after 'position'(‘位置’之後的第一個) | Right after the selected boundary(就在所選邊界之後) 'after'(之後) |'beginboundary'(開始邊界)| first after 'position'(‘位置’之後的第一個) | Right before the selected boundary(就在所選邊界之前) 'eof'(EOF) | (none) (無) | n/a | End of file(檔案結尾)

source: PO4A-HEADER: position=About this document; mode=after; beginboundary=<section> PO4A-HEADER: position=About this document ; mode=after; beginboundary=<section>
zh_hans: PO4A-HEADER: position=关于本文档; mode=after; beginboundary=<section> PO4A-HEADER: position=关于本文档; mode=after; beginboundary=<section>
zh_hant: PO4A-HEADER: position=關於本文件; mode=after; beginboundary=<section> PO4A-HEADER: position=關於本文件; mode=after; beginboundary=<section>

source: .SH "AUTHORS"
zh_hans: .SH "作者"
zh_hant: .SH "作者"

source: PO4A-HEADER:mode=after;position=AUTHORS;beginboundary=\.SH
zh_hans: PO4A-HEADER:mode=after;position=作者;beginboundary=\.SH
zh_hant: PO4A-HEADER:mode=after;position=作者;beginboundary=\.SH

source: PO4A-HEADER:mode=after;position=Copyright Big Dude, 2004;beginboundary=^
zh_hans: PO4A-HEADER:mode=after;position=版权所有 Big Dude，2004 年;beginboundary=^
zh_hant: PO4A-HEADER:mode=after;position=版權所有 Big Dude，2004 年;beginboundary=^

source: PO4A-HEADER:mode=after;position=About this document;beginboundary=FakePo4aBoundary
zh_hans: PO4A-HEADER:mode=after;position=关于本文档;beginboundary=FakePo4aBoundary
zh_hant: PO4A-HEADER:mode=after;position=關於本文件;beginboundary=FakePo4aBoundary

source: |=head1 NAME | |dummy - a dummy program | |=head1 AUTHOR | |me
zh_hans: |=head1 名称 | |dummy - 一个虚拟程序 | |=head1 作者 | |我
zh_hant: |=head1 名稱 | |dummy - 一個虛擬程式 | |=head1 作者 | |我

source: |PO4A-HEADER:mode=after;position=AUTEUR;beginboundary=^=head | |=head1 TRADUCTEUR | |moi |
zh_hans: |PO4A-HEADER:mode=after;position=作者;beginboundary=^=head | |=head1 翻译 | |我 |
zh_hant: |PO4A-HEADER:mode=after;position=作者;beginboundary=^=head | |=head1 翻譯 | |我 |

source: PO4A-HEADER:mode=after;position=NOM;beginboundary=^=head1
zh_hans: PO4A-HEADER:mode=after;position=名称;beginboundary=^=head1
zh_hant: PO4A-HEADER:mode=after;position=名稱;beginboundary=^=head1

source: FAQ
zh_hans: 常见问题解答
zh_hant: 常見問題解答

source: The parsers of each formats, in particular to see the options accepted by each of them: L<Locale::Po4a::AsciiDoc(3pm)> L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Yaml(3pm)>, L<Locale::Po4a::BibTeX(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xml(3pm)>.
zh_hans: 每种格式的解析器，特别是查看每种格式接受的选项：L<Locale::Po4a::AsciiDoc(3pm)> L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Yaml(3pm)>, L<Locale::Po4a::BibTeX(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xml(3pm)>.
zh_hant: 每種格式的解析器，特別是檢視每種格式接受的選項：L<Locale::Po4a::AsciiDoc(3pm)> L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Yaml(3pm)>, L<Locale::Po4a::BibTeX(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xml(3pm)>.

source: * a long sentence that is ending with a number 1. A second sentence.
zh_hans: * 以数字结尾的长句。1. 第二句。
zh_hant: * 以數字結尾的長句。1. 第二句。

source: * a long sentence that is ending with a number 1. A second sentence.
zh_hans: * 以数字结尾的长句 1. 第二句话。
zh_hant: * 以數字結尾的長句 1. 第二句話。

source: Copyright © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>. Copyright © 2012 Denis BARBIER <barbier@linuxfr.org>. Copyright © 2017 Martin Quinson <mquinson#debian.org>.
zh_hans: 版权所有 © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>. 版权所有 © 2012 Denis BARBIER <barbier@linuxfr.org>. 版权所有 © 2017 Martin Quinson <mquinson#debian.org>.
zh_hant: 版權所有 © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>. 版權所有 © 2012 Denis BARBIER <barbier@linuxfr.org>. 版權所有 © 2017 Martin Quinson <mquinson#debian.org>.

source: Copyright © 2006 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hans: 版权所有 © 2006 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hant: 版權所有 © 2006 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Copyright © 2002-2005, 2014, 2017 SPI, Inc.
zh_hans: 版权© 2002-2005，2014， 2017 SPI， Inc.
zh_hant: 版權© 2002-2005，2014， 2017 SPI， Inc.

source: Copyright © 2005 SPI, Inc.
zh_hans: 版权所有 © 2005 SPI, Inc.
zh_hant: 版權所有 © 2005 SPI, Inc.

source: You can get Dia (the graphical editor for these diagrams) from: http://www.gnome.org/projects/dia/
zh_hans: 您可以从以下位置获得 Dia (这些图表的图形编辑器)： http://www.gnome.org/projects/dia/
zh_hant: 您可以從以下位置獲得 Dia (這些圖表的圖形編輯器)： http://www.gnome.org/projects/dia/

source: Another way is to uncompress the dia files from command line with: gunzip < original.dia > uncompressed.dia
zh_hans: 另一种方法是使用以下命令行解压缩 dia 文件： gunzip < 原始.dia > 解压缩.dia
zh_hant: 另一種方法是使用以下命令列解壓縮 dia 檔案： gunzip < 原始.dia > 解壓縮.dia

source: Copyright © 2004 Jordi Vilalta <jvprat@gmail.com>
zh_hans: 版权所有 © 2004 Jordi Vilalta <jvprat@gmail.com>
zh_hant: 版權所有 © 2004 Jordi Vilalta <jvprat@gmail.com>

source: Copyright © 2004 Jordi Vilalta <jvprat@gmail.com> Copyright © 2007-2009 Nicolas François <nicolas.francois@centraliens.net>
zh_hans: 版权所有 © 2004 Jordi Vilalta <jvprat@gmail.com> 版权所有 © 2007-2009 Nicolas François <nicolas.francois@centraliens.net>
zh_hant: 版權所有 © 2004 Jordi Vilalta <jvprat@gmail.com> 版權所有 © 2007-2009 Nicolas François <nicolas.francois@centraliens.net>

source: Copyright © 2004-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hans: 版权所有 © 2004-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hant: 版權所有 © 2004-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Copyright © 2006 BitDefender
zh_hans: 版权所有 © 2006 BitDefender
zh_hant: 版權所有 © 2006 BitDefender

source: Copyright © 2002 SPI, Inc.
zh_hans: 版权所有 © 2002 SPI, Inc.
zh_hant: 版權所有 © 2002 SPI, Inc.

source: Copyright © 2004, 2005 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hans: 版权所有 © 2004, 2005 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hant: 版權所有 © 2004, 2005 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: RE<lt>textE<gt> -- roman text
zh_hans: RE<lt>textE<gt> -- 罗马文本
zh_hant: RE<lt>textE<gt> -- 羅馬文字

source: According to the groff_mdoc page, the NAME, SYNOPSIS and DESCRIPTION sections are mandatory. There are no known issues with translated SYNOPSIS or DESCRIPTION section, but you can also specify these sections this way: -o mdoc=NAME,SYNOPSIS,DESCRIPTION
zh_hans: 根据 groff_mdoc，名称，概要和描述 章节是必填项。 翻译的概要或描述部分没有已知问题， 但您也可以这样指定这些部分： -o mdoc=NAME,SYNOPSIS,DESCRIPTION
zh_hant: 根據 groff_mdoc，名稱，概要和描述 章節是必填項。 翻譯的概要或描述部分沒有已知問題， 但您也可以這樣指定這些部分： -o mdoc=NAME,SYNOPSIS,DESCRIPTION

source: This mdoc issue can also be solved with an addendum like this one: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"
zh_hans: 此 mdoc 问题也可以通过如下附录解决： PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "月日，年" 操作系统 "章节名"
zh_hant: 此 mdoc 問題也可以透過如下附錄解決： PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "月日，年" 作業系統 "章節名"

source: A new macro can also be defined to automate this: .de IR_untranslated . IR \\$@ ..
zh_hans: 还可以定义一个新的宏来自动执行： .de IR_untranslated . IR \\$@ ..
zh_hant: 還可以定義一個新的宏來自動執行： .de IR_untranslated . IR \\$@ ..

source: or using an alias: .als IR_untranslated IR
zh_hans: 或使用别名： .als IR_untranslated IR
zh_hant: 或使用別名： .als IR_untranslated IR

source: Copyright © 2002-2008 SPI, Inc.
zh_hans: 版权所有 © 2002-2008 SPI, Inc.
zh_hant: 版權所有 © 2002-2008 SPI, Inc.

source: # Read PO file $pofile->read('file.po');
zh_hans: # 读取 PO 文件 $pofile->read('file.po');
zh_hant: # 讀取 PO 檔案 $pofile->read('file.po');

source: # Add an entry $pofile->push('msgid' => 'Hello', 'msgstr' => 'bonjour', 'flags' => "wrap", 'reference'=>'file.c:46');
zh_hans: # 添加条目 $pofile->push('msgid' => 'Hello', 'msgstr' => '你好', 'flags' => "wrap", 'reference'=>'file.c:46');
zh_hant: # 新增條目 $pofile->push('msgid' => 'Hello', 'msgstr' => '你好', 'flags' => "wrap", 'reference'=>'file.c:46');

source: # Extract a translation $pofile->gettext("Hello"); # returns 'bonjour'
zh_hans: # 提取翻译 $pofile->gettext("Hello"); # 返回 'bonjour'
zh_hant: # 提取翻譯 $pofile->gettext("Hello"); # 返回 'bonjour'

source: # Write back to a file $pofile->write('otherfile.po');
zh_hans: # 写回文件 $pofile->write('otherfile.po');
zh_hant: # 寫回檔案 $pofile->write('otherfile.po');

source: [some use of the PO file to translate stuff]
zh_hans: [使用 PO 文件翻译内容]
zh_hant: [使用 PO 檔案翻譯內容]

source: # Read POD from STDIN and write to STDOUT. $parser->parse_from_filehandle;
zh_hans: # 从标准输入读取 POD 并写入标准输出。 $parser->parse_from_filehandle;
zh_hant: # 從標準輸入讀取 POD 並寫入標準輸出。 $parser->parse_from_filehandle;

source: # Read POD from file.pod and write to file.txt. $parser->parse_from_file ('file.pod', 'file.txt');
zh_hans: # 从 file.pod 读取 POD 并写入 file.txt。 $parser->parse_from_file ('file.pod', 'file.txt');
zh_hant: # 從 file.pod 讀取 POD 並寫入 file.txt。 $parser->parse_from_file ('file.pod', 'file.txt');

source: Copyright © 2016-2017 Francesco Poli <invernomuto@paranoici.org>
zh_hans: 版权所有©2016-2017 Francesco Poli<wintermuto@paranoic.org>
zh_hant: 版權所有©2016-2017 Francesco Poli<wintermuto@paranoic.org>

source: Copyright © 2004 MoonWolf <moonwolf@moonwolf.com> Copyright © 2011-2012 Youhei SASAKI <uwabami@gfd-dennou.org>
zh_hans: 版权所有©2004 Moonwolf <moonwolf@moonwolf.com> 版权所有©2011-2012 Youhei SASAKI <uwabami@gfd-dennou.org>
zh_hant: 版權所有©2004 Moonwolf <moonwolf@moonwolf.com> 版權所有©2011-2012 Youhei SASAKI <uwabami@gfd-dennou.org>

source: Copyright © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>
zh_hans: 版权所有 © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>
zh_hant: 版權所有 © 2005-2008 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>

source: This module uses B<onsgmls>(1) to parse the SGML files. Make sure it is installed. Also make sure that the DTD of the SGML files are installed in the system.
zh_hans: 本模块使用 B<onsgmls>(1) 解析 SGML 文件。确保它已安装。还要确保 SGML 文件的 DTD 已安装在系统中。
zh_hant: 本模組使用 B<onsgmls>(1) 解析 SGML 檔案。確保它已安裝。還要確保 SGML 檔案的 DTD 已安裝在系統中。

source: Copyright © 1995 David Megginson <dmeggins@aix1.uottawa.ca>
zh_hans: 版权所有 © 1995 David Megginson <dmeggins@aix1.uottawa.ca>
zh_hant: 版權所有 © 1995 David Megginson <dmeggins@aix1.uottawa.ca>

source: Copyright © 1995 David Megginson <dmeggins@aix1.uottawa.ca>. Copyright © 2002-2005 SPI, Inc.
zh_hans: 版权所有 © 1995 David Megginson <dmeggins@aix1.uottawa.ca>。 版权所有 © 2002-2005 SPI, Inc.
zh_hant: 版權所有 © 1995 David Megginson <dmeggins@aix1.uottawa.ca>。 版權所有 © 2002-2005 SPI, Inc.

source: There are some options (described in the next section) that can customize this behavior. If this doesn't fit to your document format you're encouraged to write your own derivative module from this, to describe your format's details. See the section B<WRITING DERIVATIVE MODULES> below, for the process description.
zh_hans: 有一些选项(将在下一节中介绍)可以自定义此行为。如果这不适合您的文档格式，我们鼓励您编写自己的派生模块，以描述您的格式的详细信息。有关流程描述，请参阅下面的 B<WRITING DERIVATIVE MODULES> 小节。
zh_hant: 有一些選項(將在下一節中介紹)可以自定義此行為。如果這不適合您的文件格式，我們鼓勵您編寫自己的派生模組，以描述您的格式的詳細資訊。有關流程描述，請參閱下面的 B<WRITING DERIVATIVE MODULES> 小節。

source: The I<parameters> argument is a set of [] (to indicate an optional argument) or {} (to indicate a mandatory argument). You can place an underscore (_) between these brackets to indicate that the parameter must be translated. For example: % po4a: command *chapter [_]{_}
zh_hans: 参数是一组 [] (表示可选的。 参数) 或 {} (指示强制参数)。 您可以在这些方括号之间加一个下划线 (_) 来表示。 必须翻译该参数。例如： % po4a: command *chapter [_]{_}
zh_hant: 引數是一組 [] (表示可選的。 引數) 或 {} (指示強制引數)。 您可以在這些方括號之間加一個下劃線 (_) 來表示。 必須翻譯該引數。例如： % po4a: command *chapter [_]{_}

source: This indicates that the chapter command has two parameters: an optional (short title) and a mandatory one, which must both be translated. If you want to specify that the href command has two mandatory parameters, that you don't want to translate the URL (first parameter), and that you don't want this command to be separated from its paragraph (which allow the translator to move the link in the sentence), you can use: % po4a: command -href {}{_}
zh_hans: 这表明章节命令有两个参数：可选的。 (简称) 和强制性的，都必须翻译。 如果要指定 href 命令有两个必需参数， 您不想转换 URL (第一个参数)，并且您。 我不希望此命令与其段落 (允许。 翻译器移动句子中的链接)，您可以使用： % po4a: command -href {}{_}
zh_hant: 這表明章節命令有兩個引數：可選的。 (簡稱) 和強制性的，都必須翻譯。 如果要指定 href 命令有兩個必需引數， 您不想轉換 URL (第一個引數)，並且您。 我不希望此命令與其段落 (允許。 翻譯器移動句子中的連結)，您可以使用： % po4a: command -href {}{_}

source: This defines the parameters accepted by the I<env> environment and specifies the ones to be translated. This information is later used to check the number of arguments of the \begin command. The syntax of the I<parameters> argument is the same as described for the others commands. The first parameter of the \begin command is the name of the environment. This parameter must not be specified in the list of parameters. Here are some examples: % po4a: environment multicols {} % po4a: environment equation
zh_hans: 这允许定义 I<env> 环境接受的参数。 此信息稍后将用于检查。 \begin 命令，并允许指定必须翻译哪一个。 I<Parameters> 参数的语法与。 其他命令。 \begin 命令的第一个参数是环境的名称。 不能在参数列表中指定此参数。以下是。 下面是一些示例： % po4a: 环境多层 {} % po4a: 环境方程
zh_hant: 這允許定義 I<env> 環境接受的引數。 此資訊稍後將用於檢查。 \begin 命令，並允許指定必須翻譯哪一個。 I<Parameters> 引數的語法與。 其他命令。 \begin 命令的第一個引數是環境的名稱。 不能在引數列表中指定此引數。以下是。 下面是一些示例： % po4a: 環境多層 {} % po4a: 環境方程

source: generic_command uses the information specified by register_generic_command or by adding definition to the TeX file: % po4a: command I<command1> I<parameters>
zh_hans: generic_command 使用由指定的信息。 register_generic_command 或通过将定义添加到 TeX 文件： % po4a: command I<command1> I<parameters>
zh_hant: generic_command 使用由指定的資訊。 register_generic_command 或透過將定義新增到 TeX 檔案： % po4a: command I<command1> I<parameters>

source: generic_environment uses the information specified by register_generic_environment or by adding definition to the TeX file: % po4a: environment I<env> I<parameters>
zh_hans: generic_environment 使用 register_generic_environment 或通过向 TeX 文件添加定义： % po4a: environment I<env> I<parameters>
zh_hant: generic_environment 使用 register_generic_environment 或透過向 TeX 檔案新增定義： % po4a: environment I<env> I<parameters>

source: Copyright © 2004-2007 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hans: 版权所有 © 2004-2007 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
zh_hant: 版權所有 © 2004-2007 Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Input document --\ /---> Output document \ / (translated) +-> parse() function -----+ / \ Input PO --------/ \---> Output PO (extracted)
zh_hans: 输入文档 --\ /---> 输出文档 \ / (已翻译) +-> 解析() 函数 -----+ / \ 输入 PO --------/ \---> 输出 PO (已提取)
zh_hant: 輸入文件 --\ /---> 輸出文件 \ / (已翻譯) +-> 解析() 函式 -----+ / \ 輸入 PO --------/ \---> 輸出 PO (已提取)

source: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # Not the first time we see <p>. # Reput the current line in input, # and put the built paragraph to output $self->unshiftline($line,$lref);
zh_hans: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # 这不是我们第一次看到<p>。 # 将当前行重新放入输入， # 并将构建的段落输出 $self->unshiftline($line,$lref);
zh_hant: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # 這不是我們第一次看到<p>。 # 將當前行重新放入輸入， # 並將構建的段落輸出 $self->unshiftline($line,$lref);

source: # Now that the document is formed, translate it: # - Remove the leading tag $paragraph =~ s/^<p>//s;
zh_hans: # 现在文档已形成，请翻译它： # - 删除前导标记 $paragraph =~ s/^<p>//s;
zh_hant: # 現在文件已形成，請翻譯它： # - 刪除前導標記 $paragraph =~ s/^<p>//s;

source: # - push to output the leading tag (untranslated) and the # rest of the paragraph (translated) $self->pushline( "<p>" . $self->translate($paragraph,$pararef) );
zh_hans: # - 按键输出前导标签(未翻译)和 # 段落的其余部分(已翻译) $self->pushline( "<p>" . $self->translate($paragraph,$pararef) );
zh_hant: # - 按鍵輸出前導標籤(未翻譯)和 # 段落的其餘部分(已翻譯) $self->pushline( "<p>" . $self->translate($paragraph,$pararef) );

source: next PARAGRAPH; } else { # Append to the paragraph $paragraph .= $line; $pararef = $lref unless(length($pararef)); }
zh_hans: next PARAGRAPH; } else { # 追加到段落后面 $paragraph .= $line; $pararef = $lref unless(length($pararef)); }
zh_hant: next PARAGRAPH; } else { # 追加到段落後面 $paragraph .= $line; $pararef = $lref unless(length($pararef)); }

source: # Reinit the loop ($line,$lref)=$self->shiftline(); } # Did not get a defined line? End of input file. return; } }
zh_hans: # 重新初始化循环 ($line,$lref)=$self->shiftline(); } # 没有得到定义的行吗？输入文件的结尾。 return; } }
zh_hant: # 重新初始化迴圈 ($line,$lref)=$self->shiftline(); } # 沒有得到定義的行嗎？輸入檔案的結尾。 return; } }

source: Add another input document data at the end of the existing array C<< @{$self->{TT}{doc_in}} >>. The argument is the filename to read. If a second argument is provided, it is the filename to use in the references.
zh_hant: 在現有陣列 C<< @{$self->{TT}{doc_in}} >> 的末尾新增另一個輸入文件資料。引數是要讀取的檔名。如果提供了第二個引數，則它是在引用中使用的檔名。

source: This array C<< @{$self->{TT}{doc_in}} >> holds this input document data as an array of strings with alternating meanings. * The string C<$textline> holding each line of the input text data. * The string C<< $filename:$linenum >> holding its location and called as "reference" (C<linenum> starts with 1).
zh_hans: 此数组 C<< @{$self->{TT}{doc_in}} >> 将此输入文档数据保存为。 具有交替含义的字符串数组。 *字符串 C<$textline> 保存输入文本数据的每一行。 *字符串 C<< $filename:$linenum >> 保存其位置并调用为。 "reference" (C<linenum> 从 1 开始)。
zh_hant: 此陣列 C<< @{$self->{TT}{doc_in}} >> 將此輸入文件資料儲存為。 具有交替含義的字串陣列。 *字串 C<$textline> 儲存輸入文字資料的每一行。 *字串 C<< $filename:$linenum >> 儲存其位置並呼叫為。 "reference" (C<linenum> 從 1 開始)。

source: This translated document data are provided by: * C<< $self->docheader() >> holding the header text for the plugin, and * C<< @{$self->{TT}{doc_out}} >> holding each line of the main translated text in the array.
zh_hans: 此翻译文档数据由以下人员提供： * C<< $self->docheader() >> 保存插件的标题文本，以及。 * C<< @{$self->{TT}{doc_out}} >> 保存数组中主翻译文本的每一行。
zh_hant: 此翻譯文件資料由以下人員提供： * C<< $self->docheader() >> 儲存外掛的標題文字，以及。 * C<< @{$self->{TT}{doc_out}} >> 儲存陣列中主翻譯文字的每一行。

source: [normal use of the po4a document...]
zh_hans: [正常使用 po4a 文档...]
zh_hant: [正常使用 po4a 文件...]

source: ($percent,$hit,$queries) = $document->stats(); print "We found translations for $percent\% ($hit from $queries) of strings.\n";
zh_hans: ($percent,$hit,$queries) = $document->stats(); print "我们找到了 $percent\% ($hit from $queries) 字符串的翻译\n";
zh_hant: ($percent,$hit,$queries) = $document->stats(); print "我們找到了 $percent\% ($hit from $queries) 字串的翻譯\n";
