Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: You should use the B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated>, and B<_default_attributes> options in derivative modules. This allow users to override the default behavior defined in your module with command line options.
sv: Du bör använda flaggorna B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated> och B<_default_attributes> i derivatmoduler. Detta gör det möjligt för användare att åsidosätta standardbeteendet som definieras i din modul med kommandoradsflaggor.
zh_hans: 您应该在衍生模块中使用 B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated>, 和 B<_default_attributes> 选项。这允许用户使用命令行选项覆盖模块中定义的默认行为。
zh_hant: 您應該在衍生模組中使用 B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated>, 和 B<_default_attributes> 選項。這允許使用者使用命令列選項覆蓋模組中定義的預設行為。

source: If you don't like the default behavior of this xml module and its derivative modules, you can provide command line options to change their behavior.
sv: Om du inte gillar standardbeteendet för denna xml-modul och dess derivatmoduler kan du ange kommandoradsflaggor för att ändra deras beteende.
zh_hans: 如果您不喜欢这个 xml 模块及其派生模块的默认行为，则可以提供命令行选项来更改它们的行为。
zh_hant: 如果您不喜歡這個 xml 模組及其派生模組的預設行為，則可以提供命令列選項來更改它們的行為。

source: See L<Locale::Po4a::Docbook(3pm)|Locale::Po4a::Docbook>,
sv: Se L<Locale::Po4a::Docbook(3pm)|Locale::Po4a::Docbook>,
zh_hans: 请参阅 L<Locale::Po4a::Docbook(3pm)|Locale::Po4a::Docbook>,
zh_hant: 請參閱 L<Locale::Po4a::Docbook(3pm)|Locale::Po4a::Docbook>,

source: OVERRIDING THE found_string FUNCTION
sv: ÖVERSKRIVNING AV FUNKTIONEN found_string
zh_hans: 覆盖 found_string 功能
zh_hant: 覆蓋 found_string 功能

source: Another simple step is to override the function "found_string", which receives the extracted strings from the parser, in order to translate them. There you can control which strings you want to translate, and perform transformations to them before or after the translation itself.
sv: Ett annat enkelt steg är att överskriva funktionen "found_string", som tar emot de extraherade strängarna från parsern, för att översätta dem. Där kan du styra vilka strängar du vill översätta och utföra transformationer på dem före eller efter själva översättningen.
zh_hans: 另一个简单的步骤是重写函数 "found_string"，该函数接收从解析器中提取的字符串，以便转换它们。 您可以控制要翻译的字符串，并在转换本身之前或之后执行转换。
zh_hant: 另一個簡單的步驟是重寫函式 "found_string"，該函式接收從解析器中提取的字元串，以便轉換它們。 您可以控制要翻譯的字串，並在轉換本身之前或之後執行轉換。

source: It receives the extracted text, the reference on where it was, and a hash that contains extra information to control what strings to translate, how to translate them and to generate the comment.
sv: Den tar emot den extraherade texten, referensen till var den fanns och en hash som innehåller extra information för att styra vilka strängar som ska översättas, hur de ska översättas och för att generera kommentaren.
zh_hans: 它接收提取的文本、关于它所在位置的引用以及包含额外信息的散列，以控制要翻译哪些字符串、如何翻译它们以及生成注释。
zh_hant: 它接收提取的文字、關於它所在位置的引用以及包含額外資訊的雜湊，以控制要翻譯哪些字串、如何翻譯它們以及生成註釋。

source: The content of these options depends on the kind of string it is (specified in an entry of this hash):
sv: Innehållet i dessa flaggor beror på vilken typ av sträng det är (specificerad i en post i denna hash):
zh_hans: 这些选项的内容取决于字符串的类型 (在此散列的条目中指定)：
zh_hant: 這些選項的內容取決於字串的型別 (在此雜湊的條目中指定)：

source: The found string is the content of a translatable tag. The entry "tag_options" contains the option characters in front of the tag hierarchy in the module "tags" option.
sv: Den hittade strängen är innehållet i en översättningsbar tagg. Posten "tag_options" innehåller flaggtecknen framför tagghierarkin i modulens "tags"-flagga.
zh_hans: 找到的字符串是可翻译标签的内容。条目 "tag_options" 包含模块 "tags" 选项中标记层次结构前面的选项字符。
zh_hant: 找到的字串是可翻譯標籤的內容。條目 "tag_options" 包含模組 "tags" 選項中標記層次結構前面的選項字元。

source: type="attribute"
sv: type="attribut"

source: Means that the found string is the value of a translatable attribute. The entry "attribute" has the name of the attribute.
sv: Betyder att den hittade strängen är värdet för ett översättningsbart attribut. Posten "attribut" har namnet på attributet.
zh_hans: 表示找到的字符串是可翻译属性的值。条目 "attribute" 具有该属性的名称。
zh_hant: 表示找到的字串是可翻譯屬性的值。條目 "attribute" 具有該屬性的名稱。

source: It must return the text that will replace the original in the translated document. Here's a basic example of this function:
sv: Den måste returnera den text som ska ersätta originalet i det översatta dokumentet. Här är ett grundläggande exempel på denna funktion:
zh_hans: 它必须返回将替换翻译文档中原始文本的文本。下面是这个函数的一个基本示例：
zh_hant: 它必須返回將替換翻譯文件中原始文字的文字。下面是這個函式的一個基本示例：

source: There's another simple example in the new Dia module, which only filters some strings.
sv: Det finns ett annat enkelt exempel i det nya Dia-modulet, som endast filtrerar vissa strängar.
zh_hans: 在新的 Dia 模块中还有另一个简单的示例，它只过滤一些字符串。
zh_hant: 在新的 Dia 模組中還有另一個簡單的示例，它只過濾一些字串。

source: MODIFYING TAG TYPES (TODO)
sv: ÄNDRA TAGGTYPER (TODO)
zh_hans: 修改标记类型 (TODO)
zh_hant: 修改標記型別 (TODO)

source: This is a more complex one, but it enables a (almost) total customization. It's based on a list of hashes, each one defining a tag type's behavior. The list should be sorted so that the most general tags are after the most concrete ones (sorted first by the beginning and then by the end keys). To define a tag type you'll have to make a hash with the following keys:
sv: Detta är mer komplicerat, men möjliggör en (nästan) total anpassning. Det baseras på en lista med hashvärden, där varje värde definierar en taggtyps beteende. Listan bör sorteras så att de mest allmänna taggarna kommer efter de mest konkreta (sorterade först efter början och sedan efter slutet på nycklarna). För att definiera en taggtyp måste du skapa en hash med följande nycklar:
zh_hans: 这是一个更复杂的方法，但它支持(几乎)完全自定义。它基于散列列表，每个散列定义一种标记类型的行为。应该对列表进行排序，以便最通用的标记位于最具体的标记之后(首先按开始排序，然后按结束键排序)。要定义标记类型，您必须使用以下键进行散列：
zh_hant: 這是一個更復雜的方法，但它支援(幾乎)完全自定義。它基於雜湊列表，每個雜湊定義一種標記型別的行為。應該對列表進行排序，以便最通用的標記位於最具體的標記之後(首先按開始排序，然後按結束鍵排序)。要定義標記型別，您必須使用以下鍵進行散列：

source: Specifies the beginning of the tag, after the "E<lt>".
sv: Anger början på taggen, efter "E<lt>".
zh_hans: 在 "E<lt>" 之后指定标记的开始。
zh_hant: 在 "E<lt>" 之後指定標記的開始。

source: Specifies the end of the tag, before the "E<gt>".
sv: Anger slutet på taggen, före "E<gt>".
zh_hans: 在 "E<gt>" 之前指定标记的末尾。
zh_hant: 在 "E<gt>" 之前指定標記的末尾。

source: It says if this is a breaking tag class. A non-breaking (inline) tag is one that can be taken as part of the content of another tag. It can take the values false (0), true (1) or undefined. If you leave this undefined, you'll have to define the f_breaking function that will say whether a concrete tag of this class is a breaking tag or not.
sv: Det anger om detta är en brytande taggklass. En icke-brytande (inline) tagg är en tagg som kan betraktas som en del av innehållet i en annan tagg. Den kan ha värdena false (0), true (1) eller undefined. Om du lämnar detta odefinierat måste du definiera funktionen f_breaking som anger om en konkret tagg av denna klass är en brytande tagg eller inte.
zh_hans: 它会显示这是否是中断标记类。非中断(内联)标签是可以作为另一个标签内容的一部分的标签。它可以采用值 false (0)、true (1) 或 undefined。如果未定义此标记，则必须定义 f_breaking 函数，该函数将说明该类的具体标记是否为中断标记。
zh_hant: 它會顯示這是否是中斷標記類。非中斷(內聯)標籤是可以作為另一個標籤內容的一部分的標籤。它可以採用值 false (0)、true (1) 或 undefined。如果未定義此標記，則必須定義 f_breaking 函式，該函式將說明該類的具體標記是否為中斷標記。

source: It's a function that will tell if the next tag is a breaking one or not. It should be defined if the B<breaking> option is not.
sv: Det är en funktion som avgör om nästa tagg är en brytande tagg eller inte. Den bör definieras om flaggan B-<breaking> inte är det.
zh_hans: 它是一个函数，它将判断下一个标记是否是中断标记。如果 B<breaking> 选项不是，则应该定义它。
zh_hant: 它是一個函式，它將判斷下一個標記是否是中斷標記。如果 B<breaking> 選項不是，則應該定義它。

source: If you leave this key undefined, the generic extraction function will have to extract the tag itself. It's useful for tags that can have other tags or special structures in them, so that the main parser doesn't get mad. This function receives a boolean that says if the tag should be removed from the input stream or not.
sv: Om du lämnar denna nyckel odefinierad måste den generiska extraktionsfunktionen extrahera taggen själv. Det är användbart för taggar som kan innehålla andra taggar eller specialstrukturer, så att huvudparsern inte blir galen. Denna funktion tar emot ett booleskt värde som anger om taggen ska tas bort från inmatningsströmmen eller inte.
zh_hans: 如果您将此键未定义，泛型提取函数将必须提取标记本身。对于那些可以在它们中拥有其他标记或特殊结构的标签来说，它很有用，所以主解析器不会错乱。此函数接收一个布尔值，该布尔值表示如果标记应该从输入流中删除，或者不应该删除。
zh_hant: 如果您將此鍵未定義，泛型提取函式將必須提取標記本身。對於那些可以在它們中擁有其他標記或特殊結構的標籤來說，它很有用，所以主解析器不會錯亂。此函式接收一個布林值，該布林值表示如果標記應該從輸入流中刪除，或者不應該刪除。

source: This function receives the tag (in the get_string_until() format) and returns the translated tag (translated attributes or all needed transformations) as a single string.
sv: Denna funktion tar emot taggen (i formatet get_string_until()) och returnerar den översatta taggen (översatta attribut eller alla nödvändiga omvandlingar) som en enda sträng.
zh_hans: 此函数接收标记 (get_string_until() 格式)，并将转换后的标记 (转换后的属性或所有需要的转换) 作为单个字符串返回。
zh_hant: 此函式接收標記 (get_string_until() 格式)，並將轉換後的標記 (轉換後的屬性或所有需要的轉換) 作為單個字串返回。

source: WORKING WITH TAGS
sv: ARBETA MED TAGGAR
zh_hans: 使用标记
zh_hant: 使用標記

source: This function returns the path to the current tag from the document's root, in the form E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.
sv: Denna funktion returnerar sökvägen till den aktuella taggen från dokumentets rot, i form av E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.
zh_hans: 此函数返回从文档根到当前标记的路径，格式为 E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.
zh_hant: 此函式返回從文件根到當前標記的路徑，格式為 E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.

source: An additional array of tags (without brackets) can be passed as argument. These path elements are added to the end of the current path.
sv: En ytterligare uppsättning taggar (utan parenteser) kan anges som argument. Dessa sökvägsdelar läggs till i slutet av den aktuella sökvägen.
zh_hans: 可以作为参数传递额外的标记数组（不带括号）。 这些路径元素将添加到当前路径的末尾。
zh_hant: 可以作為引數傳遞額外的標記陣列（不帶括號）。 這些路徑元素將新增到當前路徑的末尾。

source: This function returns the index from the tag_types list that fits to the next tag in the input stream, or -1 if it's at the end of the input file.
sv: Denna funktion returnerar indexet från listan tag_types som passar till nästa tagg i inmatningsströmmen, eller -1 om den är i slutet av inmatningsfilen.
zh_hans: 此函数返回 tag_types 列表中适合输入流中下一个标记的索引，如果它位于输入文件的末尾，则返回 -1。
zh_hant: 此函式返回 tag_types 列表中適合輸入流中下一個標記的索引，如果它位於輸入檔案的末尾，則返回 -1。

source: Here, the tag has structure started by E<lt> and end by E<gt> and it can contain multiple lines.
sv: Här har taggen en struktur som börjar med E<lt> och slutar med E<gt> och den kan innehålla flera rader.
zh_hans: 这里，标记的结构以 E<lt> 开头，以 E<gt> 结尾，并且可以包含多行。
zh_hant: 這裡，標記的結構以 E<lt> 開頭，以 E<gt> 結尾，並且可以包含多行。

source: This works on the array C<< @{$self->{TT}{doc_in}} >> holding input document data and reference indirectly via C<< $self->shiftline() >> and C<< $self->unshiftline($$) >>.
sv: Detta fungerar på arrayen C<< @{$self->{TT}{doc_in}} >> som innehåller indata från dokumentet och refererar indirekt via C<< $self->shiftline() >> och C<< $self->unshiftline($$) >>.
zh_hans: 这适用于通过 C<< $self->shiftline() >> 和 C<< $self->unshiftline($$) >> 间接保存输入文档数据和引用的数组 C<< @{$self->{TT}{doc_in}} >>。
zh_hant: 這適用於透過 C<< $self->shiftline() >> 和 C<< $self->unshiftline($$) >> 間接儲存輸入文件資料和引用的陣列 C<< @{$self->{TT}{doc_in}} >>。

source: This function returns the next tag from the input stream without the beginning and end, in an array form, to maintain the references from the input file. It has two parameters: the type of the tag (as returned by tag_type) and a boolean, that indicates if it should be removed from the input stream.
sv: Denna funktion returnerar nästa tagg från inmatningsströmmen utan början och slut, i form av en matris, för att behålla referenserna från inmatningsfilen. Den har två parametrar: taggtypen (som returneras av tag_type) och en boolesk variabel som anger om den ska tas bort från inmatningsströmmen.
zh_hans: 此函数返回输入流的下一个标记，而不以数组形式结束，以维护来自输入文件的引用。 它有两个参数：标记的类型（由 tag_type 返回）和布尔，指示是否应该从输入流中删除标记类型。
zh_hant: 此函式返回輸入流的下一個標記，而不以陣列形式結束，以維護來自輸入檔案的引用。 它有兩個引數：標記的型別（由 tag_type 返回）和布林，指示是否應該從輸入流中刪除標記型別。

source: This function returns the name of the tag passed as an argument, in the array form returned by extract_tag.
sv: Denna funktion returnerar namnet på taggen som skickats som argument, i den arrayform som returneras av extract_tag.
zh_hans: 此函数以 extract_tag 返回的数组形式返回作为参数传递的标记名。
zh_hant: 此函式以 extract_tag 返回的陣列形式返回作為引數傳遞的標記名。

source: This function returns a boolean that says if the next tag in the input stream is a breaking tag or not (inline tag). It leaves the input stream intact.
sv: Denna funktion returnerar ett booleskt värde som anger om nästa tagg i inmatningsströmmen är en brytande tagg eller inte (inline-tagg). Den lämnar inmatningsströmmen intakt.
zh_hans: 此函数返回一个布尔值，该布尔值表示输入流中的下一个标记是否为中断标记（内联标记）。 它保持输入流不变。
zh_hant: 此函式返回一個布林值，該布林值表示輸入流中的下一個標記是否為中斷標記（內聯標記）。 它保持輸入流不變。

source: This function translates the next tag from the input stream. Using each tag type's custom translation functions.
sv: Denna funktion översätter nästa tagg från inmatningsströmmen. Använder varje taggtyps anpassade översättningsfunktioner.
zh_hans: 此函数用于转换输入流中的下一个标记。使用每种标签类型的自定义翻译功能。
zh_hant: 此函式用於轉換輸入流中的下一個標記。使用每種標籤型別的自定義翻譯功能。

source: This function returns a string value that says if the first argument (a tag hierarchy) matches any of the tags from the second argument (a list of tags or tag hierarchies). If it doesn't match, it returns 0. Else, it returns the matched tag's options (the characters in front of the tag) or 1 (if that tag doesn't have options).
sv: Denna funktion returnerar ett strängvärde som anger om det första argumentet (en tagghierarki) matchar någon av taggarna från det andra argumentet (en lista med taggar eller tagghierarkier). Om det inte matchar returneras 0. Annars returneras den matchade taggens flaggor (tecknen framför taggen) eller 1 (om den taggen inte har några flaggor).
zh_hans: 此函数返回一个字符串值，表示第一个参数 (标记层次结构) 是否与第二个参数 (标记列表或标记层次结构) 中的任何标记匹配。如果不匹配，则返回 0。否则，它返回匹配标记的选项(标记前面的字符)或 1 (如果该标记没有选项)。
zh_hant: 此函式返回一個字串值，表示第一個引數 (標記層次結構) 是否與第二個引數 (標記列表或標記層次結構) 中的任何標記匹配。如果不匹配，則返回 0。否則，它返回匹配標記的選項(標記前面的字元)或 1 (如果該標記沒有選項)。

source: WORKING WITH ATTRIBUTES
sv: ARBETA MED ATTRIBUT
zh_hans: 使用属性
zh_hant: 使用屬性

source: This function handles the translation of the tags' attributes. It receives the tag without the beginning / end marks, and then it finds the attributes, and it translates the translatable ones (specified by the module option B<attributes>). This returns a plain string with the translated tag.
sv: Denna funktion hanterar översättningen av taggarnas attribut. Den tar emot taggen utan början/slutmarkeringar, hittar attributen och översätter de som kan översättas (specificerade av moduloptionen B<attributes>). Detta returnerar en vanlig sträng med den översatta taggen.
zh_hans: 此函数处理标记属性的转换。它接收没有开始/结束标记的标记，然后找到属性，并翻译可翻译的属性(由模块选项 B<attributes> 指定)。这将返回一个带有翻译后的标记的纯字符串。
zh_hant: 此函式處理標記屬性的轉換。它接收沒有開始/結束標記的標記，然後找到屬性，並翻譯可翻譯的屬性(由模組選項 B<attributes> 指定)。這將返回一個帶有翻譯後的標記的純字串。

source: WORKING WITH TAGGED CONTENTS
sv: ARBETA MED TAGGADE INNEHÅLL
zh_hans: 使用已标记的内容
zh_hant: 使用已標記的內容

source: This function gets the text until the next breaking tag (not inline) from the input stream. Translate it using each tag type's custom translation functions.
sv: Denna funktion hämtar texten fram till nästa brytningstagg (inte inline) från inmatningsströmmen. Översätt den med hjälp av varje taggtyps anpassade översättningsfunktioner.
zh_hans: 此函数从输入流获取文本，直到下一个换行标记(不是内联)。使用每种标记类型的自定义翻译功能对其进行翻译。
zh_hant: 此函式從輸入流獲取文字，直到下一個換行標記(不是內聯)。使用每種標記型別的自定義翻譯功能對其進行翻譯。

source: WORKING WITH THE MODULE OPTIONS
sv: ARBETA MED MODULFLAGGORNA
zh_hans: 使用模块选项
zh_hant: 使用模組選項

source: This function fills the internal structures that contain the tags, attributes and inline data with the options of the module (specified in the command-line or in the initialize function).
sv: Denna funktion fyller de interna strukturerna som innehåller taggar, attribut och inline-data med modulens flaggor (specificerade i kommandoraden eller i initialiseringsfunktionen).
zh_hans: 此函数使用模块的选项 (在命令行或 initialize 函数中指定) 填充包含标记、属性和内联数据的内部结构。
zh_hant: 此函式使用模組的選項 (在命令列或 initialize 函式中指定) 填充包含標記、屬性和內聯資料的內部結構。

source: GETTING TEXT FROM THE INPUT DOCUMENT
sv: HÄMTA TEXT FRÅN INMATNINGSDOKUMENTET
zh_hans: 从输入文档获取文本
zh_hant: 從輸入文件獲取文字

source: This function returns an array with the lines (and references) from the input document until it finds the first argument. The second argument is an options hash. Value 0 means disabled (the default) and 1, enabled.
sv: Denna funktion returnerar en array med raderna (och referenserna) från indokumentet tills den hittar det första argumentet. Det andra argumentet är en optionshash. Värdet 0 betyder inaktiverat (standard) och 1 betyder aktiverat.
zh_hans: 此函数返回一个数组，该数组包含输入文档中的行（和引用），直到它找到第一个参数。 第二个参数是选项哈希。值 0 表示已禁用（默认值）和启用 1。
zh_hant: 此函式返回一個數組，該陣列包含輸入文件中的行（和引用），直到它找到第一個參數。 第二個引數是選項雜湊。值 0 表示已禁用（預設值）和啟用 1。

source: The valid options are:
sv: De giltiga flaggorna är:
zh_hans: 有效选项包括：
zh_hant: 有效選項包括：

source: This makes the returned array to contain the searched text
sv: Detta gör att den returnerade matrisen innehåller den sökta texten
zh_hans: 这使得返回的数组包含搜索的文本
zh_hant: 這使得返回的陣列包含搜尋的文字

source: This removes the returned stream from the input
sv: Detta tar bort den returnerade strömmen från ingången
zh_hans: 这将从输入中删除返回的流
zh_hant: 這將從輸入中刪除返回的流

source: This ensures that the searched text is outside any quotes
sv: Detta säkerställer att den sökta texten inte finns inom några citattecken
zh_hans: 这样可以确保搜索的文本位于任何引号之外
zh_hant: 這樣可以確保搜尋的文字位於任何引號之外

source: This denotes that the first argument is a regular expression rather than an plain string
sv: Detta betyder att det första argumentet är ett reguljärt uttryck snarare än en vanlig sträng
zh_hans: 这表示第一个参数是正则表达式，而不是普通字符串
zh_hant: 這表示第一個引數是正則表示式，而不是普通字串

source: This function receives as argument the reference to a paragraph (in the format returned by get_string_until), skips his heading spaces and returns them as a simple string.
sv: Denna funktion tar emot referensen till ett stycke (i det format som returneras av get_string_until) som argument, hoppar över rubrikens blanksteg och returnerar dem som en enkel sträng.
zh_hans: 此函数接收对段落的引用作为参数(格式由 get_string_until 返回)，跳过其标题空格并将其作为简单字符串返回。
zh_hant: 此函式接收對段落的引用作為引數(格式由 get_string_until 返回)，跳過其標題空格並將其作為簡單字串返回。

source: This function returns a simple string with the text from the argument array (discarding the references).
sv: Denna funktion returnerar en enkel sträng med texten från argumentmatrisen (referenserna kasseras).
zh_hans: 此函数返回一个包含参数数组中文本的简单字符串（丢弃引用）。
zh_hant: 此函式返回一個包含引數陣列中文字的簡單字串（丟棄引用）。

source: This module can translate tags and attributes.
sv: Denna modul kan översätta taggar och attribut.
zh_hans: 此模块可以翻译标记和属性。
zh_hant: 此模組可以翻譯標記和屬性。

source: DOCTYPE (ENTITIES)
sv: DOCTYPE (ENTITETER)

source: There is a minimal support for the translation of entities. They are translated as a whole, and tags are not taken into account. Multilines entities are not supported and entities are always rewrapped during the translation.
sv: Det finns ett minimalt stöd för översättning av enheter. De översätts som en helhet och taggar beaktas inte. Enheter med flera rader stöds inte och enheter omformateras alltid under översättningen.
zh_hans: 对实体转换的支持最低。它们是作为整体翻译的，不考虑标签。不支持多行图元，并且在转换过程中始终重包裹图元。
zh_hant: 對實體轉換的支援最低。它們是作為整體翻譯的，不考慮標籤。不支援多行圖元，並且在轉換過程中始終重包裹圖元。

source: MODIFY TAG TYPES FROM INHERITED MODULES (move the tag_types structure inside the $self hash?)
sv: ÄNDRA TAGGTYPER FRÅN ARVADE MODULER (flytta tag_types-strukturen inuti $self-hash?)
zh_hans: 修改继承模块中的标记类型（在 tag_types 中移动 $self 结构？)
zh_hant: 修改繼承模組中的標記型別（在 tag_types 中移動 $self 結構？)

source: Locale::Po4a::Yaml - convert YAML files from/to PO files
sv: Locale::Po4a::Yaml – konvertera YAML-filer från/till PO-filer
zh_hans: Locale::Po4a::Yaml - 将 YAML 文件从/转换为 PO 文件
zh_hant: Locale::Po4a::Yaml - 將 YAML 檔案從/轉換為 PO 檔案

source: Locale::Po4a::Yaml is a module to help the translation of Yaml files into other [human] languages.
sv: Locale::Po4a::Yaml är ett modul som hjälper till att översätta Yaml-filer till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Yaml 是一个帮助将 Yaml 文件翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Yaml 是一個幫助將 Yaml 檔案翻譯成其他 [人類] 語言的模組。

source: The module extracts the value of YAML hashes and arrays. Hash keys are not extracted.
sv: Modulen extraherar värdet av YAML-hashar och -matriser. Hashnycklar extraheras inte.
zh_hans: 该模块提取 YAML 散列和数组的值。不提取散列键。
zh_hant: 該模組提取 YAML 雜湊和陣列的值。不提取雜湊鍵。

source: NOTE: This module parses the YAML file with YAML::Tiny.
sv: OBS: Denna modul analyserar YAML-filen med YAML::Tiny.
zh_hans: 注意：此模块使用 YAML::Tiny 解析 YAML 文件。
zh_hant: 注意：此模組使用 YAML::Tiny 解析 YAML 檔案。

source: Space-separated list of hash keys to process for extraction, all other keys are skipped. Keys are matched with a case-sensitive match. If B<paths> and B<keys> are used together, values are included if they are matched by at least one of the options. Arrays values are always returned unless the B<skip_array> option is provided.
sv: Mellanslagsavgränsad lista över hashnycklar som ska bearbetas för extrahering, alla andra nycklar hoppas över. Nycklar matchas med skiftlägeskänslig matchning. Om B<paths> och B<keys> används tillsammans inkluderas värden om de matchas av minst en av flaggorna. Arrayvärden returneras alltid om inte flaggan B<skip_array> anges.

source: Comma-separated list of hash paths to process for extraction, all other paths are skipped. Paths are matched with a case-sensitive match. If B<paths> and B<keys> are used together, values are included if they are matched by at least one of the options. Arrays values are always returned unless the B<skip_array> option is provided.
sv: Kommaseparerad lista över hashvägar som ska bearbetas för extrahering, alla andra vägar hoppas över. Vägar matchas med en skiftlägeskänslig matchning. Om B<paths> och B<keys> används tillsammans inkluderas värden om de matchas av minst en av flaggorna. Arrayvärden returneras alltid om inte flaggan B<skip_array> anges.

source: Do not translate array values.
sv: Översätt inte arrayvärden.
zh_hans: 不转换数组值。
zh_hant: 不轉換陣列值。

source: SYNOPSIS
zh_hans: 简介
zh_hant: 簡介

source: The PO files are always re-generated based on the POT with B<msgmerge -U>.
zh_hans: PO 文件总是基于带有 B<msgmerge-U> 的 POT 重新生成。
zh_hant: PO 檔案總是基於帶有 B<msgmerge-U> 的 POT 重新生成。

source: Extra options for B<msgmerge>(1).
zh_hans: B<msgmerge>(1) 的其他选项。
zh_hant: B<msgmerge>(1) 的其他選項。

source: This option removes B<--previous> from the options passed to B<msgmerge>. This is necessary to support versions of B<gettext> earlier than 0.16.
zh_hans: 此选项从传递给 B<msgmerge> 的选项中删除 B<-previous>。这是支持 0.16 之前的 B<gettext> 版本所必需的。
zh_hant: 此選項從傳遞給 B<msgmerge> 的選項中刪除 B<-previous>。這是支援 0.16 之前的 B<gettext> 版本所必需的。

source: This option adds B<--previous> to the options passed to B<msgmerge>. It requires B<gettext> 0.16 or later, and is activated by default.
zh_hans: 此选项 B<--previous> 添加到传递给 B<msgmerge> 的选项中。它需要 B<gettext> 0.16 或更高版本，并在默认情况下激活。
zh_hant: 此選項 B<--previous> 新增到傳遞給 B<msgmerge> 的選項中。它需要 B<gettext> 0.16 或更高版本，並在預設情況下啟用。
