Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: In this case, the command won't be extracted from any block. But if it appears alone on a block, then only the parameters marked as translatable will be presented to the translator. This is useful for font commands. These commands should generally not be separated from their paragraph (to keep the context), but there is no reason to annoy the translator with them if a whole string is enclosed in such a command.
sv: I det här fallet extraheras inte kommandot från något block. Men om det förekommer ensamt i ett block, kommer endast de parametrar som är markerade som översättningsbara att presenteras för översättaren. Detta är användbart för teckensnittskommandon. Dessa kommandon bör i allmänhet inte separeras från sitt stycke (för att behålla sammanhanget), men det finns ingen anledning att besvära översättaren med dem om en hel sträng är innesluten i ett sådant kommando.
zh_hans: 在这种情况下，不会从任何块中提取命令。但是如果它单独出现在块上，那么只有标记为可翻译的参数才会显示给翻译器。这对于字体命令很有用。这些命令通常不应该与它们的段落分开(以保持上下文)，但是如果整个字符串都包含在这样的命令中，就没有理由用它们来烦扰翻译人员。
zh_hant: 在這種情況下，不會從任何塊中提取命令。但是如果它單獨出現在塊上，那麼只有標記為可翻譯的引數才會顯示給翻譯器。這對於字型命令很有用。這些命令通常不應該與它們的段落分開(以保持上下文)，但是如果整個字串都包含在這樣的命令中，就沒有理由用它們來煩擾翻譯人員。

source: The I<parameters> argument is a set of [] (to indicate an optional argument) or {} (to indicate a mandatory argument). You can place an underscore (_) between these brackets to indicate that the parameter must be translated. For example: % po4a: command *chapter [_]{_}
sv: Argumentet i<parameters> är en uppsättning av [] (för att ange ett valfritt argument) eller {} (för att ange ett obligatoriskt argument). Du kan placera ett understreck (_) mellan dessa parenteser för att ange att parametern måste översättas. Till exempel: % po4a: kommando *kapitel [_]{_}

source: This indicates that the chapter command has two parameters: an optional (short title) and a mandatory one, which must both be translated. If you want to specify that the href command has two mandatory parameters, that you don't want to translate the URL (first parameter), and that you don't want this command to be separated from its paragraph (which allow the translator to move the link in the sentence), you can use: % po4a: command -href {}{_}
sv: Detta indikerar att kapitelkommandot har två parametrar: en valfri (kort titel) och en obligatorisk, som båda måste översättas. Om du vill ange att kommandot href har två obligatoriska parametrar, att du inte vill översätta URL:en (första parametern) och att du inte vill att detta kommando ska separeras från sitt stycke (vilket gör det möjligt för översättaren att flytta länken i meningen), kan du använda: % po4a: command -href {}{_}

source: In this case, the information indicating which arguments must be translated is only used if a paragraph is only composed of this href command.
sv: I detta fall används informationen som anger vilka argument som måste översättas endast om ett stycke endast består av detta href-kommando.
zh_hans: 在这种情况下，仅当段落仅由此 href 命令组成时，才使用指示必须翻译哪些参数的信息。
zh_hant: 在這種情況下，僅當段落僅由此 href 命令組成時，才使用指示必須翻譯哪些引數的信息。

source: This defines the parameters accepted by the I<env> environment and specifies the ones to be translated. This information is later used to check the number of arguments of the \begin command. The syntax of the I<parameters> argument is the same as described for the others commands. The first parameter of the \begin command is the name of the environment. This parameter must not be specified in the list of parameters. Here are some examples: % po4a: environment multicols {} % po4a: environment equation
sv: Detta definierar de parametrar som accepteras av I-<env> -miljön och specificerar vilka som ska översättas. Denna information används senare för att kontrollera antalet argument för \begin-kommandot. Syntaxen för I-<parameters> -argumentet är densamma som beskrivs för andra kommandon. Den första parametern för \begin-kommandot är namnet på miljön. Denna parameter får inte anges i listan över parametrar. Här är några exempel: % po4a: miljö multicols {} % po4a: miljö equation

source: As for the commands, I<env> can be preceded by a plus (+) to indicate that the \begin command must be translated with all its arguments.
sv: När det gäller kommandona kan jag<env> föregås av ett plustecken (+) för att ange att kommandot \begin måste översättas med alla dess argument.
zh_hans: 至于命令，i<env> 前面可以有一个加号 (+)，表示 \begin 命令必须使用其所有参数进行转换。
zh_hant: 至於命令，i<env> 前面可以有一個加號 (+)，表示 \begin 命令必須使用其所有引數進行轉換。

source: Indicates that an environment should be split according to the given regular expression.
sv: Anger att en miljö ska delas upp enligt det angivna reguljära uttrycket.
zh_hans: 指示应根据给定正则表达式拆分环境。
zh_hant: 指示應根據給定正則表示式拆分環境。

source: The regular expression is delimited by quotes. It should not create any back-reference. You should use (?:) if you need a group. It may also need some escapes.
sv: Det reguljära uttrycket avgränsas av citattecken. Det bör inte skapa någon bakåtreferens. Du bör använda (?:) om du behöver en grupp. Det kan också behöva några escape-tecken.
zh_hans: 正则表达式由引号分隔。它不应该创建任何反向引用。如果需要组，应使用 (?:)。它可能还需要一些逃脱。
zh_hant: 正則表示式由引號分隔。它不應該建立任何反向引用。如果需要組，應使用 (?:)。它可能還需要一些逃脫。

source: For example, the LaTeX module uses the "(?:&|\\\\)" regular expression to translate separately each cell of a table (lines are separated by '\\' and cells by '&').
sv: LaTeX-modulen använder till exempel det reguljära uttrycket "(?:&|\\\\)" för att översätta varje cell i en tabell separat (raderna separeras med '\\' och cellerna med '&').
zh_hans: 例如，LaTeX 模块使用 "(?:&|\\\\)" 正则表达式分别翻译表的每个单元格(行用 '\\' 分隔，单元格用 '&' 分隔)。
zh_hant: 例如，LaTeX 模組使用 "(?:&|\\\\)" 正則表示式分別翻譯表的每個單元格(行用 '\\' 分隔，單元格用 '&' 分隔)。

source: The notion of environment is expanded to the type displayed in the PO file. This can be used to split on "\\\\" in the first mandatory argument of the title command. In this case, the environment is title{#1}.
sv: Begreppet miljö utvidgas till den typ som visas i PO-filen. Detta kan användas för att dela upp på "\\\\" i det första obligatoriska argumentet i kommandot title. I detta fall är miljön title{#1}.
zh_hans: 环境的概念扩展为 PO 文件中显示的类型。这可用于拆分 title 命令的第一个强制参数中的 "\\\\"。在本例中，环境是 title{#1}。
zh_hant: 環境的概念擴充套件為 PO 檔案中顯示的型別。這可用於拆分 title 命令的第一個強制引數中的 "\\\\"。在本例中，環境是 title{#1}。

source: Indicate that I<env> is a verbatim environment. Comments and commands will be ignored in this environment.
sv: Ange att I<env> är en ordagrann miljö. Kommentarer och kommandon ignoreras i denna miljö.
zh_hans: 指示 I<env> 是一个逐字环境。在此环境中将忽略注释和命令。
zh_hant: 指示 I<env> 是一個逐字環境。在此環境中將忽略註釋和命令。

source: WRITING DERIVATE MODULES
sv: SKRIVA DERIVATMODULER
zh_hans: 编写衍生模块
zh_hant: 編寫衍生模組

source: Add a string as a comment to be added around the next translated element. This is mostly useful to the texinfo module, as comments are automatically handled in TeX.
sv: Lägg till en sträng som en kommentar som ska läggas till runt nästa översatta element. Detta är främst användbart för texinfo-modulen, eftersom kommentarer hanteras automatiskt i TeX.
zh_hans: 添加字符串作为要在下一个翻译元素周围添加的注释。 这对于 texinfo 模块非常有用，因为注释在 TeX 中自动处理。
zh_hant: 新增字串作為要在下一個翻譯元素周圍新增的註釋。 這對於 texinfo 模組非常有用，因為註釋在 TeX 中自動處理。

source: Wrapper around Transtractor's translate, with pre- and post-processing filters.
sv: Wrapper runt Transtractors översättning, med filter för för- och efterbearbetning.
zh_hans: 封装在转换器的翻译上，带有前后处理过滤器。
zh_hant: 封裝在轉換器的翻譯上，帶有前後處理過濾器。

source: Comments of a paragraph are inserted as a PO comment for the first translated string of this paragraph.
sv: Kommentarer till ett stycke infogas som en PO-kommentar till den första översatta strängen i detta stycke.
zh_hans: 段落注释作为此段落第一个翻译字符串的 PO 注释插入。
zh_hant: 段落註釋作為此段落第一個翻譯字串的 PO 註釋插入。

source: This function returns:
sv: Denna funktion returnerar:
zh_hans: 此函数返回：
zh_hant: 此函式返回：

source: A command name
sv: Ett kommandonamn
zh_hans: 命令名称
zh_hant: 命令名稱

source: If no command is found at the beginning of the given buffer, this string will be empty. Only commands that can be separated are considered. The %separated_command hash contains the list of these commands.
sv: Om inget kommando hittas i början av den angivna buffert, kommer denna sträng att vara tom. Endast kommandon som kan separeras beaktas. Hash %separated_command innehåller listan över dessa kommandon.
zh_hans: 如果在给定缓冲区的开头未找到命令，则此字符串将为空。只考虑可以分隔的命令。%separated_command 散列包含这些命令的列表。
zh_hant: 如果在給定緩衝區的開頭未找到命令，則此字串將為空。只考慮可以分隔的命令。%separated_command 雜湊包含這些命令的列表。

source: A variant
sv: En variant
zh_hans: 变种
zh_hant: 變種

source: This indicates if a variant is used. For example, an asterisk (*) can be added at the end of sections command to specify that they should not be numbered. In this case, this field will contain "*". If there is no variant, the field is an empty string.
sv: Detta anger om en variant används. Till exempel kan en asterisk (*) läggas till i slutet av sektionskommandot för att ange att de inte ska numreras. I detta fall kommer fältet att innehålla "*". Om det inte finns någon variant är fältet en tom sträng.
zh_hans: 这表明是否使用了变量。例如，可以在 sections 命令的末尾添加星号(*)，以指定不应对其进行编号。在本例中，此字段将包含 "*"。如果没有变量，则该字段为空字符串。
zh_hant: 這表明是否使用了變數。例如，可以在 sections 命令的末尾新增星號(*)，以指定不應對其進行編號。在本例中，此欄位將包含 "*"。如果沒有變數，則該欄位為空字元串。

source: An array of tuples (type of argument, argument)
sv: En matris av tupler (typ av argument, argument)
zh_hans: 元组数组（参数类型、参数）
zh_hant: 元組陣列（引數型別、引數）

source: The type of argument can be either '{' (for mandatory arguments) or '[' (for optional arguments).
sv: Argumenttypen kan vara antingen '{' (för obligatoriska argument) eller '[' (för valfria argument).
zh_hans: 参数类型可以是 '{' (对于强制参数) 或 '[' (对于可选参数)。
zh_hant: 引數型別可以是 '{' (對於強制引數) 或 '[' (對於可選引數)。

source: The remaining buffer
sv: Den återstående buffert
zh_hans: 剩余的缓冲区
zh_hant: 剩餘的緩衝區

source: The rest of the buffer after the removal of this leading command and its arguments. If no command is found, the original buffer is not touched and returned in this field.
sv: Resten av buffertminnet efter borttagandet av detta inledande kommando och dess argument. Om inget kommando hittas, lämnas det ursprungliga buffertminnet orört och returneras i detta fält.
zh_hans: 删除此前导命令及其参数后缓冲区的其余部分。如果未找到命令，则不会触及原始缓冲区，并在此字段中返回。
zh_hant: 刪除此前導命令及其引數後緩衝區的其餘部分。如果未找到命令，則不會觸及原始緩衝區，並在此欄位中返回。

source: The same as B<get_leading_command>, but for commands at the end of a buffer.
sv: Samma som B<get_leading_command>, men för kommandon i slutet av en buffert.
zh_hans: 与 B<get_leading_command> 相同，但适用于缓冲区末尾的命令。
zh_hant: 與 B<get_leading_command> 相同，但適用於緩衝區末尾的命令。

source: Recursively translate a buffer by separating leading and trailing commands (those which should be translated separately) from the buffer.
sv: Översätt en buffert rekursivt genom att separera inledande och avslutande kommandon (de som ska översättas separat) från bufferten.
zh_hans: 通过将前导命令和尾随命令(应该分别转换的命令)从缓冲区中分离出来，递归地转换缓冲区。
zh_hant: 透過將前導命令和尾隨命令(應該分別轉換的命令)從緩衝區中分離出來，遞迴地轉換緩衝區。

source: If a function is defined in %translate_buffer_env for the current environment, this function will be used to translate the buffer instead of translate_buffer().
sv: Om en funktion definieras i %translate_buffer_env för den aktuella miljön, kommer denna funktion att användas för att översätta bufferten istället för translate_buffer().
zh_hans: 如果在 %translate_buffer_env 中为当前环境定义了函数，则此函数将用于转换缓冲区，而不是 translate_buffer()。
zh_hant: 如果在 %translate_buffer_env 中為當前環境定義了函式，則此函式將用於轉換緩衝區，而不是 translate_buffer()。

source: Overloads Transtractor's read().
sv: Överbelastar Transtractors read().
zh_hans: 重载翻译器的 read()。
zh_hant: 過載翻譯器的 read()。

source: B<read_file>
sv: B<läs_fil>

source: Recursively read a file, appending included files which are not listed in the @exclude_include array. Included files are searched using the B<kpsewhich> command from the Kpathsea library.
sv: Läs en fil rekursivt och lägg till inkluderade filer som inte finns med i @exclude_include-matrisen. Inkluderade filer söks med hjälp av kommandot B<kpsewhich> från Kpathsea-biblioteket.
zh_hans: 递归读取文件，追加 @exclude_include 数组中未列出的包含文件。包含的文件是使用 KpathSea 库中的 B<kpseWhich> 命令进行搜索的。
zh_hant: 遞迴讀取檔案，追加 @exclude_include 陣列中未列出的包含檔案。包含的檔案是使用 KpathSea 庫中的 B<kpseWhich> 命令進行搜尋的。

source: Except from the file inclusion part, it is a cut and paste from Transtractor's read.
sv: Förutom delen om filinkludering är det ett utdrag ur Transtractors läsning.
zh_hans: 除了文件包含部分，它是从翻译提取器的读取中剪切并粘贴的。
zh_hant: 除了檔案包含部分，它是從翻譯提取器的讀取中剪下並貼上的。

source: Subroutine for parsing a file with po4a directives (definitions for new commands).
sv: Subrutin för att analysera en fil med po4a-direktiv (definitioner för nya kommandon).
zh_hans: 用于使用 po4a 指令解析文件的子例程 (新命令的定义)。
zh_hant: 用於使用 po4a 指令解析檔案的子例程 (新命令的定義)。

source: Parse a definition line of the form "% po4a: ".
sv: Analysera en definitionsrad av formen "% po4a: ".
zh_hans: 解析格式为 "% po4a: " 的定义行。
zh_hant: 解析格式為 "% po4a: " 的定義行。

source: See the B<INLINE CUSTOMIZATION> section for more details.
sv: Se avsnittet B-<INLINE CUSTOMIZATION> för mer information.
zh_hans: 有关更多详细信息，请参阅 B<INLINE CUSTOMIZATION> 部分。
zh_hant: 有關更多詳細資訊，請參閱 B<INLINE CUSTOMIZATION> 部分。

source: INTERNAL FUNCTIONS used to write derivative parsers
sv: INTERNA FUNKTIONER som används för att skriva derivatparsers
zh_hans: 用于编写派生解析器的内部函数
zh_hant: 用於編寫派生解析器的內部函式

source: Command and environment functions take the following arguments (in addition to the $self object):
sv: Kommando- och miljöfunktioner tar följande argument (utöver objektet $self):
zh_hans: 命令和环境函数接受以下参数(除了 $self 对象之外)：
zh_hant: 命令和環境函式接受以下引數(除了 $self 物件之外)：

source: An array of (type, argument) tuples
sv: En matris av (typ, argument) tupler
zh_hans: (类型、参数)元组的数组
zh_hant: (型別、引數)元組的陣列

source: The current environment
sv: Den nuvarande miljön
zh_hans: 当前环境
zh_hant: 當前環境

source: The first 3 arguments are extracted by get_leading_command or get_trailing_command.
sv: De första tre argumenten extraheras av get_leading_command eller get_trailing_command.
zh_hans: 前 3 个参数由 get_leading_command 或 get_trailing_command 提取。
zh_hant: 前 3 個引數由 get_leading_command 或 get_trailing_command 提取。

source: Command and environment functions return the translation of the command with its arguments and a new environment.
sv: Kommando- och miljöfunktioner returnerar översättningen av kommandot med dess argument och en ny miljö.
zh_hans: 命令和环境函数返回命令及其参数和新环境的转换。
zh_hant: 命令和環境函式返回命令及其引數和新環境的轉換。

source: Environment functions are called when a \begin command is found. They are called with the \begin command and its arguments.
sv: Miljöfunktioner anropas när ett \begin-kommando hittas. De anropas med \begin-kommandot och dess argument.
zh_hans: 当找到 \begin 命令时，将调用环境函数。它们由 \begin 命令及其参数调用。
zh_hant: 當找到 \begin 命令時，將呼叫環境函式。它們由 \begin 命令及其引數呼叫。

source: The TeX module only proposes one command function and one environment function: generic_command and generic_environment.
sv: TeX-modulen föreslår endast en kommandofunktion och en miljöfunktion: generic_command och generic_environment.
zh_hans: TeX 模块只提出一个命令函数和一个环境函数：generic_command 和 generic_environment。
zh_hant: TeX 模組只提出一個命令函式和一個環境函式：generic_command 和 generic_environment。

source: generic_command uses the information specified by register_generic_command or by adding definition to the TeX file: % po4a: command I<command1> I<parameters>
sv: generic_command använder den information som anges av register_generic_command eller genom att lägga till en definition i TeX-filen: % po4a: kommando I<command1> I<parameters>

source: generic_environment uses the information specified by register_generic_environment or by adding definition to the TeX file: % po4a: environment I<env> I<parameters>
sv: generic_environment använder den information som anges av register_generic_environment eller genom att lägga till en definition i TeX-filen: % po4a: environment I<env> I<parameters>

source: Both functions will only translate the parameters that were specified as translatable (with a '_'). generic_environment will append the name of the environment to the environment stack and generic_command will append the name of the command followed by an identifier of the parameter (like {#7} or [#2]).
sv: Båda funktionerna översätter endast de parametrar som har angetts som översättningsbara (med ett '_'). generic_environment lägger till namnet på miljön till miljöstacken och generic_command lägger till namnet på kommandot följt av en identifierare för parametern (som {#7} eller [#2]).
zh_hans: 这两个函数将仅转换指定为可翻译的参数(带 '_')。generic_environment 将把环境的名称附加到环境堆栈中，而 generic_command 将在命令的名称后面加上参数的标识符(如 {#7} 或 [#2])。
zh_hant: 這兩個函式將僅轉換指定為可翻譯的引數(帶 '_')。generic_environment 將把環境的名稱附加到環境堆疊中，而 generic_command 將在命令的名稱後面加上引數的識別符號(如 {#7} 或 [#2])。

source: This module needs more tests.
sv: Denna modul behöver testas mer.
zh_hans: 此模块需要更多测试。
zh_hant: 此模組需要更多測試。

source: It was tested on a book and with the Python documentation.
sv: Det testades på en bok och med Python-dokumentationen.
zh_hans: 它在一本书上进行了测试，并使用 Python 文档进行了测试。
zh_hant: 它在一本書上進行了測試，並使用 Python 文件進行了測試。

source: TODO LIST
sv: ATT GÖRA-LISTA
zh_hans: 待办事项清单使用PO4A：：XML进行转换
zh_hant: 待辦事項清單使用PO4A：：XML進行轉換

source: Automatic detection of new commands
sv: Automatisk upptäckt av nya kommandon
zh_hans: 自动检测新命令
zh_hant: 自動檢測新命令

source: The TeX module could parse the newcommand arguments and try to guess the number of arguments, their type and whether or not they should be translated.
sv: TeX-modulen kunde analysera newcommand-argumenten och försöka gissa antalet argument, deras typ och om de skulle översättas eller inte.
zh_hans: Tex 模块可以解析 newcommand 参数，并尝试猜测参数的数量、它们的类型以及是否应该转换它们。
zh_hant: Tex 模組可以解析 newcommand 引數，並嘗試猜測引數的數量、它們的型別以及是否應該轉換它們。

source: Translation of the environment separator
sv: Översättning av miljöavgränsaren
zh_hans: 环境分隔符的翻译
zh_hant: 環境分隔符的翻譯

source: When \item is used as an environment separator, the item argument is attached to the following string.
sv: När \item används som miljöavgränsare läggs argumentet item till följande sträng.
zh_hans: 当 \item 用作环境分隔符时，item 参数附加到以下字符串。
zh_hant: 當 \item 用作環境分隔符時，item 引數附加到以下字串。

source: Some commands should be added to the environment stack
sv: Vissa kommandon bör läggas till i miljöstacken
zh_hans: 应将某些命令添加到环境堆栈
zh_hant: 應將某些命令新增到環境堆疊

source: These commands should be specified by couples. This can be used to specify commands beginning or ending a verbatim environment.
sv: Dessa kommandon ska anges av par. Detta kan användas för att ange kommandon som inleder eller avslutar en verbatim-miljö.

source: Others
sv: Andra
zh_hans: 其它
zh_hant: 其它

source: Various other points are tagged TODO in the source.
sv: Olika andra punkter är markerade med TODO i källkoden.
zh_hans: 各种其他点在源代码中都标记为 TODO。
zh_hant: 各種其他點在原始碼中都標記為 TODO。

source: KNOWN BUGS
sv: KÄNDA BUGGAR
zh_hans: 已知缺陷
zh_hant: 已知缺陷

source: Various points are tagged FIXME in the source.
sv: Olika punkter är markerade med FIXME i källkoden.
zh_hans: 源代码中的各个点都被标记为 FIXME。
zh_hant: 原始碼中的各個點都被標記為 FIXME。

source: Locale::Po4a::Texinfo - convert Texinfo documents and derivates from/to PO files
sv: Locale::Po4a::Texinfo – konvertera Texinfo-dokument och derivat från/till PO-filer
zh_hans: Locale::Po4a::Texinfo - 将 Texinfo 文档和衍生从/转换为 PO 文件
zh_hant: Locale::Po4a::Texinfo - 將 Texinfo 文件和衍生從/轉換為 PO 檔案

source: Locale::Po4a::Texinfo is a module to help the translation of Texinfo documents into other [human] languages.
sv: Locale::Po4a::Texinfo är ett modul som hjälper till att översätta Texinfo-dokument till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Texinfo 是一个帮助将 Texinfo 文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Texinfo 是一個幫助將 Texinfo 文件翻譯成其他 [人類] 語言的模組。

source: This module contains the definitions of common Texinfo commands and environments.
sv: Denna modul innehåller definitioner av vanliga Texinfo-kommandon och miljöer.
zh_hans: 本模块包含常见 Texinfo 命令和环境的定义。
zh_hant: 本模組包含常見 Texinfo 命令和環境的定義。

source: Only the comments starting with 'TRANSLATORS' are added to the PO files to guide the translators.
sv: Endast kommentarer som börjar med "TRANSLATORS" läggs till i PO-filerna för att vägleda översättarna.
zh_hans: 只有以 'TRANSLATORS' 开头的注释才会添加到 PO 文件中，以指导翻译人员。
zh_hant: 只有以 'TRANSLATORS' 開頭的註釋才會新增到 PO 檔案中，以指導翻譯人員。

source: This module is still beta and not ready for production use. Please send patches to contribute, not bug reports as we don't know how to deal with them.
sv: Denna modul är fortfarande i betaversion och inte klar för produktionsanvändning. Skicka gärna patchar för att bidra, men inte felrapporter, eftersom vi inte vet hur vi ska hantera dem.

source: no-warn
sv: ingen varning

source: Do not warn about the current state of this module.
sv: Varna inte om det aktuella tillståndet för denna modul.

source: Locale::Po4a::Text - convert text documents from/to PO files
sv: Locale::Po4a::Text - konvertera textdokument från/till PO-filer
zh_hans: Locale::Po4a::Text - 将文本文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Text - 將文字文件從/轉換為 PO 檔案

source: Locale::Po4a::Text is a module to help the translation of text documents into other [human] languages.
sv: Locale::Po4a::Text är ett modul som hjälper till att översätta textdokument till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Text 是一个帮助将文本文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Text 是一個幫助將文字文件翻譯成其他 [人類] 語言的模組。

source: Paragraphs are split on empty lines (or lines containing only spaces or tabulations).
sv: Avsnitt delas upp på tomma rader (eller rader som endast innehåller mellanslag eller tabulatorer).
zh_hans: 段落以空行 (或仅包含空格或表格的行) 拆分。
zh_hant: 段落以空行 (或僅包含空格或表格的行) 拆分。

source: If a paragraph contains a line starting by a space (or tabulation), this paragraph won't be rewrapped.
sv: Om ett stycke innehåller en rad som börjar med ett blanksteg (eller tabulator), kommer detta stycke inte att ombrytas.
zh_hans: 如果段落包含以空格(或制表符)开头的行，则此段落不会重新换行。
zh_hant: 如果段落包含以空格(或製表符)開頭的行，則此段落不會重新換行。

source: Treat paragraphs that look like a colon-separated key-value pair as verbatim (with the C<no-wrap> flag in the PO file). A key-value pair string is a string like C<key: value>, containing one or more non-colon and non-space characters followed by a colon followed by at least one non-space character before the end of the line.
sv: Behandla stycken som ser ut som ett kolonavgränsat nyckel-värdepar som ordagrant (med C-<no-wrap> -flaggan i PO-filen). En nyckel-värdeparsträng är en sträng som C-<key: value>, som innehåller ett eller flera tecken som inte är kolon eller mellanslag, följt av ett kolon och minst ett tecken som inte är mellanslag före slutet av raden.

source: Deactivate the detection of bullets.
sv: Inaktivera detektering av kulor.
zh_hans: 停用对项目符号的检测。
zh_hant: 停用對專案符號的檢測。

source: By default, when a bullet is detected, the bullet paragraph is not considered as a verbatim paragraph (with the C<no-wrap> flag in the PO file). Instead, the corresponding paragraph is rewrapped in the translation.
sv: Som standard betraktas inte ett stycke med punktlistor som ett ordagrant stycke (med flaggan C<no-wrap> i PO-filen) när en punktlista upptäcks. Istället omformateras motsvarande stycke i översättningen.

source: Specify how tabulations shall be handled. The I<mode> can be any of:
sv: Ange hur tabelleringar ska hanteras. I-<mode> en kan vara någon av följande:
zh_hans: 指定应如何处理制表。I<mode> 可以是以下任一项：
zh_hant: 指定應如何處理製表。I<mode> 可以是以下任一項：

source: Lines with tabulations introduce breaks in the current paragraph.
sv: Rader med tabelleringar introducerar avbrott i det aktuella stycket.
zh_hans: 带有表格的行会在当前段落中引入分隔符。
zh_hant: 帶有表格的行會在當前段落中引入分隔符。

source: Paragraph containing tabulations will not be re-wrapped.
sv: Avsnitt som innehåller tabeller kommer inte att omformateras.
zh_hans: 包含表格的段落将不会重新换行。
zh_hant: 包含表格的段落將不會重新換行。

source: By default, tabulations are considered as spaces.
sv: Som standard betraktas tabulatorer som mellanslag.
zh_hans: 默认情况下，制表符被视为空格。
zh_hant: 預設情況下，製表符被視為空格。
