Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: This module is still very limited, and will always be, because it's not a real nroff interpreter. It would be possible to do a real nroff interpreter, to allow authors to use all the existing macros, or even to define new ones in their pages, but we didn't want to. It would be too difficult, and we thought it wasn't necessary. We do think that if manpages' authors want to see their productions translated, they may have to adapt to ease the work of translators.
sv: Denna modul är fortfarande mycket begränsad, och kommer alltid att vara det, eftersom den inte är en riktig nroff-tolkar. Det skulle vara möjligt att skapa en riktig nroff-tolkar, för att låta författare använda alla befintliga makron, eller till och med definiera nya på sina sidor, men vi ville inte göra det. Det skulle vara för svårt, och vi tyckte att det inte var nödvändigt. Vi anser att om manpages-författare vill se sina produktioner översatta, måste de kanske anpassa sig för att underlätta översättarnas arbete.
zh_hans: 这个模块仍然非常有限，而且将永远如此，因为它不是一个真正的 nroff 解释器。做一个真正的 nroff 解释器是可能的，允许作者使用所有现有的宏，甚至在他们的页面中定义新的宏，但我们不想这样做。这太难了，我们认为没有必要。我们确实认为，如果手册页的作者想要看到他们的作品被翻译，他们可能必须适应，以减轻翻译人员的工作。
zh_hant: 這個模組仍然非常有限，而且將永遠如此，因為它不是一個真正的 nroff 直譯器。做一個真正的 nroff 直譯器是可能的，允許作者使用所有現有的宏，甚至在他們的頁面中定義新的宏，但我們不想這樣做。這太難了，我們認為沒有必要。我們確實認為，如果手冊頁的作者想要看到他們的作品被翻譯，他們可能必須適應，以減輕翻譯人員的工作。

source: So, the man parser implemented in po4a have some known limitations we are not really inclined to correct, and which will constitute some pitfalls you'll have to avoid if you want to see translators taking care of your documentation.
sv: Således har den man-parser som implementerats i po4a några kända begränsningar som vi inte riktigt är benägna att korrigera, och som kommer att utgöra några fallgropar som du måste undvika om du vill att översättare ska ta hand om din dokumentation.
zh_hans: 因此，po4a 中实现的 man 解析器有一些我们不太愿意纠正的已知限制，如果您希望看到翻译人员处理您的文档，这些限制将构成您必须避免的一些陷阱。
zh_hant: 因此，po4a 中實現的 man 解析器有一些我們不太願意糾正的已知限制，如果您希望看到翻譯人員處理您的文件，這些限制將構成您必須避免的一些陷阱。

source: Don't program in nroff
sv: Programmera inte i nroff
zh_hans: 不要在 nroff 中编程
zh_hant: 不要在 nroff 中程式設計

source: nroff is a complete programming language, with macro definition, conditionals and so on. Since this parser isn't a fully featured nroff interpreter, it will fail on pages using these facilities (There are about 200 such pages on my box).
sv: nroff är ett komplett programmeringsspråk med makrodefinitioner, villkorssatser och så vidare. Eftersom denna parser inte är en fullfjädrad nroff-tolkar kommer den att misslyckas på sidor som använder dessa funktioner (det finns cirka 200 sådana sidor på min dator).
zh_hans: nroff 是一种完整的编程语言，具有宏定义、条件等功能。因为这个解析器不是一个功能齐全的 nroff 解释器，所以它在使用这些工具的页面上将失败 (我框中大约有200个这样的页面)。
zh_hant: nroff 是一種完整的程式語言，具有宏定義、條件等功能。因為這個解析器不是一個功能齊全的 nroff 直譯器，所以它在使用這些工具的頁面上將失敗 (我框中大約有200個這樣的頁面)。

source: Use the plain macro set
sv: Använd det vanliga makrosetet
zh_hans: 使用普通宏集
zh_hant: 使用普通宏集

source: There are still some macros which are not supported by po4a::man. This is only because I failed to find any documentation about them. Here is the list of unsupported macros used on my box. Note that this list isn't exhaustive since the program fails on the first encountered unsupported macro. If you have any information about some of these macros, I'll happily add support for them. Because of these macros, about 250 pages on my box are inaccessible to po4a::man.
sv: Det finns fortfarande några makron som inte stöds av po4a::man. Detta beror endast på att jag inte har lyckats hitta någon dokumentation om dem. Här är en lista över makron som inte stöds och som används på min dator. Observera att listan inte är fullständig, eftersom programmet avbryts vid det första makrot som inte stöds. Om du har information om något av dessa makron lägger jag gärna till stöd för dem. På grund av dessa makron är cirka 250 sidor på min dator otillgängliga för po4a::man.
zh_hans: 仍然有一些宏不受 po4a::man 支持。这只是因为我找不到任何关于它们的文档。这是我的计算机上使用的不受支持的宏的列表。请注意，此列表并不详尽，因为程序在第一个遇到的不受支持的宏上失败。如果您有关于这些宏的任何信息，我很乐意添加对它们的支持。由于这些宏，po4a::man 无法访问我框中的大约 250 个页面。
zh_hant: 仍然有一些宏不受 po4a::man 支援。這只是因為我找不到任何關於它們的文件。這是我的計算機上使用的不受支援的宏的列表。請注意，此列表並不詳盡，因為程式在第一個遇到的不受支援的宏上失敗。如果您有關於這些宏的任何資訊，我很樂意新增對它們的支援。由於這些宏，po4a::man 無法訪問我框中的大約 250 個頁面。

source: Hiding text from po4a
sv: Dölja text från po4a
zh_hans: 从 po4a 隐藏文本
zh_hant: 從 po4a 隱藏文字

source: Sometimes, the author knows that some parts are not translatable, and should not be extracted by po4a. For example, an option may accept an I<other> argument, and I<other> may also appear as the last item of a list. In the first case, I<other> should be not be translatable. And in the second case, I<other> should be translated.
sv: Ibland vet författaren att vissa delar inte är översättningsbara och inte bör extraheras av po4a. Till exempel kan en flagga acceptera ett argument I<other>, och I<other> kan också visas som det sista objektet i en lista. I det första fallet bör I<other> inte vara översättningsbart. I det andra fallet bör I<other> översättas.
zh_hans: 有时，作者知道有些部分是不可翻译的，不应该用 po4a 提取。例如，选项可能接受 I<other> 参数，并且 I<other> 也可能显示为列表的最后一项。在第一种情况下，I<other> 应该是不可翻译的。在第二种情况下，应该翻译 I<other>。
zh_hant: 有時，作者知道有些部分是不可翻譯的，不應該用 po4a 提取。例如，選項可能接受 I<other> 引數，並且 I<other> 也可能顯示為列表的最後一項。在第一種情況下，I<other> 應該是不可翻譯的。在第二種情況下，應該翻譯 I<other>。

source: In such case, the author can avoid po4a to extract some strings, using some special groff constructs:
sv: I sådana fall kan författaren undvika po4a för att extrahera vissa strängar genom att använda vissa speciella groff-konstruktioner:
zh_hans: 在这种情况下，作者可以避免 po4a 提取一些字符串，使用一些特殊的 groff 结构：
zh_hant: 在這種情況下，作者可以避免 po4a 提取一些字串，使用一些特殊的 groff 結構：

source: .if !'po4a'hide' .B other
sv: .if !'po4a'hide' .B annat

source: (this will require the B<-o groff_code=verbatim> option)
sv: (detta kräver flaggan B<-o groff_code=verbatim>)
zh_hans: (这将需要 B<-o groff_code=verbatim> 选项)
zh_hant: (這將需要 B<-o groff_code=verbatim> 選項)

source: A new macro can also be defined to automate this: .de IR_untranslated . IR \\$@ ..
sv: Ett nytt makro kan också definieras för att automatisera detta: .de IR_untranslated . IR \\$@ ..

source: (this will require the options B<-o groff_code=verbatim> and B<-o untranslated=IR_untranslated>; with this construct, the B<.if !'po4a'hide'> conditional is not strictly needed since po4a will not parse the internal of the macro definition)
sv: (detta kräver flaggorna B<-o groff_code=verbatim> och B<-o untranslated=IR_untranslated>; med denna konstruktion är villkoret B<.if !'po4a'hide'> inte strikt nödvändigt eftersom po4a inte kommer att analysera det interna i makrodefinitionen)
zh_hans: (这将需要选项 B<-o groff_code=verbatim> 和 B<-o untranslated=IR_untranslated>；使用此构造，不严格需要 B<.if !'po4a'hide'> 条件，因为 po4a 不会解析宏定义的内部)
zh_hant: (這將需要選項 B<-o groff_code=verbatim> 和 B<-o untranslated=IR_untranslated>；使用此構造，不嚴格需要 B<.if !'po4a'hide'> 條件，因為 po4a 不會解析宏定義的內部)

source: or using an alias: .als IR_untranslated IR
sv: eller använda ett alias: .als IR_untranslated IR

source: This will require the B<-o untranslated=als,IR_untranslated> option.
sv: Detta kräver flaggan B<-o untranslated=als,IR_untranslated>.
zh_hans: 这将需要 B<-o untranslated=als,IR_untranslated> 选项。
zh_hant: 這將需要 B<-o untranslated=als,IR_untranslated> 選項。

source: Conclusion
sv: Slutsats
zh_hans: 结论
zh_hant: 結論

source: To summarise this section, keep simple, and don't try to be clever while authoring your man pages. A lot of things are possible in nroff, and not supported by this parser. For example, don't try to mess with \c to interrupt the text processing (like 40 pages on my box do). Or, be sure to put the macro arguments on the same line that the macro itself. I know that it's valid in nroff, but would complicate too much the parser to be handled.
sv: Sammanfattningsvis: håll det enkelt och försök inte vara smart när du skriver dina man-sidor. Det finns många möjligheter i nroff, men denna parser stöder inte alla. Försök till exempel inte att använda \c för att avbryta textbearbetningen (som 40 sidor på min dator gör). Se också till att placera makroargumenten på samma rad som själva makrot. Jag vet att det är giltigt i nroff, men det skulle komplicera parsern för mycket.
zh_hans: 总结这一节，请保持简单，在编写手册页时不要试图变得聪明。很多事情在 nroff 中是可能的，并且不被这个解析器支持。例如，不要试图扰乱 \c 来中断文本处理(就像我框中的 40 页一样)。或者，确保将宏参数与宏本身放在同一行。我知道它在 nroff 中是有效的，但是会使解析器过于复杂而无法处理。
zh_hant: 總結這一節，請保持簡單，在編寫手冊頁時不要試圖變得聰明。很多事情在 nroff 中是可能的，並且不被這個解析器支援。例如，不要試圖擾亂 \c 來中斷文字處理(就像我框中的 40 頁一樣)。或者，確保將宏引數與宏本身放在同一行。我知道它在 nroff 中是有效的，但是會使解析器過於複雜而無法處理。

source: Of course, another possibility is to use another format, more translator friendly (like POD using po4a::pod, or one of the XML family like SGML), but thanks to po4a::man it isn't needed anymore. That being said, if the source format of your documentation is POD, or XML, it may be clever to translate the source format and not this generated one. In most cases, po4a::man will detect generated pages and issue a warning. It will even refuse to process POD generated pages, because those pages are perfectly handled by po4a::pod, and because their nroff counterpart defines a lot of new macros I didn't want to write support for. On my box, 1432 of the 4323 pages are generated from POD and will be ignored by po4a::man.
sv: En annan möjlighet är naturligtvis att använda ett annat format som är mer översättarvänligt (som POD med po4a::pod eller något av XML-familjens format, till exempel SGML), men tack vare po4a::man behövs det inte längre. Om källformatet för din dokumentation är POD eller XML kan det dock vara klokt att översätta källformatet och inte det genererade formatet. I de flesta fall kommer po4a::man att upptäcka genererade sidor och utfärda en varning. Det kommer till och med att vägra att bearbeta POD-genererade sidor, eftersom dessa sidor hanteras perfekt av po4a::pod och eftersom deras nroff-motsvarighet definierar en hel del nya makron som jag inte ville skriva stöd för. På min dator är 1432 av de 4323 sidorna genererade från POD och kommer att ignoreras av po4a::man.
zh_hans: 当然，另一种可能是使用另一种更便于翻译的格式(比如使用 po4a::pod 的 POD，或者像 SGML 这样的 XML 家族之一)，但是多亏了 po4a::man，它不再需要了。也就是说，如果您的文档的源格式是 POD 或 XML，那么转换源格式而不是这个生成的格式可能更聪明。在大多数情况下，po4a::man 将检测生成的页面并发出警告。它甚至会拒绝处理 POD 生成的页面，因为这些页面由 po4a::pod 完美地处理，而且它们的 nroff 对应项定义了许多我不想编写支持的新宏。在我的机器上，4323 个页面中的 1432 个是从 POD 生成的，将被 po4a::man 忽略。
zh_hant: 當然，另一種可能是使用另一種更便於翻譯的格式(比如使用 po4a::pod 的 POD，或者像 SGML 這樣的 XML 家族之一)，但是多虧了 po4a::man，它不再需要了。也就是說，如果您的文件的源格式是 POD 或 XML，那麼轉換源格式而不是這個生成的格式可能更聰明。在大多數情況下，po4a::man 將檢測生成的頁面併發出警告。它甚至會拒絕處理 POD 生成的頁面，因為這些頁面由 po4a::pod 完美地處理，而且它們的 nroff 對應項定義了許多我不想編寫支援的新宏。在我的機器上，4323 個頁面中的 1432 個是從 POD 生成的，將被 po4a::man 忽略。

source: In most cases, po4a::man will detect the problem and refuse to process the page, issuing an adapted message. In some rare cases, the program will complete without warning, but the output will be wrong. Such cases are called "bugs" ;) If you encounter such case, be sure to report this, along with a fix when possible…
sv: I de flesta fall kommer po4a::man att upptäcka problemet och vägra att bearbeta sidan, och istället visa ett anpassat meddelande. I vissa sällsynta fall kommer programmet att slutföras utan varning, men resultatet kommer att bli felaktigt. Sådana fall kallas "buggar" ;) Om du stöter på ett sådant fall, se till att rapportera detta, tillsammans med en lösning om möjligt…
zh_hans: 在大多数情况下， po4a::man 会发现问题并拒绝处理页面，发出一个适应的消息。在一些罕见的情况下，程序将没有警告完成，但输出将是错误的。这种情况称为 "bugs"；如果遇到这种情况，请务必报告此情况，并在可能时进行修复…
zh_hant: 在大多數情況下， po4a::man 會發現問題並拒絕處理頁面，發出一個適應的訊息。在一些罕見的情況下，程式將沒有警告完成，但輸出將是錯誤的。這種情況稱為 "bugs"；如果遇到這種情況，請務必報告此情況，並在可能時進行修復…

source: This module can be used for most of the existing man pages.
sv: Denna modul kan användas för de flesta befintliga man-sidor.
zh_hans: 此模块可用于大多数现有手册页。
zh_hant: 此模組可用於大多數現有手冊頁。

source: Some tests are regularly run on Linux boxes:
sv: Vissa tester körs regelbundet på Linux-datorer:
zh_hans: 一些测试定期在 Linux 机器上运行：
zh_hant: 一些測試定期在 Linux 機器上執行：

source: one third of the pages are refused because they were generated from another format supported by po4a (e.g. POD or SGML).
sv: en tredjedel av sidorna avvisas eftersom de har skapats från ett annat format som stöds av po4a (t.ex. POD eller SGML).
zh_hans: 三分之一的页面被拒绝，因为它们是从 po4a 支持的另一种格式 (例如 POD 或 SGML) 生成的。
zh_hant: 三分之一的頁面被拒絕，因為它們是從 po4a 支援的另一種格式 (例如 POD 或 SGML) 生成的。

source: 10% of the remaining pages are rejected with an error (e.g. a groff macro is not supported).
sv: 10% of de återstående sidorna avvisas med ett fel (t.ex. ett groff-makro stöds inte).
zh_hans: 10% 的剩余页面因错误而被拒绝(例如，不支持 groff 宏)。
zh_hant: 10% 的剩餘頁面因錯誤而被拒絕(例如，不支援 groff 宏)。

source: Then, less than 1% of the pages are accepted silently by po4a, but with significant issues (i.e. missing words, or new words inserted)
sv: Sedan accepteras mindre än 1% av sidorna tyst av po4a, men med betydande problem (dvs. saknade ord eller nya ord infogade)
zh_hans: 然后，只有不到 1% 的页面被 po4a 静默接受，但存在重大问题 (即丢失单词或插入新词)
zh_hant: 然後，只有不到 1% 的頁面被 po4a 靜默接受，但存在重大問題 (即丟失單詞或插入新詞)

source: The other pages are usually handled without differences more important than spacing differences or line rewrapped (font issues in less than 10% of the processed pages).
sv: De andra sidorna hanteras vanligtvis utan större skillnader än skillnader i avstånd eller radbrytningar (teckensnittsproblem i mindre än 10% of av de bearbetade sidorna).
zh_hans: 处理其他页面时通常没有比间距差异或换行更重要的差异 (只有不到 10% 的已处理页面出现字体问题)。
zh_hant: 處理其他頁面時通常沒有比間距差異或換行更重要的差異 (只有不到 10% 的已處理頁面出現字型問題)。

source: Locale::Po4a::Org - convert Org documents from/to PO files.
sv: Locale::Po4a::Org – konvertera Org-dokument från/till PO-filer.

source: C<Locale::Po4a::Org> is a module to help the translation of documentation in the Org format, used by the L<Org Mode|https://orgmode.org/>.
sv: C<Locale::Po4a::Org> är ett modul som hjälper till med översättning av dokumentation i Org-format, som används av L<Org Mode|https://orgmode.org/>.

source: CONFIGURATION
sv: KONFIGURATION

source: Space-separated list of keywords which won't be translated.
sv: Lista med nyckelord separerade med mellanslag som inte kommer att översättas.

source: Space-separated list of properties which won't be translated.
sv: Mellanslagsavgränsad lista över egenskaper som inte kommer att översättas.

source: If this is a true value, skip translating headings. When your translation is converted to Texinfo format, the translation of headings can cause node names to become bizarre. This option prevents that.
sv: Om detta är ett sant värde, hoppa över översättningen av rubriker. När din översättning konverteras till Texinfo-format kan översättningen av rubriker leda till att nodnamnen blir konstiga. Denna flagga förhindrar det.

source: This module is in an early stage of development. It is tested successfully on simple Org files, such as the L<Org Mode Compact Guide|https://orgmode.org/guide/>. However it does not support the full L<Org syntax|https://orgmode.org/worg/org-syntax.html>; footnotes and nested plain lists cannot currently be parsed, for example.
sv: Denna modul befinner sig i ett tidigt utvecklingsstadium. Den har testats framgångsrikt på enkla Org-filer, såsom L<Org Mode Compact Guide|https://orgmode.org/guide/>. Den stöder dock inte hela L<Org syntax|https://orgmode.org/worg/org-syntax.html>; fotnoter och kapslade vanliga listor kan till exempel inte analyseras för närvarande.

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL v2.0 or later (see the F<COPYING> file).
sv: Detta program är fri programvara; du får distribuera och/eller modifiera det enligt villkoren i GPL v2.0 eller senare (se filen F<COPYING> ).

source: Locale::Po4a::Po - PO file manipulation module
sv: Locale::Po4a::Po - Modul för hantering av PO-filer
zh_hans: Locale::Po4a::Po - PO 文件操作模块
zh_hant: Locale::Po4a::Po - PO 檔案操作模組

source: Locale::Po4a::Po is a module that allows you to manipulate message catalogs. You can load and write from/to a file (which extension is often I<po>), you can build new entries on the fly or request for the translation of a string.
sv: Locale::Po4a::Po är ett modul som gör det möjligt att manipulera meddelandekataloger. Du kan ladda och skriva från/till en fil (vars filändelse ofta är I<po>), du kan skapa nya poster direkt eller begära översättning av en sträng.
zh_hans: Locale::Po4a::Po 是一个允许您操作消息目录的模块。您可以从/向文件 (其扩展名通常是 I<po>) 加载和写入，您可以动态构建新条目或请求字符串翻译。
zh_hant: Locale::Po4a::Po 是一個允許您操作訊息目錄的模組。您可以從/向檔案 (其副檔名通常是 I<po>) 載入和寫入，您可以動態構建新條目或請求字串翻譯。

source: For a more complete description of message catalogs in the PO format and their use, please refer to the info documentation of the gettext program (node "`PO Files"').
sv: För en mer utförlig beskrivning av meddelandekataloger i PO-format och deras användning, se informationsdokumentationen för programmet gettext (nod "`PO-filer"').
zh_hans: 有关 PO 格式的消息目录及其使用的更完整说明，请参阅 gettext 程序(节点"'PO 文件"')的信息文档。
zh_hant: 有關 PO 格式的訊息目錄及其使用的更完整說明，請參閱 gettext 程式(節點"'PO 文件"')的資訊文件。

source: This module is part of the po4a project, which objective is to use PO files (designed at origin to ease the translation of program messages) to translate everything, including documentation (man page, info manual), package description, debconf templates, and everything which may benefit from this.
sv: Denna modul är en del av po4a-projektet, vars mål är att använda PO-filer (ursprungligen utformade för att underlätta översättning av programmeddelanden) för att översätta allt, inklusive dokumentation (man-sidor, infomanualer), paketbeskrivningar, debconf-mallar och allt annat som kan dra nytta av detta.
zh_hans: 此模块是 po4a 项目的一部分，该项目的目标是使用 PO 文件(在原始位置设计用于简化程序消息的翻译)来翻译所有内容，包括文档(手册页、信息手册)、软件包说明、debconf 模板以及可能从中受益的所有内容。
zh_hant: 此模組是 po4a 專案的一部分，該專案的目標是使用 PO 檔案(在原始位置設計用於簡化程式訊息的翻譯)來翻譯所有內容，包括文件(手冊頁、資訊手冊)、軟體包說明、debconf 模板以及可能從中受益的所有內容。

source: Functions concerning entire message catalogs
sv: Funktioner som rör hela meddelandekataloger
zh_hans: 有关整个消息目录的函数
zh_hant: 有關整個訊息目錄的函式

source: new()
sv: ny()

source: Creates a new message catalog. If an argument is provided, it's the name of a PO file we should load.
sv: Skapar en ny meddelandekatalog. Om ett argument anges är det namnet på en PO-fil som vi ska ladda.
zh_hans: 创建新的消息目录。如果提供了参数，则它是我们应该加载的 PO 文件的名称。
zh_hant: 建立新的訊息目錄。如果提供了引數，則它是我們應該載入的 PO 檔案的名稱。

source: read($)
sv: läs($)

source: Reads a PO file (which name is given as argument). Previously existing entries in self are not removed, the new ones are added to the end of the catalog.
sv: Läser en PO-fil (vars namn anges som argument). Befintliga poster i self tas inte bort, utan de nya läggs till i slutet av katalogen.
zh_hans: 读取 PO 文件(其名称作为参数给定)。self 中以前存在的条目不会删除，新条目会添加到目录的末尾。
zh_hant: 讀取 PO 檔案(其名稱作為引數給定)。self 中以前存在的條目不會刪除，新條目會新增到目錄的末尾。

source: write($)
sv: skriv($)

source: Writes the current catalog to the given file.
sv: Skriver den aktuella katalogen till den angivna filen.
zh_hans: 将当前目录写入给定文件。
zh_hant: 將當前目錄寫入給定檔案。

source: write_if_needed($$)
sv: skriv_om_nödvändigt($$)

source: Like write, but if the PO or POT file already exists, the object will be written in a temporary file which will be compared with the existing file to check if the update is needed (this avoids to change a POT just to update a line reference or the POT-Creation-Date field).
sv: Som skriva, men om PO- eller POT-filen redan finns kommer objektet att skrivas till en temporär fil som jämförs med den befintliga filen för att kontrollera om uppdateringen behövs (detta undviker att ändra en POT bara för att uppdatera en radreferens eller fältet POT-Creation-Date).
zh_hans: 与 write 类似，但如果 PO 或 POT 文件已经存在，则对象将被写入临时文件中，该临时文件将与现有文件进行比较，以检查是否需要更新 (这避免了仅仅为了更新线参考或 POT-Creation-Date 字段而更改 POT)。
zh_hant: 與 write 類似，但如果 PO 或 POT 檔案已經存在，則物件將被寫入臨時檔案中，該臨時檔案將與現有檔案進行比較，以檢查是否需要更新 (這避免了僅僅為了更新線參考或 POT-Creation-Date 欄位而更改 POT)。

source: This function extracts a catalog from an existing one. Only the entries having a reference in the given file will be placed in the resulting catalog.
sv: Denna funktion extraherar en katalog från en befintlig katalog. Endast de poster som har en referens i den angivna filen kommer att placeras i den resulterande katalogen.
zh_hans: 此函数用于从现有目录中提取目录。只有在给定文件中有引用的条目才会放入结果目录中。
zh_hant: 此函式用於從現有目錄中提取目錄。只有在給定檔案中有引用的條目才會放入結果目錄中。

source: This function parses its argument, converts it to a Perl function definition, evals this definition and filters the fields for which this function returns true.
sv: Denna funktion analyserar sitt argument, konverterar det till en Perl-funktionsdefinition, utvärderar denna definition och filtrerar de fält för vilka denna funktion returnerar true.
zh_hans: 该函数解析其参数，将其转换为 Perl 函数定义，计算该定义的值，并筛选该函数返回 true 的字段。
zh_hant: 該函式解析其引數，將其轉換為 Perl 函式定義，計算該定義的值，並篩選該函式返回 true 的欄位。

source: I love Perl sometimes ;)
sv: Ibland älskar jag Perl ;)
zh_hans: 我有时喜欢 Perl ;)
zh_hant: 我有時喜歡 Perl ;)

source: Functions to use a message catalog for translations
sv: Funktioner för att använda en meddelandekatalog för översättningar
zh_hans: 使用消息目录进行翻译的函数
zh_hant: 使用訊息目錄進行翻譯的函式

source: Request the translation of the string given as argument in the current catalog. The function returns the original (untranslated) string if the string was not found.
sv: Begär översättning av strängen som anges som argument i den aktuella katalogen. Funktionen returnerar den ursprungliga (oöversatta) strängen om strängen inte hittades.
zh_hans: 请求翻译当前目录中作为参数给定的字符串。如果未找到原始 (未翻译) 字符串，该函数将返回该字符串。
zh_hant: 請求翻譯當前目錄中作為引數給定的字串。如果未找到原始 (未翻譯) 字串，該函數將返回該字串。

source: After the string to translate, you can pass a hash of extra arguments. Here are the valid entries:
sv: Efter strängen som ska översättas kan du skicka en hash med extra argument. Här är de giltiga posterna:
zh_hans: 在要转换的字符串之后，可以传递一组额外的参数。以下是有效的条目：
zh_hant: 在要轉換的字串之後，可以傳遞一組額外的引數。以下是有效的條目：

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation, and wraps the result.
sv: boolean som anger om vi kan anse att blanktecken i strängen inte är viktiga. Om ja, kanoniserar funktionen strängen innan den söker efter en översättning och sluter in resultatet.
zh_hans: 指示我们是否可以认为字符串中的空格不重要的布尔值。如果是，则该函数在查找翻译之前对字符串进行规范化，并对结果进行封装。
zh_hant: 指示我們是否可以認為字串中的空格不重要的布林值。如果是，則該函式在查詢翻譯之前對字串進行規範化，並對結果進行封裝。

source: the column at which we should wrap (default: 76).
sv: den kolumn där vi ska bryta (standard: 76).
zh_hans: 我们应该换行的列 (默认值：76)。
zh_hant: 我們應該換行的列 (預設值：76)。

source: Returns statistics about the hit ratio of gettext since the last time that stats_clear() was called. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's statistics about recent usage of the PO file, while msgfmt reports the status of the file. Example of use:
sv: Returnerar statistik om träfffrekvensen för gettext sedan senaste gången stats_clear() anropades. Observera att det inte är samma statistik som den som skrivs ut av msgfmt --statistic. Här är det statistik om den senaste användningen av PO-filen, medan msgfmt rapporterar filens status. Exempel på användning:
zh_hans: 返回自上次调用 stats_clear() 以来 gettext 命中率的统计信息。请注意，它与 msgfmt --statistic 打印的统计数据不同。这里，它是关于 PO 文件最近使用情况的统计信息，而 msgfmt 报告文件的状态。使用示例：
zh_hant: 返回自上次呼叫 stats_clear() 以來 gettext 命中率的統計資訊。請注意，它與 msgfmt --statistic 列印的統計資料不同。這裡，它是關於 PO 檔案最近使用情況的統計資訊，而 msgfmt 報告檔案的狀態。使用示例：

source: [some use of the PO file to translate stuff] ($percent,$hit,$queries) = $pofile->stats_get(); print "So far, we found translations for $percent\% ($hit of $queries) of strings.\n";
sv: [viss användning av PO-filen för att översätta saker] ($percent,$hit,$queries) = $pofile->stats_get(); print "Hittills har vi hittat översättningar för $percent\% ($hit av $queries) av strängar.\n";

source: Clears the statistics about gettext hits.
sv: Rensar statistiken om gettext-träffar.
zh_hans: 清除有关 gettext 命中的统计信息。
zh_hant: 清除有關 gettext 命中的統計資訊。
