Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Outdated translations are often worse than no translation at all. End-users can be tricked by documentation describing an old behavior of the program. Furthermore, they cannot interact directly with the maintainers since they don't speak English. Additionally, the maintainer cannot fix the problem as they don't know every language in which their documentation is translated. These difficulties, often caused by poor tooling, can undermine the motivation of volunteer translators, further aggravating the problem.
sv: Föråldrade översättningar är ofta värre än inga översättningar alls. Slutanvändare kan luras av dokumentation som beskriver ett gammalt beteende hos programmet. Dessutom kan de inte kommunicera direkt med underhållarna eftersom de inte talar engelska. Underhållarna kan inte heller åtgärda problemet eftersom de inte kan alla språk som dokumentationen är översatt till. Dessa svårigheter, som ofta orsakas av dåliga verktyg, kan undergräva motivationen hos frivilliga översättare, vilket förvärrar problemet ytterligare.
zh_hans: 过时的翻译往往比根本没有翻译更糟糕。最终用户可能会被描述程序旧行为的文档所欺骗。此外，他们不能直接与维护人员互动，因为他们不会说英语。此外，维护员无法修复该问题，因为他们并不了解文档翻译所用的每种语言。这些困难通常是由糟糕的工具造成的，可能会削弱志愿翻译人员的积极性，进一步加剧问题。
zh_hant: 過時的翻譯往往比根本沒有翻譯更糟糕。終端使用者可能會被描述程式舊行為的文件所欺騙。此外，他們不能直接與維護人員互動，因為他們不會說英語。此外，維護員無法修復該問題，因為他們並不瞭解文件翻譯所用的每種語言。這些困難通常是由糟糕的工具造成的，可能會削弱志願翻譯人員的積極性，進一步加劇問題。

source: B<The goal of the po4a project is to ease the work of documentation translators>. In particular, it makes documentation translations I<maintainable>.
sv: B<The goal of the po4a project is to ease the work of documentation translators>. I synnerhet gör det dokumentationsöversättningar I<maintainable>.
zh_hans: B<po4a 项目的目标是简化文档翻译人员的工作>。具体地说，它使文档翻译 I<Maintenance> 变得可维护。
zh_hant: B<po4a 專案的目標是簡化文件翻譯人員的工作>。具體地說，它使文件翻譯 I<Maintenance> 變得可維護。

source: The idea is to reuse and adapt the gettext approach to this field. As with gettext, texts are extracted from their original locations and presented to translators as PO translation catalogs. The translators can leverage the classical gettext tools to monitor the work to do, collaborate and organize as teams. po4a then injects the translations directly into the documentation structure to produce translated source files that can be processed and distributed just like the English files. Any paragraph that is not translated is left in English in the resulting document, ensuring that the end users never see an outdated translation in the documentation.
sv: Tanken är att återanvända och anpassa gettext-metoden till detta område. Precis som med gettext extraheras texterna från sina ursprungliga platser och presenteras för översättarna som PO-översättningskataloger. Översättarna kan använda de klassiska gettext-verktygen för att övervaka arbetet, samarbeta och organisera sig i team. po4a infogar sedan översättningarna direkt i dokumentationsstrukturen för att producera översatta källfiler som kan bearbetas och distribueras precis som de engelska filerna. Alla stycken som inte översätts lämnas på engelska i det färdiga dokumentet, vilket säkerställer att slutanvändarna aldrig ser en föråldrad översättning i dokumentationen.
zh_hans: 我们的想法是重用 gettext 方法并使其适用于该领域。与 gettext 一样，文本从其原始位置提取，并作为 PO 翻译目录呈现给翻译人员。翻译人员可以利用经典的 gettext 工具来监控要进行的工作，并以团队形式进行协作和组织。然后，po4a 将翻译直接注入到文档结构中，以生成翻译后的源文件，可以像处理和分发英语文件一样处理和分发这些源文件。任何未翻译的段落都将以英语保留在生成的文档中，从而确保最终用户在文档中永远不会看到过时的翻译。
zh_hant: 我們的想法是重用 gettext 方法並使其適用於該領域。與 gettext 一樣，文字從其原始位置提取，並作為 PO 翻譯目錄呈現給翻譯人員。翻譯人員可以利用經典的 gettext 工具來監控要進行的工作，並以團隊形式進行協作和組織。然後，po4a 將翻譯直接注入到文件結構中，以生成翻譯後的原始檔，可以像處理和分發英語檔案一樣處理和分發這些原始檔。任何未翻譯的段落都將以英語保留在生成的文件中，從而確保終端使用者在文檔中永遠不會看到過時的翻譯。

source: This automates most of the grunt work of the translation maintenance. Discovering the paragraphs needing an update becomes very easy, and the process is completely automated when elements are reordered without further modification. Specific verification can also be used to reduce the chance of formatting errors that would result in a broken document.
sv: Detta automatiserar det mesta av det tunga arbetet med översättningsunderhållet. Det blir mycket enkelt att upptäcka vilka stycken som behöver uppdateras, och processen är helt automatiserad när element omordnas utan ytterligare modifieringar. Specifik verifiering kan också användas för att minska risken för formateringsfel som skulle kunna leda till ett trasigt dokument.
zh_hans: 这使翻译维护的大部分繁琐工作自动化。发现需要更新的段落变得非常容易，当元素重新排序而不需要进一步修改时，这个过程是完全自动的。还可以使用特定验证来减少导致文档损坏的格式化错误的机会。
zh_hant: 這使翻譯維護的大部分繁瑣工作自動化。發現需要更新的段落變得非常容易，當元素重新排序而不需要進一步修改時，這個過程是完全自動的。還可以使用特定驗證來減少導致文件損壞的格式化錯誤的機會。

source: Please also see the B<FAQ> below in this document for a more complete list of the advantages and disadvantages of this approach.
sv: Se även B-<FAQ> en nedan i detta dokument för en mer fullständig lista över fördelar och nackdelar med denna metod.
zh_hans: 有关此方法的优点和缺点的更完整列表，另请参阅本文档下面的 B<FAQ>。
zh_hant: 有關此方法的優點和缺點的更完整列表，另請參閱本文件下面的 B<FAQ>。

source: Supported formats
sv: Formater som stöds
zh_hans: 支持的格式
zh_hant: 支援的格式

source: Currently, this approach has been successfully implemented to several kinds of text formatting formats:
sv: För närvarande har denna metod framgångsrikt implementerats i flera olika textformateringsformat:
zh_hans: 目前，该方法已成功应用于多种文本格式：
zh_hant: 目前，該方法已成功應用於多種文字格式：

source: man (mature parser)
sv: man (mogen parser)
zh_hans: man (成熟解析器)
zh_hant: man (成熟解析器)

source: The good old manual pages' format, used by so many programs out there. po4a support is very welcome here since this format is somewhat difficult to use and not really friendly to newbies.
sv: Det gamla goda manualformatet, som används av så många program. Stöd för po4a är mycket välkommet här, eftersom detta format är något svårt att använda och inte särskilt användarvänligt för nybörjare.
zh_hans: 很好的老手册页的格式，被那么多的程序使用。po4a 支持在这里非常受欢迎，因为这种格式使用起来有些困难，对新手也不是很友好。
zh_hant: 很好的老手冊頁的格式，被那麼多的程式使用。po4a 支援在這裡非常受歡迎，因為這種格式使用起來有些困難，對新手也不是很友好。

source: The L<Locale::Po4a::Man(3pm)|Man> module also supports the mdoc format, used by the BSD man pages (they are also quite common on Linux).
sv: Modulen L<Locale::Po4a::Man(3pm)|Man> stöder även mdoc-formatet, som används av BSD-man-sidorna (de är också ganska vanliga på Linux).
zh_hans: L<Locale::Po4a::Man(3pm)|Man> 模块还支持 BSD 手册页使用的 MDOC 格式(它们在 Linux 上也很常见)。
zh_hant: L<Locale::Po4a::Man(3pm)|Man> 模組還支援 BSD 手冊頁使用的 MDOC 格式(它們在 Linux 上也很常見)。

source: AsciiDoc (mature parser)
sv: AsciiDoc (mogen parser)
zh_hans: AsciiDoc (成熟的解析器)
zh_hant: AsciiDoc (成熟的解析器)

source: This format is a lightweight markup format intended to ease the authoring of documentation. It is for example used to document the git system. Those manpages are translated using po4a.
sv: Detta format är ett lättviktigt markup-format som är avsett att underlätta skapandet av dokumentation. Det används till exempel för att dokumentera git-systemet. Dessa man-sidor översätts med hjälp av po4a.
zh_hans: 此格式是一种轻量级标记格式，旨在简化文档的创作。例如，它用于记录 git 系统。这些手册页是使用 po4a 翻译的。
zh_hant: 此格式是一種輕量級標記格式，旨在簡化文件的創作。例如，它用於記錄 git 系統。這些手冊頁是使用 po4a 翻譯的。

source: See L<Locale::Po4a::AsciiDoc> for details.
sv: Se L<Locale::Po4a::AsciiDoc> för mer information.
zh_hans: 有关详细信息，请参阅 L<Locale::Po4a::AsciiDoc>。
zh_hant: 有關詳細資訊，請參閱 L<Locale::Po4a::AsciiDoc>。

source: pod (mature parser)
sv: pod (mogen parser)
zh_hans: pod (成熟的解析器)
zh_hant: pod (成熟的解析器)

source: This is the Perl Online Documentation format. The language and extensions themselves are documented using this format in addition to most existing Perl scripts. It makes easy to keep the documentation close to the actual code by embedding them both in the same file. It makes programmer's life easier, but unfortunately, not the translator's, until you use po4a.
sv: Detta är formatet för Perl Online Documentation. Språket och tilläggen själva dokumenteras med hjälp av detta format, liksom de flesta befintliga Perl-skript. Det gör det enkelt att hålla dokumentationen nära den faktiska koden genom att bädda in dem båda i samma fil. Det underlättar för programmeraren, men tyvärr inte för översättaren, tills du använder po4a.
zh_hans: 这是 Perl 在线文档格式。除了大多数现有的 Perl 脚本之外，还使用此格式记录了语言和扩展本身。通过将文档和实际代码嵌入到同一文件中，可以轻松地使文档接近实际代码。它使程序员的工作变得更容易，但不幸的是，在您使用 po4a 之前，翻译员的工作并非如此。
zh_hant: 這是 Perl 線上文件格式。除了大多數現有的 Perl 指令碼之外，還使用此格式記錄了語言和擴充套件本身。透過將文件和實際程式碼嵌入到同一檔案中，可以輕鬆地使文件接近實際程式碼。它使程式設計師的工作變得更容易，但不幸的是，在您使用 po4a 之前，翻譯員的工作並非如此。

source: See L<Locale::Po4a::Pod> for details.
sv: Se L<Locale::Po4a::Pod> för mer information.
zh_hans: 有关详细信息，请参阅 L<Locale::Po4a::Pod>。
zh_hant: 有關詳細資訊，請參閱 L<Locale::Po4a::Pod>。

source: sgml (mature parser)
sv: sgml (mogen parser)
zh_hans: sgml (成熟的解析器)
zh_hant: sgml (成熟的解析器)

source: Even if superseded by XML nowadays, this format is still used for documents which are more than a few screens long. It can even be used for complete books. Documents of this length can be very challenging to update. B<diff> often reveals useless when the original text was re-indented after update. Fortunately, po4a can help you after that process.
sv: Även om detta format numera har ersatts av XML, används det fortfarande för dokument som är längre än några skärmbilder. Det kan till och med användas för hela böcker. Dokument av denna längd kan vara mycket svåra att uppdatera. B-<diff> en visar sig ofta vara värdelös när den ursprungliga texten har indragits på nytt efter uppdateringen. Lyckligtvis kan po4a hjälpa dig efter den processen.
zh_hans: 即使现在被 XML 取代，这种格式仍然用于超过几个屏幕的文档。它甚至可以用来制作完整的书籍。更新这种长度的文档可能非常困难。当原始文本在更新后重新缩进时，B<diff> 通常显示无用。幸运的是，po4a 可以在该过程之后帮助您。
zh_hant: 即使現在被 XML 取代，這種格式仍然用於超過幾個螢幕的文件。它甚至可以用來製作完整的書籍。更新這種長度的文件可能非常困難。當原始文字在更新後重新縮排時，B<diff> 通常顯示無用。幸運的是，po4a 可以在該過程之後幫助您。

source: Currently, only DebianDoc and DocBook DTD are supported, but adding support for a new one is really easy. It is even possible to use po4a on an unknown SGML DTD without changing the code by providing the needed information on the command line. See L<Locale::Po4a::Sgml(3pm)> for details.
sv: För närvarande stöds endast DebianDoc och DocBook DTD, men det är väldigt enkelt att lägga till stöd för nya. Det är till och med möjligt att använda po4a på en okänd SGML DTD utan att ändra koden genom att ange nödvändig information på kommandoraden. Se L<Locale::Po4a::Sgml(3pm)> för mer information.
zh_hans: 目前只支持 DebianDoc 和 DocBook DTD，但是添加对新 DTD 的支持非常简单。通过在命令行上提供所需的信息，甚至可以在未知的 SGML DTD 上使用 po4a，而无需更改代码。有关详细信息，请参见 L<Locale::Po4a::Sgml(3pm)>。
zh_hant: 目前只支援 DebianDoc 和 DocBook DTD，但是新增對新 DTD 的支援非常簡單。透過在命令列上提供所需的資訊，甚至可以在未知的 SGML DTD 上使用 po4a，而無需更改代碼。有關詳細資訊，請參見 L<Locale::Po4a::Sgml(3pm)>。

source: TeX / LaTeX (mature parser)
sv: TeX / LaTeX (mogen parser)
zh_hans: TeX / LaTeX (成熟的解析器)
zh_hant: TeX / LaTeX (成熟的解析器)

source: The LaTeX format is a major documentation format used in the Free Software world and for publications.
sv: LaTeX-formatet är ett viktigt dokumentationsformat som används inom fri programvara och för publikationer.
zh_hans: LaTeX 格式是自由软件世界和出版物中使用的主要文档格式。
zh_hant: LaTeX 格式是自由軟體世界和出版物中使用的主要文件格式。

source: The L<Locale::Po4a::LaTeX(3pm)|LaTeX> module was tested with the Python documentation, a book and some presentations.
sv: Modulen L<Locale::Po4a::LaTeX(3pm)|LaTeX> testades med Python-dokumentationen, en bok och några presentationer.
zh_hans: 使用 Python 文档、一本书和一些演示文稿测试了 L<Locale::Po4a::LaTeX(3pm)|LaTeX> 模块。
zh_hant: 使用 Python 文件、一本書和一些簡報測試了 L<Locale::Po4a::LaTeX(3pm)|LaTeX> 模組。

source: text (mature parser)
sv: text (mogen parser)
zh_hans: text (成熟解析器)
zh_hant: text (成熟解析器)

source: The Text format is the base format for many formats that include long blocks of text, including Markdown, fortunes, YAML front matter section, debian/changelog, and debian/control.
sv: Textformatet är grundformatet för många format som innehåller långa textblock, inklusive Markdown, fortunes, YAML front matter section, debian/changelog och debian/control.
zh_hans: 文本格式是包括长文本块的许多格式的基本格式，包括 Markdown、Forties、YAML Front Matter 部分、Debian/Changelog 和 Debian/Control。
zh_hant: 文字格式是包括長文字塊的許多格式的基本格式，包括 Markdown、Forties、YAML Front Matter 部分、Debian/Changelog 和 Debian/Control。

source: This supports the common format used in Static Site Generators, READMEs, and other documentation systems. See L<Locale::Po4a::Text(3pm)|Text> for details.
sv: Detta stöder det vanliga formatet som används i statiska webbplatsgeneratorer, README-filer och andra dokumentationssystem. Se L<Locale::Po4a::Text(3pm)|Text> för mer information.
zh_hans: 这支持静态站点生成器、自述文件和其他文档系统中使用的通用格式。有关详细信息，请参阅 L<Locale::Po4a::Text(3pm)|Text> 。
zh_hant: 這支援靜態站點生成器、自述檔案和其他文件系統中使用的通用格式。有關詳細資訊，請參閱 L<Locale::Po4a::Text(3pm)|Text> 。

source: xml and XHMTL (probably mature parser)
sv: xml och XHMTL (förmodligen mogen parser)
zh_hans: xml 和 XHMTL (可能是成熟的解析器)
zh_hant: xml 和 XHMTL (可能是成熟的解析器)

source: The XML format is a base format for many documentation formats.
sv: XML-formatet är ett basformat för många dokumentationsformat.
zh_hans: XML 格式是许多文档格式的基本格式。
zh_hant: XML 格式是許多文件格式的基本格式。

source: Currently, the DocBook DTD (see L<Locale::Po4a::Docbook(3pm)> for details) and XHTML are supported by po4a.
sv: För närvarande stöds DocBook DTD (se L<Locale::Po4a::Docbook(3pm)> för mer information) och XHTML av po4a.
zh_hans: 目前，po4a 支持 DocBook DTD (有关详细信息，请参阅 L<Locale::Po4a::Docbook(3pm)> )和 XHTML。
zh_hant: 目前，po4a 支援 DocBook DTD (有關詳細資訊，請參閱 L<Locale::Po4a::Docbook(3pm)> )和 XHTML。

source: BibTex (probably mature parser)
sv: BibTex (förmodligen mogen parser)
zh_hans: BibTex (可能是成熟的解析器)
zh_hant: BibTex (可能是成熟的解析器)

source: The BibTex format is used alongside LaTex for formatting lists of references (bibliographies).
sv: BibTex-formatet används tillsammans med LaTex för formatering av referenslistor (bibliografier).
zh_hans: BibTex 格式与 LaTeX 一起用于设置参考文献列表 (目录) 的格式。
zh_hant: BibTex 格式與 LaTeX 一起用於設定參考文獻列表 (目錄) 的格式。

source: See L<Locale::Po4a::BibTex> for details.
sv: Se L<Locale::Po4a::BibTex> för mer information.
zh_hans: 有关详细信息，请参阅 L<Locale::Po4a::BibTex>。
zh_hant: 有關詳細資訊，請參閱 L<Locale::Po4a::BibTex>。

source: Docbook (probably mature parser)
sv: Docbook (förmodligen mogen parser)
zh_hans: Docbook (可能是成熟的解析器)
zh_hant: Docbook (可能是成熟的解析器)

source: A XML-based markup language that uses semantic tags to describe documents.
sv: Ett XML-baserat markup-språk som använder semantiska taggar för att beskriva dokument.
zh_hans: 一种基于 XML 的标记语言，它使用语义标记来描述文档。
zh_hant: 一種基於 XML 的標記語言，它使用語義標記來描述文件。

source: See L<Locale::Po4a:Docbook> for greater details.
sv: Se L<Locale::Po4a:Docbook> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a:Docbook> 。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a:Docbook> 。

source: Guide XML (probably mature parser)
sv: Guide XML (förmodligen mogen parser)
zh_hans: Guide XML (可能是成熟的解析器)
zh_hant: Guide XML (可能是成熟的解析器)

source: A XML documentation format. This module was developed specifically to help with supporting and maintaining translations of Gentoo Linux documentation up until at least March 2016 (Based on the Wayback Machine). Gentoo have since moved to the DevBook XML format.
sv: Ett XML-dokumentationsformat. Denna modul utvecklades specifikt för att underlätta support och underhåll av översättningar av Gentoo Linux-dokumentation fram till åtminstone mars 2016 (baserat på Wayback Machine). Gentoo har sedan dess gått över till DevBook XML-formatet.
zh_hans: 一种 XML 文档格式。此模块专门用于帮助支持和维护 Gentoo Linux 文档的翻译，至少到 2016 年 3 月 (基于 Wayback Machine)。Gentoo 后来转移到了 DevBook XML 格式。
zh_hant: 一種 XML 文件格式。此模組專門用於幫助支援和維護 Gentoo Linux 文件的翻譯，至少到 2016 年 3 月 (基於 Wayback Machine)。Gentoo 後來轉移到了 DevBook XML 格式。

source: See L<Locale::Po4a:Guide> for greater details.
sv: Se L<Locale::Po4a:Guide> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a:Guide>。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a:Guide>。

source: Wml (probably mature parser)
sv: Wml (förmodligen mogen parser)
zh_hans: Wml (可能是成熟的解析器)
zh_hant: Wml (可能是成熟的解析器)

source: The Web Markup Language, do not mixup WML with the WAP stuff used on cell phones. This module relies on the Xhtml module, which itself relies on the XmL module.
sv: Web Markup Language, blanda inte ihop WML med WAP-tekniken som används i mobiltelefoner. Denna modul är beroende av Xhtml-modulen, som i sin tur är beroende av XmL-modulen.
zh_hans: Web 标记语言，不要将 WML 与手机上使用的 WAP 东西混淆。该模块依赖于 Xhtml 模块，而 Xhtml 模块本身又依赖于 XML 模块。
zh_hant: Web 標記語言，不要將 WML 與手機上使用的 WAP 東西混淆。該模組依賴於 Xhtml 模組，而 Xhtml 模組本身又依賴於 XML 模組。

source: See L<Locale::Po4a::Wml> for greater details.
sv: Se L<Locale::Po4a::Wml> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a::Wml>。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a::Wml>。

source: Yaml (probably mature parser)
sv: Yaml (förmodligen mogen parser)
zh_hans: Yaml (可能是成熟的解析器)
zh_hant: Yaml (可能是成熟的解析器)

source: A strict superset of JSON. YAML is often used as systems or configuration projects. YAML is at the core of Red Hat's Ansible.
sv: En strikt superset av JSON. YAML används ofta i system- eller konfigurationsprojekt. YAML är kärnan i Red Hats Ansible.
zh_hans: JSON 的严格超集。YAML 通常用作系统或配置项目。YAML 是红帽的 Ansible 的核心。
zh_hant: JSON 的嚴格超集。YAML 通常用作系統或配置專案。YAML 是紅帽的 Ansible 的核心。

source: See L<Locale::Po4a::Yaml> for greater details.
sv: Se L<Locale::Po4a::Yaml> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a::Yaml> 。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a::Yaml> 。

source: RubyDoc (probably mature parser)
sv: RubyDoc (förmodligen mogen parser)
zh_hans: RubyDoc (可能是成熟的解析器)
zh_hant: RubyDoc (可能是成熟的解析器)

source: The Ruby Document (RD) format, originally the default documentation format for Ruby and Ruby projects before converted to RDoc in 2002. Though apparently the Japanese version of the Ruby Reference Manual still use RD.
sv: Ruby Document (RD)-formatet var ursprungligen standardformatet för dokumentation för Ruby och Ruby-projekt innan det konverterades till RDoc 2002. Den japanska versionen av Ruby Reference Manual använder dock fortfarande RD.
zh_hans: Ruby 文档 (RD) 格式，在 2002 年转换为 RDoC 之前，最初是 Ruby 和 Ruby 项目的默认文档格式。尽管显然日文版的 Ruby 参考手册仍然使用 RD。
zh_hant: Ruby 文件 (RD) 格式，在 2002 年轉換為 RDoC 之前，最初是 Ruby 和 Ruby 專案的預設文件格式。儘管顯然日文版的 Ruby 參考手冊仍然使用 RD。

source: See L<Locale::Po4a::RubyDoc> for greater details.
sv: Se L<Locale::Po4a::RubyDoc> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a::RubyDoc>。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a::RubyDoc>。

source: Halibut (probably experimental parser)
sv: Halibut (förmodligen experimentell parser)
zh_hans: Halibut (高度实验性的解析器)
zh_hant: Halibut (高度實驗性的解析器)

source: A documentation production system, with elements similar to TeX, debiandoc-sgml, TeXinfo, and others, developed by Simon Tatham, the developer of PuTTY.
sv: Ett system för dokumentproduktion, med element som liknar TeX, debiandoc-sgml, TeXinfo och andra, utvecklat av Simon Tatham, utvecklaren av PuTTY.
zh_hans: 由 PuTTY 的开发者 Simon Tatham 开发的文档生产系统，其元素类似于 TeX、debiandoc-sgml、TeXinfo 和其他。
zh_hant: 由 PuTTY 的開發者 Simon Tatham 開發的文件生產系統，其元素類似於 TeX、debiandoc-sgml、TeXinfo 和其他。

source: See L<Locale::Po4a:Halibut> for greater details.
sv: Se L<Locale::Po4a:Halibut> för mer information.
zh_hans: 有关更多详细信息，请参见 L<Locale::Po4a:Halibut>。
zh_hant: 有關更多詳細資訊，請參見 L<Locale::Po4a:Halibut>。

source: Ini (probably experimental parser)
sv: Ini (förmodligen experimentell parser)
zh_hans: Ini (高度实验性的解析器)
zh_hant: Ini (高度實驗性的解析器)

source: Configuration file format popularized by MS-DOS.
sv: Konfigurationsfilformat som populariserades av MS-DOS.
zh_hans: MS-DOS 普及的配置文件格式。
zh_hant: MS-DOS 普及的配置檔案格式。

source: See L<Locale::Po4a::Ini> for greater details.
sv: Se L<Locale::Po4a::Ini> för mer information.
zh_hans: 有关更多详细信息，请参阅 L<Locale::Po4a::Ini> 。
zh_hant: 有關更多詳細資訊，請參閱 L<Locale::Po4a::Ini> 。

source: texinfo (very highly experimental parser)
sv: texinfo (mycket experimentell parser)
zh_hans: texinfo (高度实验性的解析器)
zh_hant: texinfo (高度實驗性的解析器)

source: All of the GNU documentation is written in this format (it's even one of the requirements to become an official GNU project). The support for L<Locale::Po4a::Texinfo(3pm)|Texinfo> in po4a is still at the beginning. Please report bugs and feature requests.
sv: All GNU-dokumentation är skriven i detta format (det är till och med ett av kraven för att bli ett officiellt GNU-projekt). Stödet för L<Locale::Po4a::Texinfo(3pm)|Texinfo> i po4a är fortfarande i sin linda. Vänligen rapportera buggar och önskemål om funktioner.
zh_hans: 所有 GNU 文档都是以这种格式编写的(这甚至是成为正式 GNU 项目的要求之一)。po4a 中对 L<Locale::Po4a::Texinfo(3pm)|Texinfo> 的支持还处于起步阶段。请报告错误和功能请求。
zh_hant: 所有 GNU 文件都是以這種格式編寫的(這甚至是成為正式 GNU 專案的要求之一)。po4a 中對 L<Locale::Po4a::Texinfo(3pm)|Texinfo> 的支援還處於起步階段。請報告錯誤和功能請求。

source: gemtext (very highly experimental parser)
sv: gemtext (mycket experimentell parser)

source: The native plain text format of the Gemini protocol. The extension C<.gmi> is commonly used. Support for this module in po4a is still in its infancy. If you find anything, please file a bug or feature request.
sv: Det inbyggda ren textformatet i Gemini-protokollet. Filändelsen C<.gmi> används vanligtvis. Stödet för denna modul i po4a är fortfarande i sin linda. Om du upptäcker något, vänligen rapportera ett fel eller skicka en funktionsförfrågan.

source: org (very highly experimental parser)
sv: org (mycket experimentell parser)

source: The document format used by the Org mode. Support for this module in po4a is still in its infancy. If you find anything, please file a bug or feature request.
sv: Det dokumentformat som används av Org-läget. Stödet för denna modul i po4a är fortfarande i sin linda. Om du upptäcker något, vänligen rapportera ett fel eller en funktionsförfrågan.

source: vimhelp (very highly experimental parser)
sv: vimhelp (mycket experimentell parser)

source: The format used for Vim help files (and some third-party plugin documentation). Support for this format in po4a is still in its infancy. If you find anything, please file a bug report or feature request.
sv: Formatet som används för Vim-hjälpfiler (och viss dokumentation för plugin-program från tredje part). Stödet för detta format i po4a är fortfarande i sin linda. Om du upptäcker något, vänligen skicka in en felrapport eller en funktionsförfrågan.

source: simplepod (very highly experimental parser)
sv: simplepod (mycket experimentell parser)

source: Similar to the previously mentioned I<pod>, this one adopts the new L<Pod::Simple> as its parser. Since it is newly created, some bugs are expected. If you notice any strange behavior, please let us know. Eventually, this module will replace I<pod>.
sv: I likhet med den tidigare nämnda I<pod> använder denna den nya L<Pod::Simple> som parser. Eftersom den är nyutvecklad kan vissa buggar förekomma. Om du upptäcker något konstigt beteende, vänligen meddela oss. Så småningom kommer denna modul att ersätta I<pod>.

source: Others supported formats
sv: Andra format som stöds
zh_hans: 其他支持的格式
zh_hant: 其他支援的格式

source: Po4a can also handle some more rare or specialized formats, such as the documentation of compilation options for the 2.4+ Linux kernels (L<Locale::Po4a::KernelHelp>) or the diagrams produced by the dia tool (L<Locale::Po4a::Dia>). Adding a new format is often very easy and the main task is to come up with a parser for your target format. See L<Locale::Po4a::TransTractor(3pm)> for more information about this.
sv: Po4a kan också hantera vissa mer sällsynta eller specialiserade format, såsom dokumentation av kompileringsflaggor för Linux-kärnorna 2.4+ (L<Locale::Po4a::KernelHelp>) eller diagram som skapats med verktyget dia (L<Locale::Po4a::Dia>). Det är ofta mycket enkelt att lägga till ett nytt format och det viktigaste är att ta fram en parser för det format du vill använda. Se L<Locale::Po4a::TransTractor(3pm)> för mer information om detta.

source: Unsupported formats
sv: Format som inte stöds
zh_hans: 不支持的格式
zh_hant: 不支援的格式
