Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Please refer to L<po4a(7)|po4a.7> for more information on what addenda are, and how translators should write them. To apply an addendum to the translated document, simply pass its filename to this function and you are done ;)
sv: Se L<po4a(7)|po4a.7> för mer information om vad tillägg är och hur översättare ska skriva dem. För att tillämpa ett tillägg på det översatta dokumentet, skicka bara dess filnamn till denna funktion så är du klar ;)
zh_hans: 请参阅 L<po4a(7)|po4a.7>，了解有关附录的详细信息，以及翻译人员应如何编写附录。要对翻译后的文档应用附录，只需将其文件名传递给此函数，即可完成 ;)
zh_hant: 請參閱 L<po4a(7)|po4a.7>，瞭解有關附錄的詳細資訊，以及翻譯人員應如何編寫附錄。要對翻譯後的文件應用附錄，只需將其檔名傳遞給此函式，即可完成 ;)

source: This function returns a non-null integer on error.
sv: Denna funktion returnerar ett icke-null-heltal vid fel.
zh_hans: 此函数在出错时返回非空整数。
zh_hant: 此函式在出錯時返回非空整數。

source: Getting input, providing output
sv: Få input, ge output
zh_hans: 获取输入，提供输出
zh_hant: 獲取輸入，提供輸出

source: Four functions are provided to get input and return output. They are very similar to shift/unshift and push/pop of Perl.
sv: Fyra funktioner tillhandahålls för att hämta inmatning och returnera utdata. De liknar mycket shift/unshift och push/pop i Perl.
zh_hans: 提供了四个函数来获取输入和返回输出。它们与 Perl 的 shift/unshift 和 push/pop 非常相似。
zh_hant: 提供了四個函式來獲取輸入和返回輸出。它們與 Perl 的 shift/unshift 和 push/pop 非常相似。

source: * Perl shift returns the first array item and drop it from the array. * Perl unshift prepends an item to the array as the first array item. * Perl pop returns the last array item and drop it from the array. * Perl push appends an item to the array as the last array item.
sv: * Perl shift returnerar det första arrayelementet och tar bort det från arrayen. * Perl unshift lägger till ett element i början av arrayen som det första arrayelementet. * Perl pop returnerar det sista arrayelementet och tar bort det från arrayen. * Perl push lägger till ett element i slutet av arrayen som det sista arrayelementet.

source: The first pair is about input, while the second is about output. Mnemonic: in input, you are interested in the first line, what shift gives, and in output you want to add your result at the end, like push does.
sv: Det första paret handlar om inmatning, medan det andra handlar om utmatning. Mnemoteknik: vid inmatning är du intresserad av den första raden, vad shift ger, och vid utmatning vill du lägga till ditt resultat i slutet, precis som push gör.
zh_hans: 第一对是关于输入的，第二对是关于输出的。助记符：在 input 中，您感兴趣的是第一行，shift 提供什么，而在 output 中，您希望将结果添加到末尾，就像 push 一样。
zh_hant: 第一對是關於輸入的，第二對是關於輸出的。助記符：在 input 中，您感興趣的是第一行，shift 提供什麼，而在 output 中，您希望將結果新增到末尾，就像 push 一樣。

source: This function returns the first line to be parsed and its corresponding reference (packed as an array) from the array C<< @{$self->{TT}{doc_in}} >> and drop these first 2 array items. Here, the reference is provided by a string C<< $filename:$linenum >>.
sv: Denna funktion returnerar den första raden som ska analyseras och dess motsvarande referens (packad som en array) från arrayen C<< @{$self->{TT}{doc_in}} >> och tar bort dessa två första arrayelement. Här tillhandahålls referensen av en sträng C<< $filename:$linenum >>.
zh_hans: 此函数从数组 C<< @{$self->{TT}{doc_in}} >> 返回要解析的第一行及其对应的引用 (打包为数组)，并删除前两个数组项。这里，引用由字符串 C<< $filename:$linenum >> 提供。
zh_hant: 此函式從陣列 C<< @{$self->{TT}{doc_in}} >> 返回要解析的第一行及其對應的引用 (打包為陣列)，並刪除前兩個陣列項。這裡，引用由字串 C<< $filename:$linenum >> 提供。

source: Unshifts the last shifted line of the input document and its corresponding reference back to the head of C<< {$self->{TT}{doc_in}} >>.
sv: Återställer den senast flyttade raden i indokumentet och dess motsvarande referens tillbaka till början av C<< {$self->{TT}{doc_in}} >>.
zh_hans: 取消将输入文档的最后移位行及其对应的引用移回 C<< {$self->{TT}{doc_in}} >> 的头部。
zh_hant: 取消將輸入文件的最後移位行及其對應的引用移回 C<< {$self->{TT}{doc_in}} >> 的頭部。

source: Push a new line to the end of C<< {$self->{TT}{doc_out}} >>.
sv: Skicka en ny rad till slutet av C<< {$self->{TT}{doc_out}} >>.
zh_hans: 将新行推到 C<< {$self->{TT}{doc_out}} >> 的末尾。
zh_hant: 將新行推到 C<< {$self->{TT}{doc_out}} >> 的末尾。

source: Pop the last pushed line from the end of C<< {$self->{TT}{doc_out}} >>.
sv: Ta bort den sista raden från slutet av C<< {$self->{TT}{doc_out}} >>.
zh_hans: 从 C<< {$self->{TT}{doc_out}} >> 的末尾弹出最后推送的行。
zh_hant: 從 C<< {$self->{TT}{doc_out}} >> 的末尾彈出最後推送的行。

source: Marking strings as translatable
sv: Markera strängar som översättningsbara
zh_hans: 将字符串标记为可翻译
zh_hant: 將字串標記為可翻譯

source: One function is provided to handle the text which should be translated.
sv: En funktion tillhandahålls för att hantera texten som ska översättas.
zh_hans: 提供一个函数来处理应该翻译的文本。
zh_hant: 提供一個函式來處理應該翻譯的文字。

source: Mandatory arguments:
sv: Obligatoriska argument:
zh_hans: 必选参数：
zh_hant: 必選引數：

source: A string to translate
sv: En sträng att översätta
zh_hans: 要翻译的字符串
zh_hant: 要翻譯的字串

source: The reference of this string (i.e. position in inputfile)
sv: Referensen för denna sträng (dvs. position i inmatningsfilen)
zh_hans: 此字符串的引用 (即输入文件中的位置)
zh_hant: 此字串的引用 (即輸入檔案中的位置)

source: The type of this string (i.e. the textual description of its structural role; used in Locale::Po4a::Po::gettextization(); see also L<po4a(7)|po4a.7>, section B<Gettextization: how does it work?>)
sv: Denna strängs typ (dvs. den textuella beskrivningen av dess strukturella roll; används i Locale::Po4a::Po::gettextization(); se även L<po4a(7)|po4a.7>, avsnitt B<Gettextization: hur fungerar det?>)
zh_hans: 此字符串的类型(即对其结构角色的文本描述；在 Locale::Po4a::Po::gettextization() 中使用；另请参阅 L<po4a(7)|po4a.7>，B<Gettextization: how does it work?> 部分)
zh_hant: 此字串的型別(即對其結構角色的文字描述；在 Locale::Po4a::Po::gettextization() 中使用；另請參閱 L<po4a(7)|po4a.7>，B<Gettextization: how does it work?> 部分)

source: This function can also take some extra arguments. They must be organized as a hash. For example:
sv: Denna funktion kan också ta några extra argument. De måste organiseras som en hash. Till exempel:
zh_hans: 此函数还可以接受一些额外的参数。它们必须组织为散列。例如：
zh_hant: 此函式還可以接受一些額外的引數。它們必須組織為雜湊。例如：

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation or extracting it, and wraps the translation.
sv: boolean som anger om vi kan anse att blanktecken i strängen inte är viktiga. Om ja, kanoniserar funktionen strängen innan den söker efter en översättning eller extraherar den, och sluter in översättningen.
zh_hans: 指示我们是否可以认为字符串中的空格不重要的布尔值。如果是，则该函数在查找或提取翻译之前对字符串进行规范化，并对翻译进行封装。
zh_hant: 指示我們是否可以認為字串中的空格不重要的布林值。如果是，則該函式在查詢或提取翻譯之前對字串進行規範化，並對翻譯進行封裝。

source: the column at which we should wrap (default: the value of B<wrapcol> specified during creation of the TransTractor or 76).
sv: den kolumn där vi ska bryta (standard: värdet för B-<wrapcol> t som angavs vid skapandet av TransTractor eller 76).

source: The negative value will be substracted from the default.
sv: Det negativa värdet kommer att subtraheras från standardvärdet.

source: an extra comment to add to the entry.
sv: en extra kommentar att lägga till i inlägget.
zh_hans: 要添加到条目的额外注释。
zh_hant: 要新增到條目的額外註釋。

source: Actions:
sv: Åtgärder:
zh_hans: 操作：
zh_hant: 操作：

source: Pushes the string, reference and type to po_out.
sv: Skickar strängen, referensen och typen till po_out.
zh_hans: 将字符串、引用和类型推送到 po_out。
zh_hant: 將字串、引用和型別推送到 po_out。

source: Returns the translation of the string (as found in po_in) so that the parser can build the doc_out.
sv: Returnerar översättningen av strängen (som finns i po_in) så att parsern kan bygga doc_out.
zh_hans: 返回字符串的翻译(如 po_in 中所示)，以便解析器可以构建 doc_out。
zh_hant: 返回字串的翻譯(如 po_in 中所示)，以便解析器可以構建 doc_out。

source: Handles the charsets to recode the strings before sending them to po_out and before returning the translations.
sv: Hanterar teckenuppsättningarna för att omkodera strängarna innan de skickas till po_out och innan översättningarna returneras.
zh_hans: 在将字符串发送到 po_out 和返回翻译之前，处理字符集以重新编码字符串。
zh_hant: 在將字串傳送到 po_out 和返回翻譯之前，處理字符集以重新編碼字串。

source: Misc functions
sv: Övriga funktioner
zh_hans: 其他函数
zh_hant: 其他函式

source: Returns if the verbose option was passed during the creation of the TransTractor.
sv: Returnerar om flaggan verbose angavs vid skapandet av TransTractor.
zh_hans: 返回是否在创建翻译提取器期间传递了 verbose 选项。
zh_hant: 返回是否在建立翻譯提取器期間傳遞了 verbose 選項。

source: Returns if the debug option was passed during the creation of the TransTractor.
sv: Returnerar om felsökningsflaggan överfördes under skapandet av TransTractor.
zh_hans: 返回是否在创建翻译提取器期间传递了调试选项。
zh_hant: 返回是否在建立翻譯提取器期間傳遞了除錯選項。

source: This function return the charset that was provided as master charset
sv: Denna funktion returnerar det teckenuppsättningsformat som angavs som huvudteckenuppsättningsformat

source: This function will return the charset that should be used in the output document (usually useful to substitute the input document's detected charset where it has been found).
sv: Denna funktion returnerar den teckenuppsättning som ska användas i utdatadokumentet (vanligtvis användbart för att ersätta den teckenuppsättning som upptäckts i indatadokumentet där den har hittats).
zh_hans: 此函数将返回应该在输出文档中使用的字符集(通常用于替换已找到的输入文档的检测到的字符集)。
zh_hant: 此函式將返回應該在輸出文件中使用的字符集(通常用於替換已找到的輸入文件的檢測到的字符集)。

source: It will use the output charset specified in the command line. If it wasn't specified, it will use the input PO's charset, and if the input PO has the default "CHARSET", it will return the input document's charset, so that no encoding is performed.
sv: Den använder den teckenuppsättning som anges i kommandoraden. Om ingen teckenuppsättning anges används teckenuppsättningen i den inmatade PO:n, och om den inmatade PO:n har standardteckenuppsättningen "CHARSET" returneras teckenuppsättningen i det inmatade dokumentet, så att ingen kodning utförs.
zh_hans: 它将使用命令行中指定的输出字符集。如果未指定该命令，则将使用输入 PO 的字符集，如果输入 PO 具有默认的 "CHARSET"，则返回输入文档的字符集，以便不会执行编码。
zh_hant: 它將使用命令列中指定的輸出字符集。如果未指定該命令，則將使用輸入 PO 的字元集，如果輸入 PO 具有預設的 "CHARSET"，則返回輸入文件的字符集，以便不會執行編碼。

source: FUTURE DIRECTIONS
sv: FRAMTIDA RIKTNINGAR
zh_hans: 未来方向
zh_hant: 未來方向

source: One shortcoming of the current TransTractor is that it can't handle translated document containing all languages, like debconf templates, or .desktop files.
sv: En brist hos den nuvarande TransTractor är att den inte kan hantera översatta dokument som innehåller alla språk, såsom debconf-mallar eller .desktop-filer.
zh_hans: 当前翻译提取器的一个缺点是它不能处理包含所有语言的翻译文档，如 debconf 模板或 .desktop 文件。
zh_hant: 當前翻譯提取器的一個缺點是它不能處理包含所有語言的翻譯文件，如 debconf 模板或 .desktop 檔案。

source: To address this problem, the only interface changes needed are:
sv: För att lösa detta problem behövs endast följande gränssnittsändringar:
zh_hans: 要解决此问题，只需更改接口：
zh_hant: 要解決此問題，只需更改介面：

source: take a hash as po_in_name (a list per language)
sv: ta en hash som po_in_name (en lista per språk)
zh_hans: 将散列作为 po_in_name (每种语言的列表)
zh_hant: 將雜湊作為 po_in_name (每種語言的列表)

source: add an argument to translate to indicate the target language
sv: lägg till ett argument för översättning för att ange målspråket
zh_hans: 添加要翻译的参数以指示目标语言
zh_hant: 新增要翻譯的引數以指示目標語言

source: make a pushline_all function, which would make pushline of its content for all languages, using a map-like syntax:
sv: skapa en pushline_all-funktion, som skulle skapa en pushline av dess innehåll för alla språk, med hjälp av en kartliknande syntax:
zh_hans: 使用类似映射的语法创建一个 pushline_all 函数，该函数将为所有语言创建其内容的 pushline：
zh_hant: 使用類似對映的語法建立一個 pushline_all 函式，該函式將為所有語言建立其內容的 pushline：

source: Will see if it's enough ;)
sv: Vi får se om det räcker ;)
zh_hans: 看看是否足够 ;)
zh_hant: 看看是否足夠 ;)

source: Locale::Po4a::VimHelp - convert Vim help files from/to PO files
sv: Locale::Po4a::VimHelp – konvertera Vim-hjälpfiler från/till PO-filer

source: C<Locale::Po4a::VimHelp> is a module to help the translation of Vim help file. See also L<Writing help files|https://vimhelp.org/helphelp.txt.html#help-writing> for its syntax.
sv: C<Locale::Po4a::VimHelp> är ett modul som hjälper till med översättningen av Vims hjälpfiler. Se även L<Skriva hjälpfiler|https://vimhelp.org/helphelp.txt.html#help-writing> för dess syntax.

source: This module is in an early stage of development. It has been successfully tested on simple files like C<helphelp.txt>. However, it has not yet been tested on full help files, and the way it parses them may change for fixes and improvements, especially paragraph wrapping.
sv: Denna modul befinner sig i ett tidigt utvecklingsstadium. Den har testats med framgång på enkla filer som C<helphelp.txt>. Den har dock ännu inte testats på fullständiga hjälpfiler, och sättet den analyserar dem på kan komma att ändras för att åtgärda fel och förbättra funktionen, särskilt vad gäller radbrytning.

source: DEVELOPING
sv: UTVECKLING

source: Parsing Vim help files for po4a is difficult. Here are some obstacles while developing this module. If you have a better idea, feel free to suggest a patch (with additional test cases).
sv: Det är svårt att analysera Vim-hjälpfiler för po4a. Här är några hinder som uppstod under utvecklingen av denna modul. Om du har en bättre idé är du välkommen att föreslå en patch (med ytterligare testfall).

source: C<1. foo> sounds like an ordered list
sv: C<1. foo> låter som en ordnad lista

source: Not necessarily. Consider the following paragraph:
sv: Inte nödvändigtvis. Tänk på följande stycke:

source: There are 2 wandering tanukis, not 1. He's using his cloning technique.
sv: Det finns två vandrande tanukis, inte 1. Han använder sin kloningsteknik.

source: For the same reason, what appears to be a heading (e.g. C<1.1 bar>) or an unordered list (e.g. C<o baz>) cannot be detected.
sv: Av samma anledning kan det som ser ut som en rubrik (t.ex. C<1.1 bar>) eller en osorterad lista (t.ex. C<o baz>) inte upptäckas.

source: Flushed right tags should be excluded from translation target
sv: Röda taggar ska uteslutas från översättningsmålet

source: This topic is also difficult since it relates to language differences in localization.
sv: Detta ämne är också svårt eftersom det rör språkskillnader i lokalisering.

source: Consider the following example
sv: Tänk på följande exempel

source: Such a common and short concept in some languages *tags*
sv: Ett så vanligt och kort begrepp i vissa språk *taggar*

source: which might be translated to
sv: vilket kan översättas till

source: They are unfamiliar, there are no corresponding concepts and *tags* it takes a longer sentence to express them in this language
sv: De är okända, det finns inga motsvarande begrepp och *taggar* och det krävs en längre mening för att uttrycka dem på detta språk

source: When this happens, you have to decide at what point you want to add a tag I<nicely>. This shouldn't be easy. The Vim help file is in a hard wrapped format, even for parts that are not code blocks.
sv: När detta händer måste du bestämma vid vilken punkt du vill lägga till en tagg I<nicely>. Detta bör inte vara enkelt. Vim-hjälpfilen har ett format med fast radbrytning, även för delar som inte är kodblock.

source: The same applies to tag references such as C<|ref|>.
sv: Detsamma gäller taggreferenser som C<|ref|>.

source: Leveraging C<--wrapcol> to monitor text widths
sv: Utnyttja C-<--wrapcol> för att övervaka textbredder

source: Using the C<--wrapcol> option to issue warnings when text width exceeds specified limits seems like a reasonable approach. The official Vim help files feature a mode line, such as C<vim:tw=78:ts=8:noet:ft=help:norl:>, as seen in L<C<runtime/doc/if_perl.txt>|https://github.com/vim/vim/blob/04cc8975930b7b2c5d6753d3eddf57dab2816518/runtime/doc/if_perl.txt#L307>. However, there are a few challenges to consider:
sv: Att använda flaggan C<--wrapcol> för att utfärda varningar när textbredden överskrider angivna gränser verkar vara en rimlig metod. De officiella hjälpfilerna för Vim har en lägesrad, till exempel C<vim:tw=78:ts=8:noet:ft=help:norl:>, som visas i L<C<runtime/doc/if_perl.txt>|https://github.com/vim/vim/blob/04cc8975930b7b2c5d6753d3eddf57dab2816518/runtime/doc/if_perl.txt#L307>. Det finns dock några utmaningar att ta hänsyn till:

source: File Parsing Behavior
sv: Filparsningsbeteende

source: If this option is implemented, it would be ideal to read the entire file first, detect whether the mode line exists, and determine which sections are affected. Unfortunately, the progressive parsing mechanism is not employed in this case.
sv: Om denna flagga implementeras skulle det vara idealiskt att först läsa hela filen, upptäcka om lägesraden finns och avgöra vilka avsnitt som påverkas. Tyvärr används inte den progressiva tolkningsmekanismen i detta fall.

source: Default vs. Custom Values
sv: Standardvärden kontra anpassade värden

source: The generic default value of C<--wrapcol> is 76, whereas Vim help files commonly use 78. In most cases, the value in the options passed to this module defaults to 76, but it is unclear whether this value was explicitly set or implicitly applied.
sv: Det generiska standardvärdet för C-<--wrapcol> en är 76, medan Vim-hjälpfiler vanligtvis använder 78. I de flesta fall är värdet i de flaggor som skickas till denna modul standardinställt till 76, men det är oklart om detta värde har ställts in explicit eller tillämpats implicit.

source: Locale::Po4a::Wml - convert WML (web markup language) documents from/to PO files
sv: Locale::Po4a::Wml - konvertera WML-dokument (web markup language) från/till PO-filer
zh_hans: Locale::Po4a::Wml - 将 WML (web 标记语言)文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Wml - 將 WML (web 標記語言)文件從/轉換為 PO 檔案

source: Locale::Po4a::Wml is a module to help the translation of WML documents into other [human] languages. Do not mixup the WML we are speaking about here (web markup language) and the WAP crap used on cell phones.
sv: Locale::Po4a::Wml är ett modul som hjälper till att översätta WML-dokument till andra [mänskliga] språk. Blanda inte ihop det WML vi talar om här (web markup language) med det WAP-skräp som används på mobiltelefoner.
zh_hans: Locale::Po4a::Wml 是一个帮助将 WML 文档翻译成其他 [人类] 语言的模块。不要把我们在这里谈论的 WML (网络标记语言) 和手机上使用的 WAP 垃圾混为一谈。
zh_hant: Locale::Po4a::Wml 是一個幫助將 WML 文件翻譯成其他 [人類] 語言的模組。不要把我們在這裡談論的 WML (網路標記語言) 和手機上使用的 WAP 垃圾混為一談。

source: Please note that this module relies upon the Locale::Po4a::Xhtml module, which also relies upon the Locale::Po4a::Xml module. This means that all tags for web page expressions are assumed to be written in the XHTML syntax.
sv: Observera att detta modul är beroende av modulen Locale::Po4a::Xhtml, som i sin tur är beroende av modulen Locale::Po4a::Xml. Detta innebär att alla taggar för webbsidesuttryck antas vara skrivna i XHTML-syntax.
zh_hans: 请注意，此模块依赖于 Locale::Po4a::Xhtml 模块，该模块也依赖于 Locale::Po4a::Xml 模块。这意味着网页表达式的所有标记都假定是用 XHTML 语法编写的。
zh_hant: 請注意，此模組依賴於 Locale::Po4a::Xhtml 模組，該模組也依賴於 Locale::Po4a::Xml 模組。這意味著網頁表示式的所有標記都假定是用 XHTML 語法編寫的。

source: This module works for some simple documents, but is still young. Currently, the biggest issue of the module is probably that it cannot handle documents that contain non-XML inline tags such as <email "foo@example.org">, which are often defined in the WML. Improvements will be added in the future releases.
sv: Denna modul fungerar för vissa enkla dokument, men är fortfarande i sin linda. För närvarande är modulens största problem troligen att den inte kan hantera dokument som innehåller icke-XML-inline-taggar såsom <email "foo@example.org">, som ofta definieras i WML. Förbättringar kommer att läggas till i framtida versioner.
zh_hans: 此模块适用于一些简单的文档，但还很年轻。目前，该模块最大的问题可能是它不能处理包含非 XML 内联标记的文档，例如通常在 WML中定义的 <email "foo@example.org">。在将来的版本中将添加改进。
zh_hant: 此模組適用於一些簡單的文件，但還很年輕。目前，該模組最大的問題可能是它不能處理包含非 XML 內聯標記的文件，例如通常在 WML中定義的 <email "foo@example.org">。在將來的版本中將新增改進。

source: Locale::Po4a::Xhtml - convert XHTML documents from/to PO files
sv: Locale::Po4a::Xhtml - konvertera XHTML-dokument från/till PO-filer
zh_hans: Locale::Po4a::Xhtml - 将 XHTML 文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Xhtml - 將 XHTML 文件從/轉換為 PO 檔案

source: Locale::Po4a::Xhtml is a module to help the translation of XHTML documents into other [human] languages.
sv: Locale::Po4a::Xhtml är ett modul som hjälper till att översätta XHTML-dokument till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Xhtml 是一个帮助将 XHTML 文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Xhtml 是一個幫助將 XHTML 文件翻譯成其他 [人類] 語言的模組。

source: Include files specified by an include SSI (Server Side Includes) element (e.g. <!--#include virtual="/foo/bar.html" -->).
sv: Inkludera filer som anges av ett inkluderingselement SSI (Server Side Includes) (t.ex. <!--#include virtual="/foo/bar.html" -->).
zh_hans: 包括由 include SSI (服务器端包含) 元素指定文件(例如，<!--#include virtual="/foo/bar.html" -->)。
zh_hant: 包括由 include SSI (伺服器端包含) 元素指定檔案(例如，<!--#include virtual="/foo/bar.html" -->)。

source: B<Note:> You should use it only for static files.
sv: B-<Observera:> Du bör endast använda det för statiska filer.
zh_hans: B<Note:> 您应该只对静态文件使用它。
zh_hant: B<Note:> 您應該只對靜態檔案使用它。

source: An additional I<rootpath> parameter can be specified. It specifies the root path to find files included by a B<virtual> attribute.
sv: En ytterligare I-<rootpath> -parameter kan anges. Den anger rotvägen för att hitta filer som ingår i ett B-<virtual> -attribut.
zh_hans: 可以指定一个附加的 I<rootpath> 参数。它指定查找 B<virtual> 属性包含的文件的根路径。
zh_hant: 可以指定一個附加的 I<rootpath> 引數。它指定查詢 B<virtual> 屬性包含的檔案的根路徑。

source: "It works for me", which means I use it successfully on my personal Web site. However, YMMV: please let me know if something doesn't work for you.
sv: "Det fungerar för mig", vilket betyder att jag använder det framgångsrikt på min personliga webbplats. Men YMMV: vänligen meddela mig om något inte fungerar för dig.

source: Locale::Po4a::Xml - convert XML documents and derivates from/to PO files
sv: Locale::Po4a::Xml - konvertera XML-dokument och derivat från/till PO-filer
zh_hans: Locale::Po4a::Xml - 将 XML 文档和衍生内容从/转换为 PO 文件
zh_hant: Locale::Po4a::Xml - 將 XML 文件和衍生內容從/轉換為 PO 檔案

source: Locale::Po4a::Xml is a module to help the translation of XML documents into other [human] languages. It can also be used as a base to build modules for XML-based documents.
sv: Locale::Po4a::Xml är ett modul som hjälper till att översätta XML-dokument till andra [mänskliga] språk. Det kan också användas som bas för att bygga moduler för XML-baserade dokument.
zh_hans: Locale::Po4a::Xml 是一个帮助将 XML 文档翻译成其他 [人类] 语言的模块。它还可以用作为基于 XML 的文档构建模块的基础。
zh_hant: Locale::Po4a::Xml 是一個幫助將 XML 文件翻譯成其他 [人類] 語言的模組。它還可以用作為基於 XML 的文件構建模組的基礎。

source: TRANSLATING WITH PO4A::XML
sv: ÖVERSÄTTNING MED PO4A::XML
zh_hans: 使用 PO4A::XML 进行转换
zh_hant: 使用 PO4A::XML 進行轉換

source: This module can be used directly to handle generic XML documents. This will extract all tag's content, and no attributes, since it's where the text is written in most XML based documents.
sv: Denna modul kan användas direkt för att hantera generiska XML-dokument. Detta extraherar allt tagginnehåll, men inga attribut, eftersom det är där texten skrivs i de flesta XML-baserade dokument.
zh_hans: 此模块可直接用于处理通用 XML 文档。这将提取所有标记的内容，而不提取属性，因为它是大多数基于 XML 的文档中的文本写入位置。
zh_hant: 此模組可直接用於處理通用 XML 文件。這將提取所有標記的內容，而不提取屬性，因為它是大多數基於 XML 的文件中的文字寫入位置。
