Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: If the POT file already exists, it is regenerated if a master document or the configuration file is more recent (unless B<--no-update> is provided). The POT file is also written in a temporary document and B<po4a> verifies that the changes are really needed.
sv: Om POT-filen redan finns, regenereras den om ett huvuddokument eller konfigurationsfilen är nyare (om inte B<--no-update> anges). POT-filen skrivs också till ett tillfälligt dokument och B<po4a> verifierar att ändringarna verkligen behövs.
zh_hans: 如果 POT 文件已经存在，则如果主文档或配置文件较新(除非提供了 B<--no-update>)，则会重新生成该文件。POT 文件也写入临时文档中，B<po4a> 验证是否确实需要更改。
zh_hant: 如果 POT 檔案已經存在，則如果主文件或配置檔案較新(除非提供了 B<--no-update>)，則會重新生成該檔案。POT 檔案也寫入臨時文件中，B<po4a> 驗證是否確實需要更改。

source: Also, a translation is regenerated only if its master document, the PO file, one of its addenda or the configuration file is more recent. To avoid trying to regenerate translations which do not pass the threshold test (see B<--keep>), a file with the F<.po4a-stamp> extension can be created (see B<--stamp>).
sv: Dessutom regenereras en översättning endast om dess huvuddokument, PO-filen, ett av dess tillägg eller konfigurationsfilen är nyare. För att undvika att försöka regenerera översättningar som inte klarar tröskeltestet (se B<--keep>) kan en fil med filändelsen F<.po4a-stamp> skapas (se B<--stamp>).
zh_hans: 此外，只有当翻译的主文档、PO 文件、其中一个附录或配置文件更新时，才会重新生成翻译。要避免尝试重新生成未通过阈值测试的翻译(请参见 B<--KEEP>)，可以创建扩展名为 F<.po4a-stamp> 的文件(请参见 B<--STAMP>)。
zh_hant: 此外，只有當翻譯的主文件、PO 檔案、其中一個附錄或配置檔案更新時，才會重新生成翻譯。要避免嘗試重新生成未透過閾值測試的翻譯(請參見 B<--KEEP>)，可以建立擴充套件名為 F<.po4a-stamp> 的檔案(請參見 B<--STAMP>)。

source: If a master document includes files, you should use the B<--force> flag because the modification time of these included files are not taken into account.
sv: Om ett huvuddokument innehåller filer bör du använda flaggan B-<--force>, eftersom ändringstidpunkten för dessa inkluderade filer inte beaktas.
zh_hans: 如果主文档包含文件，则应使用 B<--force> 标志，因为不会考虑这些包含文件的修改时间。
zh_hant: 如果主文件包含檔案，則應使用 B<--force> 標誌，因為不會考慮這些包含檔案的修改時間。

source: The PO files are always re-generated based on the POT with L<msgmerge(1)> with the B<-U> parameter.
sv: PO-filerna genereras alltid på nytt baserat på POT med L<msgmerge(1)> med parametern B<-U>.

source: Tells B<po4a> to create stamp files when a translation is not generated because it does not reach the threshold. These stamp files are named according to the expected translated document, with the F<.po4a-stamp> extension.
sv: Anger att B<po4a> ska skapa stämpel-filer när en översättning inte genereras eftersom den inte når tröskelvärdet. Dessa stämpel-filer namnges efter det förväntade översatta dokumentet, med filändelsen F<.po4a-stamp>.
zh_hans: 告诉 B<po4a> 在由于未达到阈值而未生成翻译时创建标记文件。这些戳记文件根据预期的翻译文档命名，扩展名为 F<.po4a stamp>。
zh_hant: 告訴 B<po4a> 在由於未達到閾值而未生成翻譯時建立標記檔案。這些戳記檔案根據預期的翻譯文件命名，副檔名為 F<.po4a stamp>。

source: Note: This only activates the creation of the F<.po4a-stamp> files. The stamp files are always used if they exist, and they are removed with B<--rm-translations> or when the file is finally translated.
sv: Obs! Detta aktiverar endast skapandet av F-<.po4a-stamp> -filerna. Stämpel-filerna används alltid om de finns, och de tas bort med B-<--rm-translations> eller när filen slutligen översätts.
zh_hans: 注意：这只会激活 F<.po4a stamp> 文件的创建。如果存在戳记文件，则始终使用它们，并使用 B<--rm translations> 或在最终翻译文件时删除它们。
zh_hant: 注意：這隻會啟用 F<.po4a stamp> 檔案的建立。如果存在戳記檔案，則始終使用它們，並使用 B<--rm translations> 或在最終翻譯檔案時刪除它們。

source: Do not generate the translated documents, only update the POT and PO files.
sv: Skapa inte de översatta dokumenten, uppdatera endast POT- och PO-filerna.
zh_hans: 不生成翻译的文档，只更新 POT 和 PO 文件。
zh_hant: 不生成翻譯的文件，只更新 POT 和 PO 檔案。

source: Do not change the POT and PO files, only the translation may be updated.
sv: Ändra inte POT- och PO-filerna, endast översättningen får uppdateras.
zh_hans: 不要更改 POT 和 PO 文件，只能更新翻译。
zh_hant: 不要更改 POT 和 PO 檔案，只能更新翻譯。

source: Keeps the existing translation files even if the translation doesn't meet the threshold specified by B<--keep>. This option does not create new translation files with few content, but it will save existing translations which decay because of changes to the master files.
sv: Behåller befintliga översättningsfiler även om översättningen inte uppfyller tröskelvärdet som anges av B<--keep>. Den här flaggan skapar inte nya översättningsfiler med lite innehåll, men det sparar befintliga översättningar som försämras på grund av ändringar i huvudfilerna.
zh_hans: 即使翻译不符合 B<--keep> 指定的阈值，也保留现有翻译文件。此选项不会创建内容很少的新翻译文件，但会保存由于主文件更改而衰减的现有翻译。
zh_hant: 即使翻譯不符合 B<--keep> 指定的閾值，也保留現有翻譯檔案。此選項不會建立內容很少的新翻譯檔案，但會儲存由於主檔案更改而衰減的現有翻譯。

source: WARNING: This flag changes the po4a behavior in a rather drastic way: your translated files will not get updated at all until the translation improves. Only use this flag if you prefer shipping an outdated translated documentation rather than only shipping an accurate untranslated documentation.
sv: VARNING: Denna flagga ändrar po4a-beteendet på ett ganska drastiskt sätt: dina översatta filer kommer inte att uppdateras alls förrän översättningen förbättras. Använd endast denna flagga om du föredrar att leverera en föråldrad översatt dokumentation framför att leverera en korrekt oöversatt dokumentation.
zh_hans: 警告：此标志以一种相当剧烈的方式更改 po4a 行为：在翻译改进之前，您的翻译文件根本不会更新。仅当您希望传送过时的翻译文档而不是只传送准确的未翻译文档时，才使用此标志。
zh_hant: 警告：此標誌以一種相當劇烈的方式更改 po4a 行為：在翻譯改進之前，您的翻譯檔案根本不會更新。僅當您希望傳送過時的翻譯文件而不是隻傳送準確的未翻譯文件時，才使用此標誌。

source: Remove the translated files (implies B<--no-translations>).
sv: Ta bort de översatta filerna (innebär B-<--no-translations>).
zh_hans: 删除翻译的文件（意味着 B<--no translations>）。
zh_hant: 刪除翻譯的檔案（意味著 B<--no translations>）。

source: This flag does nothing since 0.41, and may be removed in later releases.
sv: Denna flagga har ingen funktion sedan version 0.41 och kan komma att tas bort i senare versioner.
zh_hans: 此标志自 0.41 起不起作用，可能会在以后的版本中删除。
zh_hant: 此標誌自 0.41 起不起作用，可能會在以後的版本中刪除。

source: Translate only the specified file. It may be useful to speed up processing if a configuration file contains a lot of files. Note that this option does not update PO and POT files. This option can be used multiple times.
sv: Översätt endast den angivna filen. Det kan vara användbart för att påskynda bearbetningen om en konfigurationsfil innehåller många filer. Observera att denna flagga inte uppdaterar PO- och POT-filer. Denna flagga kan användas flera gånger.
zh_hans: 只翻译指定的文件。如果配置文件包含大量文件，则加快处理速度可能会很有用。请注意，此选项不更新 PO 和 POT 文件。此选项可以多次使用。
zh_hant: 只翻譯指定的檔案。如果配置檔案包含大量檔案，則加快處理速度可能會很有用。請注意，此選項不更新 PO 和 POT 檔案。此選項可以多次使用。

source: Define a variable that will be expanded in the B<po4a> configuration file. Every occurrence of I<$(var)> will be replaced by I<value>. This option can be used multiple times.
sv: Definiera en variabel som kommer att expanderas i konfigurationsfilen B-<po4a>. Varje förekomst av I<$(var)> kommer att ersättas med I<value>. Denna option kan användas flera gånger.
zh_hans: 定义将在 B<po4a> 配置文件中展开的变量。每次出现 I<$(var)> 都将被 I<value> 替换。此选项可以多次使用。
zh_hant: 定義將在 B<po4a> 配置檔案中展開的變數。每次出現 I<$(var)> 都將被 I<value> 替換。此選項可以多次使用。

source: Update PO files and generate translated documents only for the specified language. This option can be used multiple times.
sv: Uppdatera PO-filer och generera översatta dokument endast för det angivna språket. Den här flaggan kan användas flera gånger.

source: Set the base directory for all input documents specified in the B<po4a> configuration file.
sv: Ställ in baskatalogen för alla indata-dokument som anges i konfigurationsfilen B<po4a>.
zh_hans: 为 B<po4a> 配置文件中指定的所有输入文档设置基本目录。
zh_hant: 為 B<po4a> 配置檔案中指定的所有輸入文件設定基本目錄。

source: If both I<destdir> and I<srcdir> are specified, input files are searched in the following directories, in order: I<destdir>, the current directory and I<srcdir>. Output files are written to I<destdir> if specified, or to the current directory.
sv: Om både I<destdir> och I<srcdir> anges, söks efter inmatningsfiler i följande kataloger, i ordning: I<destdir>, den aktuella katalogen och I<srcdir>. Utmatningsfiler skrivs till I<destdir> om det anges, eller till den aktuella katalogen.
zh_hans: 如果同时指定了 I<destdir> 和 I<srcdir>，则按顺序在以下目录中搜索输入文件：I<destdir>、当前目录和 I<srcdir>。如果指定，输出文件将写入 I<destdir> 或当前目录。
zh_hant: 如果同時指定了 I<destdir> 和 I<srcdir>，則按順序在以下目錄中搜索輸入檔案：I<destdir>、當前目錄和 I<srcdir>。如果指定，輸出檔案將寫入 I<destdir> 或當前目錄。

source: Set the base directory for all the output documents specified in the B<po4a> configuration file (see B<--srcdir> above).
sv: Ställ in baskatalogen för alla utdatadokument som anges i konfigurationsfilen B<po4a> (se B<--srcdir> ovan).
zh_hans: 为 B<po4a> 配置文件中指定的所有输出文档设置基本目录（请参见上面的 B<--srcdir>）。
zh_hant: 為 B<po4a> 配置檔案中指定的所有輸出文件設定基本目錄（請參見上面的 B<--srcdir>）。

source: Options modifying the POT header
sv: Flaggor som modifierar POT-rubriken
zh_hans: 选项修改 POT 头
zh_hant: 選項修改 POT 頭

source: Specify the reference format. Argument I<type> can be one of B<never> to not produce any reference, B<file> to only specify the file without the line number, B<counter> to replace line number by an increasing counter, and B<full> to include complete references (default: full).
sv: Ange referensformatet. Argumentet I<type> kan vara B<never> för att inte skapa någon referens, B<file> för att endast ange filen utan radnummer, B<counter> för att ersätta radnumret med en ökande räknare och B<full> för att inkludera fullständiga referenser (standard: full).
zh_hans: 指定引用格式。参数 I<type> 可以是以下值之一：B<never> 不生成任何引用；B<file> 只指定不带行号的文件；B<counter> 用递增的计数器替换行号；B<full> 包含完整引用（默认值：full）。
zh_hant: 指定引用格式。引數 I<type> 可以是以下值之一：B<never> 不生成任何引用；B<file> 只指定不帶行號的檔案；B<counter> 用遞增的計數器替換行號；B<full> 包含完整引用（預設值：full）。

source: B<--wrap-po> B<no>|B<newlines>|I<number> (default: 76)
sv: B<--wrap-po> B<no>|B<newlines>|I<number> (standard: 76)

source: Specify how the po file should be wrapped. This gives the choice between either files that are nicely wrapped but could lead to git conflicts, or files that are easier to handle automatically, but harder to read for humans.
sv: Ange hur po-filen ska formateras. Detta ger valet mellan antingen filer som är snyggt formaterade men som kan leda till git-konflikter, eller filer som är lättare att hantera automatiskt, men svårare att läsa för människor.
zh_hans: 指定应如何封装 po 文件。这使我们可以选择封装良好但可能导致 git 冲突的文件，或者更容易自动处理但对人类来说更难读取的文件。
zh_hant: 指定應如何封裝 po 檔案。這使我們可以選擇封裝良好但可能導致 git 衝突的檔案，或者更容易自動處理但對人類來說更難讀取的檔案。

source: Historically, the gettext suite has reformatted the po files at the 77th column for cosmetics. This option specifies the behavior of po4a. If set to a numerical value, po4a will wrap the po file after this column and after newlines in the content. If set to B<newlines>, po4a will only split the msgid and msgstr after newlines in the content. If set to B<no>, po4a will not wrap the po file at all. The reference comments are always wrapped by the gettext tools that we use internally.
sv: Historiskt sett har gettext-paketet omformaterat po-filerna vid den 77:e kolumnen av kosmetiska skäl. Denna flagga anger po4a:s beteende. Om det är inställt på ett numeriskt värde kommer po4a att bryta po-filen efter denna kolumn och efter radbrytningar i innehållet. Om det är inställt på B<newlines> kommer po4a endast att dela upp msgid och msgstr efter radbrytningar i innehållet. Om det är inställt på B<no> kommer po4a inte att bryta po-filen alls. Referenskommmentarerna bryts alltid av de gettext-verktyg som vi använder internt.
zh_hans: 从历史上看，gettext 套件已经重新格式化了第 77 列化妆品的 po 文件。此选项指定 po4a 的行为。如果设置为数值，po4a 将在内容中的此列和换行之后封装 po 文件。如果设置为 B<newlines>，po4a 将只在内容中的新行之后拆分 msgid 和 msgstr。如果设置为 B<no>，则 po4a 根本不会封装 po 文件。引用注释总是由我们在内部使用的 gettext 工具封装。
zh_hant: 從歷史上看，gettext 套件已經重新格式化了第 77 列化妝品的 po 檔案。此選項指定 po4a 的行為。如果設定為數值，po4a 將在內容中的此列和換行之後封裝 po 檔案。如果設定為 B<newlines>，po4a 將只在內容中的新行之後拆分 msgid 和 msgstr。如果設置為 B<no>，則 po4a 根本不會封裝 po 檔案。引用註釋總是由我們在內部使用的 gettext 工具封裝。

source: Based on the value of this option, appropriate flags (B<--no-wrap> or B<--width>=I<number>) will be passed to underlying gettext utilities. Unfortunately gettext doesn't provide any counterpart for B<--wrap-po> I<no>, so in that case B<--no-wrap> will be passed (the same as for B<--wrap-po> I<newlines>).
sv: Baserat på värdet för denna flagga kommer lämpliga flaggor (B<--no-wrap> eller B<--width>=I<number>) att skickas till underliggande gettext-verktyg. Tyvärr har gettext ingen motsvarighet till B<--wrap-po> I<no>, så i det fallet kommer B<--no-wrap> att skickas (samma som för B<--wrap-po> I<newlines>).

source: Note that this option has no impact on how the msgid and msgstr are wrapped, i.e. on how newlines are added to the content of these strings.
sv: Observera att denna flagga inte påverkar hur msgid och msgstr bryts, dvs. hur radbrytningar läggs till i innehållet i dessa strängar.
zh_hans: 请注意，此选项对 msgid 和 msgstr 的封装方式（即，将换行符添加到这些字符串的内容中）没有影响。
zh_hant: 請注意，此選項對 msgid 和 msgstr 的封裝方式（即，將換行符新增到這些字串的內容中）沒有影響。

source: Language of the source files containing the documents to translate. Note that all master documents must use the same language.
sv: Språket i källfilerna som innehåller dokumenten som ska översättas. Observera att alla originaldokument måste vara skrivna på samma språk.
zh_hans: 包含要翻译的文档的源文件的语言。 请注意，所有主文档必须使用相同的语言。
zh_hant: 包含要翻譯的文件的原始檔的語言。 請注意，所有主文件必須使用相同的語言。

source: Set the report address for msgid bugs. By default, the created POT files have no Report-Msgid-Bugs-To fields.
sv: Ställ in rapportadressen för msgid-buggar. Som standard har de skapade POT-filerna inga Report-Msgid-Bugs-To-fält.
zh_hans: 设置 msgid 错误的报告地址。 默认情况下，创建的 POT 文件没有 Report-Msgid-Bugs-To 字段。
zh_hant: 設定 msgid 錯誤的報告地址。 預設情況下，建立的 POT 檔案沒有 Report-Msgid-Bugs-To 欄位。

source: Set the copyright holder in the POT header. The default value is "Free Software Foundation, Inc."
sv: Ange upphovsrättsinnehavaren i POT-rubriken. Standardvärdet är "Free Software Foundation, Inc."
zh_hans: 在 POT 标头中设置版权所有者。 默认值为“自由软件基金会有限公司。”
zh_hant: 在 POT 標頭中設定版權所有者。 預設值為“自由軟體基金會有限公司。”

source: Set the package name for the POT header. The default is "PACKAGE".
sv: Ange paketnamnet för POT-rubriken. Standardvärdet är "PACKAGE".
zh_hans: 设置 POT 标头的程序包名称。 默认值为“封装”。
zh_hant: 設定 POT 標頭的程式包名稱。 預設值為“封裝”。

source: Set the package version for the POT header. The default is "VERSION".
sv: Ställ in paketversionen för POT-rubriken. Standardvärdet är "VERSION".
zh_hans: 设置 POT 标头的软件包版本。 默认值为“版本”。
zh_hant: 設定 POT 標頭的軟體包版本。 預設值為“版本”。

source: Options to modify the PO files
sv: Flaggor för att ändra PO-filerna
zh_hans: 修改 PO 文件的选项
zh_hant: 修改 PO 檔案的選項

source: Extra options for L<msgmerge(1)>.
sv: Extra flaggor för L<msgmerge(1)>.

source: Note: B<$lang> will be extended to the current language.
sv: Obs: B<$lang> kommer att utökas till det aktuella språket.
zh_hans: 注意： B<$lang> 将扩展为当前语言。
zh_hant: 注意： B<$lang> 將擴充套件為當前語言。

source: This option removes B<--previous> from the options passed to L<msgmerge(1)>. This is necessary to support versions of L<gettext(3)> earlier than 0.16.
sv: Den här flaggan tar bort B<--previous> från flaggorna som skickas till L<msgmerge(1)>. Det här är nödvändigt för att stödja versioner av L<gettext(3)> som är äldre än 0.16.

source: This option adds B<--previous> to the options passed to L<msgmerge(1)>. It requires L<gettext(3)> 0.16 or later, and is activated by default.
sv: Den här flaggan lägger till B<--previous> till flaggorna som skickas till L<msgmerge(1)>. Det kräver L<gettext(3)> 0.16 eller senare och är aktiverat som standard.

source: CONFIGURATION FILE
sv: KONFIGURATIONSFIL
zh_hans: 配置文件
zh_hant: 配置檔案

source: po4a expects a configuration file as argument. This file must contain the following elements:
sv: po4a förväntar sig en konfigurationsfil som argument. Denna fil måste innehålla följande element:
zh_hans: po4a 需要一个配置文件作为参数。此文件必须包含以下元素：
zh_hant: po4a 需要一個配置檔案作為引數。此檔案必須包含以下元素：

source: The path to the PO files and the list of languages existing in the project;
sv: Sökvägen till PO-filerna och listan över språk som finns i projektet;
zh_hans: PO 文件的路径和项目中存在的语言列表;
zh_hant: PO 檔案的路徑和專案中存在的語言列表;

source: Optionally, some global options and so-called configuration aliases that are used as templates to configure individual master files;
sv: Valfritt kan vissa globala flaggor och så kallade konfigurationsalias användas som mallar för att konfigurera enskilda huvudfiler;
zh_hans: 可选地，一些全局选项和所谓的配置别名，用作配置单个主文件的模板;
zh_hant: 可選地，一些全域性選項和所謂的配置別名，用作配置單個主檔案的模板;

source: The list of each master file to translate, along with specific parameters.
sv: Listan över varje huvudfil som ska översättas, tillsammans med specifika parametrar.
zh_hans: 要转换的每个主文件的列表以及特定参数。
zh_hant: 要轉換的每個主檔案的列表以及特定引數。

source: All lines contain a command between square braces, followed by its parameters. Comments begin with the char '#' and run until the end of the line. You can escape the end of line to spread a command over several lines.
sv: Alla rader innehåller ett kommando mellan hakparenteser, följt av dess parametrar. Kommentarer börjar med tecknet '#' och fortsätter till slutet av raden. Du kan undvika slutet av raden för att sprida ett kommando över flera rader.
zh_hans: 所有行在方括号之间都包含一个命令，后跟其参数。注释以字符 '#' 开头，并一直运行到行的末尾。您可以转义行尾，将命令分散到几行。
zh_hant: 所有行在方括號之間都包含一個命令，後跟其引數。註釋以字元 '#' 開頭，並一直執行到行的末尾。您可以轉義行尾，將命令分散到幾行。

source: Some full examples are presented on this page, while other examples can be found in the C<t/cfg> directory of the source distribution.
sv: Några fullständiga exempel presenteras på denna sida, medan andra exempel finns i katalogen C<t/cfg> i källkodsdistributionen.
zh_hans: 本页提供了一些完整的示例，而其他示例可以在源代码分发的 C<t/cfg> 目录中找到。
zh_hant: 本頁提供了一些完整的示例，而其他示例可以在原始碼分發的 C<t/cfg> 目錄中找到。

source: Finding the PO and POT files
sv: Hitta PO- och POT-filerna
zh_hans: 查找 PO 和 POT 文件
zh_hant: 查詢 PO 和 POT 檔案

source: The simplest solution is to explicitly give the path to POT and PO files, as follows:
sv: Den enklaste lösningen är att uttryckligen ange sökvägen till POT- och PO-filerna, enligt följande:
zh_hans: 最简单的解决方案是显式指定 POT 和 PO 文件的路径，如下所示：
zh_hant: 最簡單的解決方案是顯式指定 POT 和 PO 檔案的路徑，如下所示：

source: This specifies the path to the POT file first, and then the paths to the German and French PO files.
sv: Här anges först sökvägen till POT-filen och sedan sökvägarna till de tyska och franska PO-filerna.
zh_hans: 首先指定 POT 文件的路径，然后指定德语和法语 PO 文件的路径。
zh_hant: 首先指定 POT 檔案的路徑，然後指定德語和法語 PO 檔案的路徑。

source: The same information can be written as follows to reduce the risk of copy/paste errors:
sv: Samma information kan skrivas på följande sätt för att minska risken för kopierings-/klistringsfel:
zh_hans: 可以按如下方式写入相同的信息，以降低复制/粘贴错误的风险：
zh_hant: 可以按如下方式寫入相同的資訊，以降低複製/貼上錯誤的風險：

source: The C<$lang> component is automatically expanded using the provided languages list, reducing the risk of copy/paste error when a new language is added.
sv: Komponenten C<$lang> expanderas automatiskt med hjälp av den medföljande språklistan, vilket minskar risken för kopierings-/klistringsfel när ett nytt språk läggs till.
zh_hans: C<$lang> 组件使用提供的语言列表自动展开，减少了添加新语言时出现复制/粘贴错误的风险。
zh_hant: C<$lang> 元件使用提供的語言列表自動展開，減少了新增新語言時出現複製/貼上錯誤的風險。

source: You can further compact the same information by only providing the path to the directory containing your translation project, as follows.
sv: Du kan komprimera samma information ytterligare genom att endast ange sökvägen till katalogen som innehåller ditt översättningsprojekt, enligt följande.
zh_hans: 通过只提供包含翻译项目的目录的路径，您可以进一步压缩相同的信息，如下所示。
zh_hant: 透過只提供包含翻譯專案的目錄的路徑，您可以進一步壓縮相同的資訊，如下所示。

source: The provided directory must contain a set of PO files, each named F<XX.po> with C<XX> the ISO 639-1 of the language used in this file. The directory must also contain a single POT file, with the C<.pot> file extension. For the first run, this file can be empty but it must exist (po4a cannot guess the name to use before the extension).
sv: Den angivna katalogen måste innehålla en uppsättning PO-filer, var och en med namnet F<XX.po> där C<XX> är ISO 639-1-koden för det språk som används i filen. Katalogen måste också innehålla en enda POT-fil med filändelsen C<.pot>. Vid första körningen kan denna fil vara tom, men den måste finnas (po4a kan inte gissa namnet som ska användas före filändelsen).
zh_hans: 提供的目录必须包含一组 PO 文件，每个文件名为 F<XX.po>，C<XX> 为此文件中使用的语言的 ISO 639-1。该目录还必须包含单个 POT 文件，文件扩展名为 C<.pot>。在第一次运行时，该文件可以是空的，但必须存在(po4a 无法猜测要在扩展名之前使用的名称)。
zh_hant: 提供的目錄必須包含一組 PO 檔案，每個檔名為 F<XX.po>，C<XX> 為此檔案中使用的語言的 ISO 639-1。該目錄還必須包含單個 POT 檔案，副檔名為 C<.pot>。在第一次執行時，該檔案可以是空的，但必須存在(po4a 無法猜測要在副檔名之前使用的名稱)。

source: Note that you must choose only one between C<po_directory> and C<po4a_paths>. The first one (C<po_directory>) is more compact, further reduces the risk of copy/paste error, but forces you to use the expected project structure and file names. The second one (C<po4a_paths>), is more explicit, probably more readable, and advised when you setup your first project with po4a.
sv: Observera att du måste välja endast en av flaggorna C<po_directory> och C<po4a_paths>. Den första flaggan (C<po_directory>) är mer kompakt och minskar risken för kopierings-/klistringsfel, men tvingar dig att använda den förväntade projektstrukturen och filnamnen. Den andra (C<po4a_paths>) är mer explicit, förmodligen mer läsbar och rekommenderas när du konfigurerar ditt första projekt med po4a.
zh_hans: 请注意，您只能在 C<po_文件夹> 和 C<po4a_路径> 之间选择一个。第一个 (C<po_文件夹>) 更紧凑，进一步降低了复制/粘贴错误的风险，但强制您使用预期的项目结构和文件名。第二个 (C<po4a_路径>) 更明确，可能更具可读性，建议您在使用 po4a 设置第一个项目时使用。
zh_hant: 請注意，您只能在 C<po_資料夾> 和 C<po4a_路徑> 之間選擇一個。第一個 (C<po_檔案夾>) 更緊湊，進一步降低了複製/貼上錯誤的風險，但強制您使用預期的專案結構和文件名。第二個 (C<po4a_路徑>) 更明確，可能更具可讀性，建議您在使用 po4a 設定第一個專案時使用。

source: Centralized or split PO files?
sv: Centraliserade eller delade PO-filer?
zh_hans: 集中或拆分 PO 文件？
zh_hant: 集中或拆分 PO 檔案？

source: By default, po4a produces one single PO file per target language, containing the whole content of your translation project. As your project grows, the size of these files may become problematic. When using weblate, it is possible to specify priorities for each translation segment (i.e., msgid) so that the important ones get translated first. Still, some translation teams prefer to split the content in several files.
sv: Som standard skapar po4a en enda PO-fil per målspråk, som innehåller hela innehållet i ditt översättningsprojekt. När projektet växer kan storleken på dessa filer bli ett problem. När du använder weblate är det möjligt att ange prioriteringar för varje översättningssegment (dvs. msgid) så att de viktiga översätts först. Vissa översättningsteam föredrar ändå att dela upp innehållet i flera filer.
zh_hans: 默认情况下，po4a 为每种目标语言生成一个 PO 文件，其中包含翻译项目的全部内容。随着项目的增长，这些文件的大小可能会出现问题。使用 weblate 时，可以为每个翻译段（即 msgid）指定优先级，以便首先翻译重要的部分。尽管如此，一些翻译团队还是喜欢将内容分成几个文件。
zh_hant: 預設情況下，po4a 為每種目標語言生成一個 PO 檔案，其中包含翻譯專案的全部內容。隨著專案的增長，這些檔案的大小可能會出現問題。使用 weblate 時，可以為每個翻譯段（即 msgid）指定優先順序，以便首先翻譯重要的部分。儘管如此，一些翻譯團隊還是喜歡將內容分成幾個檔案。

source: To have one PO file per master file, you simply have to use the string C<$master> in the name of your PO files on the C<[po4a_paths]> line, as follows.
sv: För att ha en PO-fil per huvudfil behöver du bara använda strängen C<$master> i namnet på dina PO-filer på raden C<[po4a_paths]>, enligt följande.
zh_hans: 要在每个主文件中有一个 PO 文件，只需在 C<[po4a_paths]> 行上的 PO 文件名中使用字符串 C<$master>，如下所示。
zh_hant: 要在每個主檔案中有一個 PO 檔案，只需在 C<[po4a_paths]> 行上的 PO 檔名中使用字串 C<$master>，如下所示。
