Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: This describes in detail the parameters of a B<macro>; I<name> must be a valid macro name, and it ends with an underscore if the target must be translated.
sv: Här beskrivs i detalj parametrarna för en B-<macro>; I<name> måste vara ett giltigt makronamn och avslutas med ett understreck om målet måste översättas.
zh_hans: 这详细描述 B<macro> 的参数；I<name> 必须是有效的宏名称，如果必须翻译目标，则以下划线结束。
zh_hant: 這詳細描述 B<macro> 的引數；I<name> 必須是有效的宏名稱，如果必須翻譯目標，則以下劃線結束。

source: The I<attribute list> argument is a comma separated list which contains information about translatable arguments. This list contains either numbers, to define positional parameters, or named attributes.
sv: Argumentet i<attribute list> är en kommaseparerad lista som innehåller information om översättningsbara argument. Denna lista innehåller antingen siffror, för att definiera positionsparametrar, eller namngivna attribut.
zh_hans: I<attribute list> 参数是一个逗号分隔的列表，其中包含有关可翻译参数的信息。此列表包含用于定义位置参数的数字或命名属性。
zh_hant: I<attribute list> 引數是一個逗號分隔的列表，其中包含有關可翻譯引數的資訊。此列表包含用於定義位置引數的數字或命名屬性。

source: If a plus sign (B<+>) is prepended to I<name>, then the macro and its arguments are translated as a whole. There is no need to define attribute list in this case, but brackets must be present.
sv: Om ett plustecken (B<+>) placeras framför I<name>, översätts makrot och dess argument som en helhet. I detta fall behöver ingen attributlista definieras, men parenteser måste finnas med.
zh_hans: 如果 I<name> 前面加了一个加号 (B<+>)，则宏及其参数将作为一个整体进行转换。这种情况下不需要定义属性列表，但必须有方括号。
zh_hant: 如果 I<name> 前面加了一個加號 (B<+>)，則宏及其引數將作為一個整體進行轉換。這種情況下不需要定義屬性列表，但必須有方括號。

source: This describes in detail which attributes of a style must be translated.
sv: Här beskrivs i detalj vilka attribut i en stil som måste översättas.
zh_hans: 这详细描述了必须翻译样式的哪些属性。
zh_hant: 這詳細描述了必須翻譯樣式的哪些屬性。

source: The I<attribute list> argument is a comma separated list which contains information about translatable arguments. This list contains either numbers, to define positional parameters, or named attributes. The first attribute is the style name, it will not be translated.
sv: Argumentet i<attribute list> är en kommaseparerad lista som innehåller information om översättningsbara argument. Denna lista innehåller antingen siffror, för att definiera positionsparametrar, eller namngivna attribut. Det första attributet är stilnamnet, det kommer inte att översättas.
zh_hans: I<attribute list> 参数是一个逗号分隔的列表，其中包含有关可翻译参数的信息。此列表包含用于定义位置参数的数字或命名属性。第一个属性是样式名称，它不会被翻译。
zh_hant: I<attribute list> 引數是一個逗號分隔的列表，其中包含有關可翻譯引數的資訊。此列表包含用於定義位置引數的數字或命名屬性。第一個屬性是樣式名稱，它不會被翻譯。

source: If a plus sign (B<+>) is prepended to the style name, then the attribute list is translated as a whole. There is no need to define translatable attributes.
sv: Om ett plustecken (B<+>) placeras framför stilnamnet översätts attributlistan i sin helhet. Det finns inget behov av att definiera översättningsbara attribut.
zh_hans: 如果样式名称前面有加号 (B<+>)，则属性列表将作为整体进行转换。不需要定义可翻译属性。
zh_hant: 如果樣式名稱前面有加號 (B<+>)，則屬性列表將作為整體進行轉換。不需要定義可翻譯屬性。

source: If a minus sign (B<->) is prepended to the style name, then this attribute is not translated.
sv: Om ett minustecken (B<->) läggs till före stilnamnet, översätts inte detta attribut.
zh_hans: 如果样式名称前面有减号 (B<->)，则不会转换此属性。
zh_hant: 如果樣式名稱前面有減號 (B<->)，則不會轉換此屬性。

source: If a percent sign (B<%>) is appended to the style name, then the style is processed as verbatim. The lines in paragraph or block of such style are preserved in the po files and the corresponding entries are marked as no-wrap.
sv: Om ett procenttecken (B<%>) läggs till stilnamnet behandlas stilen som ordagrant. Raderna i stycket eller blocket med sådan stil bevaras i po-filerna och motsvarande poster markeras som no-wrap.

source: This declares an attribute entry as being translatable. By default, they are not translated.
sv: Detta deklarerar en attributpost som översättningsbar. Som standard översätts de inte.
zh_hans: 这将属性条目声明为可翻译。默认情况下，它们不会被翻译。
zh_hant: 這將屬性條目宣告為可翻譯。預設情況下，它們不會被翻譯。

source: STATUS OF THIS MODULE
sv: STATUS FÖR DENNA MODUL
zh_hans: 此模块的状态
zh_hant: 此模組的狀態

source: Tested successfully on simple AsciiDoc files.
sv: Testat med framgång på enkla AsciiDoc-filer.
zh_hans: 在简单的 AsciiDoc 文件上测试成功。
zh_hant: 在簡單的 AsciiDoc 檔案上測試成功。

source: Locale::Po4a::BibTeX - convert BibTeX documents from/to PO files
sv: Locale::Po4a::BibTeX - konvertera BibTeX-dokument från/till PO-filer
zh_hans: Locale::Po4a::BibTeX - 将 BibTeX 文档从/转换为 PO 文件
zh_hant: Locale::Po4a::BibTeX - 將 BibTeX 文件從/轉換為 PO 檔案

source: Locale::Po4a::BibTeX is a module to help the translation of bibliographies in the BibTeX format into other [human] languages.
sv: Locale::Po4a::BibTeX är ett modul som hjälper till att översätta bibliografier i BibTeX-format till andra [mänskliga] språk.
zh_hans: Locale::Po4a::BibTeX 是一个帮助将 BibTeX 格式的书目翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::BibTeX 是一個幫助將 BibTeX 格式的書目翻譯成其他 [人類] 語言的模塊。

source: Fields values are extracted and proposed for translation.
sv: Fältvärden extraheras och föreslås för översättning.
zh_hans: 提取字段值并建议进行翻译。
zh_hant: 提取欄位值並建議進行翻譯。

source: NONE.
sv: INGEN.
zh_hans: 没有。
zh_hant: 沒有。

source: It is a very simple module, but still young.
sv: Det är en mycket enkel modul, men fortfarande ung.
zh_hans: 这是一个非常简单的模块，但还很年轻。
zh_hant: 這是一個非常簡單的模組，但還很年輕。

source: Locale::Po4a::Chooser - manage po4a modules
sv: Locale::Po4a::Chooser – hantera po4a-moduler
zh_hans: Locale::Po4a::Chooser - 管理 po4a 模块
zh_hant: Locale::Po4a::Chooser - 管理 po4a 模組

source: Locale::Po4a::Chooser is a module to manage po4a modules. Previously, all po4a binaries used to know all po4a modules (pod, man, sgml, etc). This made the addition of a new module boring, because you had to make sure that the documentation is synchronized in all modules, and that each of them can access the new module.
sv: Locale::Po4a::Chooser är ett modul för att hantera po4a-moduler. Tidigare kände alla po4a-binärer till alla po4a-moduler (pod, man, sgml, etc.). Detta gjorde det tråkigt att lägga till en ny modul, eftersom man var tvungen att se till att dokumentationen var synkroniserad i alla moduler och att var och en av dem kunde komma åt den nya modulen.
zh_hans: Locale::Po4a::Chooser 是一个管理 po4a 模块的模块。以前，所有的 po4a 二进制文件都知道所有的 po4a 模块(pod、man、sgml 等)。这使得添加新模块变得枯燥乏味，因为您必须确保文档在所有模块中都是同步的，并且每个模块都可以访问新模块。
zh_hant: Locale::Po4a::Chooser 是一個管理 po4a 模組的模組。以前，所有的 po4a 二進位制文件都知道所有的 po4a 模組(pod、man、sgml 等)。這使得新增新模組變得枯燥乏味，因為您必須確保文件在所有模組中都是同步的，並且每個模組都可以訪問新模組。

source: Now, you just have to call the Locale::Po4a::Chooser::new() function, passing the name of module as argument.
sv: Nu behöver du bara anropa funktionen Locale::Po4a::Chooser::new() och ange modulens namn som argument.
zh_hans: 现在，您只需调用 Locale::Po4a::Chooser::new() 函数，将模块名称作为参数传递。
zh_hant: 現在，您只需呼叫 Locale::Po4a::Chooser::new() 函式，將模組名稱作為引數傳遞。

source: The function Locale::Po4a::Chooser::list() lists the available formats, and exits with the value passed as argument. So, we call Locale::Po4a::Chooser::list(0) when requested for the list of formats, and Locale::Po4a::Chooser::list(1) when passed an invalid format name.
sv: Funktionen Locale::Po4a::Chooser::list() listar tillgängliga format och avslutas med det värde som skickats som argument. Så vi anropar Locale::Po4a::Chooser::list(0) när vi begär en lista över format, och Locale::Po4a::Chooser::list(1) när ett ogiltigt formatnamn skickas.
zh_hans: 函数 Locale::Po4a::Chooser::list() 列出了可用的格式，并以作为参数传递的值退出。因此，当请求格式列表时，我们调用 Locale::Po4a::Chooser::list(0)，当传递无效的格式名称时，调用Locale::Po4a::Chooser::list(1) 。
zh_hant: 函式 Locale::Po4a::Chooser::list() 列出了可用的格式，並以作為引數傳遞的值退出。因此，當請求格式列表時，我們呼叫 Locale::Po4a::Chooser::list(0)，當傳遞無效的格式名稱時，呼叫Locale::Po4a::Chooser::list(1) 。

source: About po4a:
sv: Om po4a:
zh_hans: 关于 po4a：
zh_hant: 關於 po4a：

source: About modules:
sv: Om moduler:
zh_hans: 关于模块：
zh_hant: 關於模組：

source: L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Gemtext(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::Org(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::SimplePod(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::VimHelp(3pm)>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Xml(3pm)>, L<Locale::Po4a::Yaml(3pm)>.
sv: L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Gemtext(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::Org(15:00)>, L<Locale::Po4a::Pod(15:00)>, L<Locale::Po4a::RubyDoc(15:00)>, L<Locale::Po4a::Sgml(15:00)>, L<Locale::Po4a::SimplePod(15:00)>, L<Locale::Po4a::TeX(15:00)>, L<Locale::Po4a::Texinfo(15:00)>, L<Locale::Po4a::Text(15:00)>, L<Locale::Po4a::VimHelp(3pm)>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Xml(3pm)>, L<Locale::Po4a::Yaml(3pm)>.

source: Locale::Po4a::Common - common parts of the po4a scripts and utils
sv: Locale::Po4a::Common - gemensamma delar av po4a-skripten och verktygen
zh_hans: Locale::Po4a::Common - po4a 脚本和实用程序的通用部分
zh_hant: Locale::Po4a::Common - po4a 指令碼和實用程式的通用部分

source: Locale::Po4a::Common contains common parts of the po4a scripts and some useful functions used along the other modules.
sv: Locale::Po4a::Common innehåller gemensamma delar av po4a-skripten och några användbara funktioner som används tillsammans med de andra modulerna.
zh_hans: Locale::Po4a::Common 包含 po4a 脚本的公共部分和其他模块使用的一些有用函数。
zh_hant: Locale::Po4a::Common 包含 po4a 指令碼的公共部分和其他模組使用的一些有用函式。

source: If needed, you can disable the use of Text::WrapI18N as such:
sv: Om det behövs kan du inaktivera användningen av Text::WrapI18N på följande sätt:
zh_hans: 如果需要，您可以禁用 Text::WrapI18N，如下所示：
zh_hant: 如果需要，您可以禁用 Text::WrapI18N，如下所示：

source: instead of:
sv: istället för:
zh_hans: 而不是：
zh_hant: 而不是：

source: The ordering is important here: as most Locale::Po4a modules load themselves Locale::Po4a::Common, the first time this module is loaded determines whether Text::WrapI18N is used.
sv: Ordningen är viktig här: eftersom de flesta Locale::Po4a-moduler laddar Locale::Po4a::Common, avgör den första gången denna modul laddas om Text::WrapI18N används.
zh_hans: 这里的顺序很重要：因为大多数 Locale::Po4a 模块都会自行加载 Locale::Po4a::Common，所以第一次加载此模块将确定是否使用 Text::WrapI18N。
zh_hant: 這裡的順序很重要：因為大多數 Locale::Po4a 模組都會自行載入 Locale::Po4a::Common，所以第一次載入此模組將確定是否使用 Text::WrapI18N。

source: FUNCTIONS
sv: FUNKTIONER
zh_hans: 功能
zh_hant: 功能

source: Showing output messages
sv: Visa utdatameddelanden
zh_hans: 显示输出消息
zh_hant: 顯示輸出訊息

source: show_version($)
sv: visa_version($)

source: Shows the current version of the script, and a short copyright message. It takes the name of the script as an argument.
sv: Visar den aktuella versionen av skriptet och ett kort meddelande om upphovsrätt. Det tar namnet på skriptet som argument.
zh_hans: 显示脚本的当前版本，以及一条简短的版权消息。它将脚本的名称作为参数。
zh_hant: 顯示指令碼的當前版本，以及一條簡短的版權訊息。它將指令碼的名稱作為引數。

source: This function displays a message the same way as sprintf() does, but wraps the result so that they look nice on the terminal.
sv: Denna funktion visar ett meddelande på samma sätt som sprintf(), men formaterar resultatet så att det ser snyggt ut på terminalen.
zh_hans: 此函数显示消息的方式与 sprintf() 相同，但会将结果封装起来，以便它们在终端上看起来很美观。
zh_hant: 此函式顯示訊息的方式與 sprintf() 相同，但會將結果封裝起來，以便它們在終端上看起來很美觀。

source: This function works like wrap_msg(), but it takes a module name as the first argument, and leaves a space at the left of the message.
sv: Denna funktion fungerar som wrap_msg(), men den tar ett modulnamn som första argument och lämnar ett mellanslag till vänster om meddelandet.
zh_hans: 此函数的工作方式类似于 wrap_msg()，但它将模块名作为第一个参数，并在消息左侧留下一个空格。
zh_hant: 此函式的工作方式類似於 wrap_msg()，但它將模組名作為第一個引數，並在訊息左側留下一個空格。

source: This function works like wrap_msg(), but it takes a file:line reference as the first argument, a module name as the second one, and leaves a space at the left of the message.
sv: Denna funktion fungerar som wrap_msg(), men tar en fil:radreferens som första argument, ett modulnamn som andra argument och lämnar ett mellanslag till vänster om meddelandet.
zh_hans: 此函数的工作方式类似于 wrap_msg()，但是它将 file:line 引用作为第一个参数，将模块名作为第二个参数，并在消息的左侧留下一个空格。
zh_hant: 此函式的工作方式類似於 wrap_msg()，但是它將 file:line 引用作為第一個引數，將模組名作為第二個引數，並在訊息的左側留下一個空格。

source: Wrappers for other modules
sv: Wrappers för andra moduler
zh_hans: 其他模块的封装器
zh_hant: 其他模組的封裝器

source: When the Locale::Gettext module cannot be loaded, this module provide dummy (empty) implementation of the following functions. In that case, po4a messages won't get translated but the program will continue to work.
sv: När modulen Locale::Gettext inte kan laddas tillhandahåller denna modul en tom implementering av följande funktioner. I så fall översätts inte po4a-meddelanden, men programmet fortsätter att fungera.
zh_hans: 当无法加载 Locale::Gettext 模块时，该模块提供以下函数的伪 (空) 实现。在这种情况下，po4a 消息不会被翻译，但程序将继续工作。
zh_hant: 當無法載入 Locale::Gettext 模組時，該模組提供以下函式的偽 (空) 實現。在這種情況下，po4a 訊息不會被翻譯，但程式將繼續工作。

source: If Locale::gettext is present, this wrapper also calls setlocale(LC_MESSAGES, "") so callers don't depend on the POSIX module either.
sv: Om Locale::gettext finns, anropar denna wrapper också setlocale(LC_MESSAGES, "") så att anropare inte heller är beroende av POSIX-modulen.
zh_hans: 如果存在 Locale::gettext，则此封装器还调用 setlocale(LC_MESSAGES, "")，因此调用者也不依赖于 POSIX 模块。
zh_hant: 如果存在 Locale::gettext，則此封裝器還呼叫 setlocale(LC_MESSAGES, "")，因此呼叫者也不依賴於 POSIX 模組。

source: textdomain($)
sv: textdomän($)

source: Locale::Po4a::Dia - convert uncompressed Dia diagrams from/to PO files
sv: Locale::Po4a::Dia – konvertera okomprimerade Dia-diagram från/till PO-filer
zh_hans: Locale::Po4a::Dia - 将未压缩的 Dia 图表从/转换为 PO 文件
zh_hant: Locale::Po4a::Dia - 將未壓縮的 Dia 圖表從/轉換為 PO 檔案

source: Locale::Po4a::Dia is a module to help the translation of diagrams in the uncompressed Dia format into other [human] languages.
sv: Locale::Po4a::Dia är ett modul som hjälper till att översätta diagram i det okomprimerade Dia-formatet till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Dia 是一个模块，可帮助将未压缩的 Dia 格式的图表转换为其他 [人类] 语言。
zh_hant: Locale::Po4a::Dia 是一個模組，可幫助將未壓縮的 Dia 格式的圖表轉換為其他 [人類] 語言。

source: You can get Dia (the graphical editor for these diagrams) from: https://wiki.gnome.org/Apps/Dia
sv: Du kan hämta Dia (den grafiska redigeraren för dessa diagram) från: https://wiki.gnome.org/Apps/Dia

source: TRANSLATING WITH PO4A::DIA
sv: ÖVERSÄTTNING MED PO4A::DIA
zh_hans: 翻译与 PO4A::DIA
zh_hant: 翻譯與 PO4A::DIA

source: This module only translates uncompressed Dia diagrams. You can save your uncompressed diagrams with Dia itself, unchecking the "Compress diagram files" at the "Save Diagram" dialog.
sv: Denna modul översätter endast okomprimerade Dia-diagram. Du kan spara dina okomprimerade diagram med Dia själv genom att avmarkera "Komprimera diagramfiler" i dialogrutan "Spara diagram".
zh_hans: 此模块仅转换未压缩的 Dia 图。您可以使用 Dia 本身保存未压缩的图表，取消选中“保存图表”对话框中的“压缩图表文件”。
zh_hant: 此模組僅轉換未壓縮的 Dia 圖。您可以使用 Dia 本身儲存未壓縮的圖表，取消選中“保存圖表”對話方塊中的“壓縮圖表檔案”。

source: Another way is to uncompress the dia files from command line with: gunzip < original.dia > uncompressed.dia
sv: Ett annat sätt är att packa upp dia-filerna från kommandoraden med: gunzip < original.dia > uncompressed.dia

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags (E<lt>dia:stringE<gt>), and filters the internal strings (the content of the E<lt>dia:diagramdataE<gt> tag), not interesting for translation.
sv: Denna modul är fullt funktionell, eftersom den bygger på L-<Locale::Po4a::Xml> -modulen. Den definierar endast översättningsbara taggar (E-<lt>dia:stringE-<gt>) och filtrerar interna strängar (innehållet i E-<lt>-dia:diagramdataE-<gt> -taggen) som inte är intressanta för översättning.
zh_hans: 该模块功能齐全，因为它依赖于 L<Locale::Po4a::Xml> 模块。这只定义了可翻译标记 (E<lt>dia:stringE<gt>)，并过滤了内部字符串 (E<lt>dia:diagramdataE<gt> 标记的内容)，对翻译没有意义。
zh_hant: 該模組功能齊全，因為它依賴於 L<Locale::Po4a::Xml> 模組。這隻定義了可翻譯標記 (E<lt>dia:stringE<gt>)，並過濾了內部字串 (E<lt>dia:diagramdataE<gt> 標記的內容)，對翻譯沒有意義。

source: Locale::Po4a::Docbook - convert DocBook XML documents from/to PO files
sv: Locale::Po4a::Docbook – konvertera DocBook XML-dokument från/till PO-filer
zh_hans: Locale::Po4a::Docbook - 将 DocBook XML 文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Docbook - 將 DocBook XML 文件從/轉換為 PO 檔案

source: Locale::Po4a::Docbook is a module to help the translation of DocBook XML documents into other [human] languages.
sv: Locale::Po4a::Docbook är ett modul som hjälper till att översätta DocBook XML-dokument till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Docbook 是一个帮助将 DocBook XML 文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Docbook 是一個幫助將 DocBook XML 文件翻譯成其他 [人類] 語言的模塊。

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags and attributes.
sv: Denna modul är fullt funktionell, eftersom den bygger på L-<Locale::Po4a::Xml> -modulen. Den definierar endast översättningsbara taggar och attribut.
zh_hans: 该模块功能齐全，因为它依赖于 L<Locale::Po4a::Xml> 模块。这只定义了可翻译的标签和属性。
zh_hant: 該模組功能齊全，因為它依賴於 L<Locale::Po4a::Xml> 模組。這隻定義了可翻譯的標籤和屬性。

source: The only known issue is that it doesn't handle entities yet, and this includes the file inclusion entities, but you can translate most of those files alone (except the typical entities files), and it's usually better to maintain them separated.
sv: Det enda kända problemet är att det ännu inte hanterar enheter, inklusive filinkluderingsenheter, men du kan översätta de flesta av dessa filer separat (förutom de typiska enhetsfilerna), och det är oftast bättre att hålla dem åtskilda.
zh_hans: 唯一已知的问题是它还不处理实体，这包括文件包含实体，但是您可以单独转换大多数这些文件(典型实体文件除外)，而且通常最好将它们分开维护。
zh_hant: 唯一已知的問題是它還不處理實體，這包括檔案包含實體，但是您可以單獨轉換大多數這些檔案(典型實體檔案除外)，而且通常最好將它們分開維護。

source: OVERRIDE THE DEFAULT BEHAVIOR WITH COMMAND LINE OPTIONS
sv: ÅSIDOSÄTTA STANDARDBETEENDET MED KOMMANDORADSFLAGGOR
zh_hans: 使用命令行选项覆盖默认行为
zh_hant: 使用命令列選項覆蓋預設行為

source: The default behavior of system provided modules is set to be on the safe side.
sv: Standardinställningen för systemets moduler är att vara på den säkra sidan.
zh_hans: 系统提供的模块的默认行为设置为安全。
zh_hant: 系統提供的模組的預設行為設定為安全。

source: For example, the default of B<< <author> >> tag is aiming it to appear under B<< <para> >>. But you may be using it only under B<< <bookinfo> >>. For this case, you may want to translate it independently for each author.
sv: Till exempel är standardinställningen för taggen B<< <author> >> att den ska visas under B<< <para> >>. Men du kanske bara använder den under B<< <bookinfo> >>. I så fall kanske du vill översätta den separat för varje författare.
zh_hans: 例如，B<< <author> >> 标记的缺省设置是将其显示在 B<< <para> >> 下。但是您只能在 B<< <bookinfo> >> 下使用它。对于这种情况，您可能希望为每个作者单独翻译它。
zh_hant: 例如，B<< <author> >> 標記的預設設定是將其顯示在 B<< <para> >> 下。但是您只能在 B<< <bookinfo> >> 下使用它。對於這種情況，您可能希望為每個作者單獨翻譯它。

source: If you don't like the default behavior of the xml module and its derivative modules, you can provide command line options to change their behavior. For example, you can add the following to the po4a configuration file:
sv: Om du inte gillar standardbeteendet för xml-modulen och dess derivatmoduler kan du ange kommandoradsflaggor för att ändra deras beteende. Du kan till exempel lägga till följande i po4a-konfigurationsfilen:
zh_hans: 如果您不喜欢 xml 模块及其派生模块的默认行为，可以提供命令行选项来更改它们的行为。 例如，您可以将以下内容添加到 po4a 配置文件中：
zh_hant: 如果您不喜歡 xml 模組及其派生模組的預設行為，可以提供命令列選項來更改它們的行為。 例如，您可以將以下內容新增到 po4a 配置檔案中：

source: This overrides the default behavior for B<< <bookinfo> >> and B<< <author> >>, set B<< <bookinfo> >> and B<< <author> >> to break input data stream on these tags, set B<< <bookinfo> >> not to translate its tagged content, and set B<< <author> >> to translate its tagged content.
sv: Detta åsidosätter standardbeteendet för B<< <bookinfo> >> och B<< <author> >>, ställ in B<< <bookinfo> >> och B<< <author> >> för att bryta indataströmmen på dessa taggar, ställ in B<< <bookinfo> >> för att inte översätta dess taggade innehåll och ställ in B<< <author> >> för att översätta dess taggade innehåll.
zh_hans: 这将覆盖 B<< <bookinfo> >> 和 B<< <author> >> 的默认行为，设置 B<< <bookinfo> >> 和 B<< <author> >> 以中断这些标记上的输入数据流，设置 B<< <bookinfo> >> 不翻译其标记的内容，并设置 B<< <author> >> 翻译其标记的内容。
zh_hant: 這將覆蓋 B<< <bookinfo> >> 和 B<< <author> >> 的預設行為，設定 B<< <bookinfo> >> 和 B<< <author> >> 以中斷這些標記上的輸入資料流，設定 B<< <bookinfo> >> 不翻譯其標記的內容，並設定 B<< <author> >> 翻譯其標記的內容。

source: Locale::Po4a::Gemtext - convert Gemtext documents from/to PO files
sv: Locale::Po4a::Gemtext – konvertera Gemtext-dokument från/till PO-filer

source: Locale::Po4a::Gemtext is a module to help the translation of Gemtext documents into other [human] languages.
sv: Locale::Po4a::Gemtext är ett modul som hjälper till att översätta Gemtext-dokument till andra [mänskliga] språk.

source: Tested successfully on simple Gemtext files, such as the official Gemtext documentation.
sv: Testat med framgång på enkla Gemtext-filer, såsom den officiella Gemtext-dokumentationen.

source: Locale::Po4a::Guide - convert Guide XML documents from/to PO files
sv: Locale::Po4a::Guide – konvertera Guide XML-dokument från/till PO-filer
zh_hans: Locale::Po4a::Guide - 将指南 XML 文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Guide - 將指南 XML 文件從/轉換為 PO 檔案

source: Locale::Po4a::Guide is a module to help in the translation of the Gentoo Linux documentation in the Guide XML format into other [human] languages.
sv: Locale::Po4a::Guide är ett modul som hjälper till att översätta Gentoo Linux-dokumentationen i Guide XML-format till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Guide 是一个模块，用于帮助将 Guide XML 格式的 Gentoo Linux 文档翻译成其他 [人类] 语言。
zh_hant: Locale::Po4a::Guide 是一個模組，用於幫助將 Guide XML 格式的 Gentoo Linux 文件翻譯成其他 [人類] 語言。

source: This format is documented here: http://www.gentoo.org/doc/en/xml-guide.xml
sv: Detta format dokumenteras här: http://www.gentoo.org/doc/en/xml-guide.xml
zh_hans: 此格式记录在这里： http://www.gentoo.org/doc/en/xml-guide.xml
zh_hant: 此格式記錄在這裡： http://www.gentoo.org/doc/en/xml-guide.xml

source: The only known issue is that it doesn't include files with the <include href="..."> tag, but you can translate all those files alone, and it's usually better to have them separated.
sv: Det enda kända problemet är att det inte inkluderar filer med taggen <include href="...">, men du kan översätta alla dessa filer separat, och det är oftast bättre att ha dem separerade.
zh_hans: 唯一已知的问题是它不包含带有 <include href="..."> 标记的文件，但是您可以单独转换所有这些文件，通常最好将它们分开。
zh_hant: 唯一已知的問題是它不包含帶有 <include href="..."> 標記的檔案，但是您可以單獨轉換所有這些檔案，通常最好將它們分開。

source: Locale::Po4a::Halibut - convert Halibut documents and derivates from/to PO files
sv: Locale::Po4a::Halibut – konvertera Halibut-dokument och derivat från/till PO-filer
zh_hans: Locale::Po4a::Halibut -将 Halibut 文档和衍生内容从/转换为 PO 文件
zh_hant: Locale::Po4a::Halibut -將 Halibut 文件和衍生內容從/轉換為 PO 檔案

source: Locale::Po4a::Halibut is a module to help the translation of Halibut documents into other [human] languages.
sv: Locale::Po4a::Halibut är ett modul som hjälper till att översätta Halibut-dokument till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Halibut 是一个帮助将 Halibut 文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Halibut 是一個幫助將 Halibut 文件翻譯成其他 [人類] 語言的模組。

source: This module contains the definitions of common Halibut commands and environments.
sv: Denna modul innehåller definitioner av vanliga Halibut-kommandon och miljöer.
zh_hans: 本模块包含常见的 Halibut 命令和环境的定义。
zh_hant: 本模組包含常見的 Halibut 命令和環境的定義。
