Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: List the documentation formats understood by po4a.
sv: Lista de dokumentationsformat som po4a förstår.
zh_hans: 列出 po4a 理解的文档格式。
zh_hant: 列出 po4a 理解的文件格式。

source: Keep the temporary master and localized POT files built before merging. This can be useful to understand why these files get desynchronized, leading to gettextization problems.
sv: Behåll de tillfälliga master- och lokaliserade POT-filerna som skapades före sammanslagningen. Detta kan vara användbart för att förstå varför dessa filer blir osynkroniserade, vilket leder till gettextiseringsproblem.

source: Converting a manual translation to po4a
sv: Konvertera en manuell översättning till po4a
zh_hans: 将手动翻译转换为 po4a
zh_hant: 將手動翻譯轉換為 po4a

source: B<po4a-gettextize> synchronizes the master and localized files to extract their content into a PO file. The content of the master file gives the B<msgid> while the content of the localized file gives the B<msgstr>. This process is somewhat fragile: the Nth string of the translated file is supposed to be the translation of the Nth string in the original.
sv: B<po4a-gettextize> synkroniserar masterfilen och de lokaliserade filerna för att extrahera deras innehåll till en PO-fil. Innehållet i masterfilen ger B<msgid> medan innehållet i den lokaliserade filen ger B<msgstr>. Denna process är något ömtålig: den N:te strängen i den översatta filen ska vara översättningen av den N:te strängen i originalet.

source: Gettextization works best if you manage to retrieve the exact version of the original document that was used for translation. Even so, you may need to fiddle with both master and localized files to align their structure if it was changed by the original translator, so working on files' copies is advised.
sv: Gettextisering fungerar bäst om du lyckas hämta den exakta versionen av originaldokumentet som användes för översättningen. Även då kan du behöva justera både originalfilerna och de lokaliserade filerna för att anpassa deras struktur om den ändrats av den ursprungliga översättaren, så det rekommenderas att arbeta med kopior av filerna.

source: Internally, each po4a parser reports the syntactical type of each extracted strings. This is how desynchronization are detected during the gettextization. In the example depicted below, it is very unlikely that the 4th string in translation (of type 'chapter') is the translation of the 4th string in original (of type 'paragraph'). It is more likely that a new paragraph was added to the original, or that two original paragraphs were merged together in the translation.
sv: Internt rapporterar varje po4a-parser den syntaktiska typen för varje extraherad sträng. Det är så desynkronisering upptäcks under gettextiseringen. I exemplet nedan är det mycket osannolikt att den fjärde strängen i översättningen (av typen "kapitel") är översättningen av den fjärde strängen i originalet (av typen "stycke"). Det är mer troligt att ett nytt stycke har lagts till i originalet, eller att två originalstycken har slagits samman i översättningen.

source: Original Translation chapter chapter paragraph paragraph paragraph paragraph paragraph chapter chapter paragraph paragraph paragraph
sv: Original Översättning chapter kapitel paragraph stycke paragraph stycke paragraph kapitel chapter stycke paragraph stycke

source: B<po4a-gettextize> will verbosely diagnose any structure desynchronization. When this happens, you should manually edit the files to add fake paragraphs or remove some content here and there until the structure of both files actually match. Some tricks are given below to salvage the most of the existing translation while doing so.
sv: B<po4a-gettextize> kommer att diagnostisera alla strukturella desynkroniseringar utförligt. När detta inträffar bör du manuellt redigera filerna för att lägga till falska stycken eller ta bort lite innehåll här och där tills strukturen i båda filerna faktiskt stämmer överens. Nedan följer några tips för att rädda så mycket som möjligt av den befintliga översättningen när du gör detta.

source: If you are lucky enough to have a perfect match in the file structures out of the box, building a correct PO file is a matter of seconds. Otherwise, you will soon understand why this process has such an ugly name :) Even so, gettextization often remains faster than translating everything again. I gettextized the French translation of the whole Perl documentation in one day despite the I<many> synchronization issues. Given the amount of text (2MB of original text), restarting the translation without first salvaging the old translations would have required several months of work. In addition, this grunt work is the price to pay to get the comfort of po4a. Once converted, the synchronization between master documents and translations will always be fully automatic.
sv: Om du har turen att ha en perfekt matchning i filstrukturerna direkt, tar det bara några sekunder att skapa en korrekt PO-fil. Annars kommer du snart att förstå varför den här processen har ett så fult namn :) Ändå är gettextisering ofta snabbare än att översätta allt igen. Jag gettextiserade den franska översättningen av hela Perl-dokumentationen på en dag trots synkroniseringsproblemen med I<many>. Med tanke på textmängden (2 MB originaltext) skulle det ha tagit flera månader att starta om översättningen utan att först rädda de gamla översättningarna. Dessutom är detta slitgöra priset man måste betala för att få bekvämligheten med po4a. När konverteringen är klar kommer synkroniseringen mellan huvuddokument och översättningar alltid att ske helt automatiskt.

source: After a successful gettextization, the produced documents should be manually checked for undetected disparities and silent errors, as explained below.
sv: Efter en lyckad gettextisering bör de producerade dokumenten kontrolleras manuellt för att upptäcka eventuella oupptäckta skillnader och dolda fel, enligt beskrivningen nedan.

source: Hints and tricks for the gettextization process
sv: Tips och tricks för gettextiseringsprocessen
zh_hans: 获取文本化过程的提示和技巧
zh_hant: 獲取文字化過程的提示和技巧

source: The gettextization stops as soon as a desynchronization is detected. When this happens, you need to edit the files as much as needed to re-align the files' structures. B<po4a-gettextize> is rather verbose when things go wrong. It reports the strings that don't match, their positions in the text, and the type of each of them. Moreover, the PO file generated so far is dumped as F<gettextization.failed.po> for further inspection.
sv: Gettextiseringen avbryts så snart en desynkronisering upptäcks. När detta inträffar måste du redigera filerna så mycket som behövs för att återställa filernas struktur. B<po4a-gettextize> är ganska detaljerad när något går fel. Den rapporterar de strängar som inte stämmer överens, deras positioner i texten och typen av varje sträng. Dessutom dumpas den PO-fil som genererats hittills som F<gettextization.failed.po> för vidare granskning.

source: Here are some tricks to help you in this tedious process and ensure that you salvage the most of the previous translation:
sv: Här är några tips som kan hjälpa dig i denna mödosamma process och se till att du kan återanvända så mycket som möjligt av den tidigare översättningen:

source: Remove all extra content of the translations, such as the section giving credits to the translators. They should be added separately to B<po4a> as addenda (see L<po4a(7)>).
sv: Ta bort allt extra innehåll i översättningarna, till exempel avsnittet med tack till översättarna. De ska läggas till separat på B<po4a> som tillägg (se L<po4a(7)>).

source: When editing the files to align their structures, prefer editing the translation if possible. Indeed, if the changes to the original are too intrusive, the old and new versions will not be matched during the first po4a run after gettextization (see below). Any unmatched translation will be dumped anyway. That being said, you still want to edit the original document if it's too hard to get the gettextization to proceed otherwise, even if it means that one paragraph of the translation is dumped. The important thing is to get a first PO file to start with.
sv: När du redigerar filerna för att anpassa deras strukturer, bör du helst redigera översättningen om möjligt. Om ändringarna i originalet är för omfattande kommer den gamla och den nya versionen inte att matchas under den första po4a-körningen efter gettextisering (se nedan). Alla översättningar som inte matchar kommer ändå att kasseras. Med detta sagt bör du ändå redigera originaldokumentet om det är för svårt att få gettextiseringen att fortsätta på annat sätt, även om det innebär att ett stycke av översättningen kasseras. Det viktiga är att få en första PO-fil att börja med.

source: Do not hesitate to kill any original content that would not exist in the translated version. This content will be automatically reintroduced afterward, when synchronizing the PO file with the document.
sv: Tveka inte att ta bort allt originalinnehåll som inte skulle finnas i den översatta versionen. Detta innehåll kommer automatiskt att återinföras efteråt, när PO-filen synkroniseras med dokumentet.
zh_hans: 不要犹豫，杀死任何原始内容，将不存在在翻译版本。将 PO 文件与文档同步时，以后将自动重新引入此内容。
zh_hant: 不要猶豫，殺死任何原始內容，將不存在在翻譯版本。將 PO 檔案與文件同步時，以後將自動重新引入此內容。

source: You should probably inform the original author of any structural change in the translation that seems justified. Issues in the original document should reported to the author. Fixing them in your translation only fixes them for a part of the community. Plus, it is impossible to do so when using po4a ;) But you probably want to wait until the end of the conversion to B<po4a> before changing the original files.
sv: Du bör antagligen informera den ursprungliga författaren om alla strukturella förändringar i översättningen som verkar motiverade. Problem i originaldokumentet bör rapporteras till författaren. Att åtgärda dem i din översättning åtgärdar dem bara för en del av gemenskapen. Dessutom är det omöjligt att göra det när man använder po4a ;) Men du bör antagligen vänta till slutet av konverteringen till B<po4a> innan du ändrar originalfilerna.

source: Sometimes, the paragraph content does match, but not their types. Fixing it is rather format-dependent. In POD and man, it often comes from the fact that one of them contains a line beginning with a white space while the other does not. In those formats, such paragraph cannot be wrapped and thus become a different type. Just remove the space and you are fine. It may also be a typo in the tag name in XML.
sv: Ibland stämmer innehållet i styckena överens, men inte deras typer. Att åtgärda detta är ganska formatberoende. I POD och man beror det ofta på att det ena innehåller en rad som börjar med ett blanksteg medan det andra inte gör det. I dessa format kan sådana stycken inte brytas och blir därför en annan typ. Ta bara bort blanksteget så är det fixat. Det kan också vara ett skrivfel i taggnamnet i XML.
zh_hans: 有时，段落内容确实匹配，但不匹配其类型。修复它与格式相当相关。在 POD 和人中，它通常来自这样一个事实，即其中一个包含以空白开头的行，而另一个则不包含。 在这些格式中，此类段落不能换行，因此成为不同的类型。只需删除空间，您就没事了。它也可能在 XML 中的标记名称中出现拼写错误。
zh_hant: 有時，段落內容確實匹配，但不匹配其型別。修復它與格式相當相關。在 POD 和人中，它通常來自這樣一個事實，即其中一個包含以空白開頭的行，而另一個則不包含。 在這些格式中，此類段落不能換行，因此成為不同的型別。只需刪除空間，您就沒事了。它也可能在 XML 中的標記名稱中出現拼寫錯誤。

source: Likewise, two paragraphs may get merged together in POD when the separating line contains some spaces, or when there is no empty line between the B<=item> line and the content of the item.
sv: På samma sätt kan två stycken slås ihop i POD när skiljelinjen innehåller några mellanslag eller när det inte finns någon tom rad mellan raden B<=item> och innehållet i objektet.
zh_hans: 同样，当分隔线包含某些空格时，或者当 B<=item> 行和项内容之间没有空行时，两个段落可能会合并到 POD 中。
zh_hant: 同樣，當分隔線包含某些空格時，或者當 B<=item> 行和項內容之間沒有空行時，兩個段落可能會合併到 POD 中。

source: Sometimes, the desynchronization message seems odd because the translation is attached to the wrong original paragraph. It is the sign of an undetected issue earlier in the process. Search for the actual desynchronization point by inspecting the file F<gettextization.failed.po> that was produced, and fix the problem where it really is.
sv: Ibland kan meddelandet om desynkronisering verka konstigt eftersom översättningen är kopplad till fel originalstycke. Det är ett tecken på ett problem som inte upptäcktes tidigare i processen. Sök efter den faktiska desynkroniseringspunkten genom att inspektera filen F<gettextization.failed.po> som skapades och åtgärda problemet där det verkligen finns.

source: Other issues may come from duplicated strings in either the original or translation. Duplicated strings are merged in PO files, with two references. This constitutes a difficulty for the gettextization algorithm, that is a simple one to one pairing between the B<msgid>s of both the master and the localized files. It is however believed that recent versions of po4a deal properly with duplicated strings, so you should report any remaining issue that you may encounter.
sv: Andra problem kan uppstå på grund av duplicerade strängar i antingen originalet eller översättningen. Duplicerade strängar slås samman i PO-filer, med två referenser. Detta utgör ett problem för gettextiseringsalgoritmen, som är en enkel en-till-en-koppling mellan B-<msgid>erna i både masterfilen och de lokaliserade filerna. Man tror dock att de senaste versionerna av po4a hanterar duplicerade strängar på ett korrekt sätt, så du bör rapportera eventuella kvarstående problem som du stöter på.

source: Reviewing files produced by B<po4a-gettextize>
sv: Granskning av filer som skapats av B<po4a-gettextize>

source: Any file produced by B<po4a-gettextize> should be manually reviewed, even when the script terminates successfully. You should skim over the PO file, ensuring that the B<msgid> and B<msgstr> actually match. It is not necessary to ensure that the translation is perfectly correct yet, as all entries are marked as fuzzy translations anyway. You only need to check for obvious matching issues because badly matched translations will be dumped in subsequent steps while you want to salvage them.
sv: Alla filer som skapas av B<po4a-gettextize> bör granskas manuellt, även om skriptet avslutas utan problem. Du bör bläddra igenom PO-filen och se till att B<msgid> och B<msgstr> faktiskt stämmer överens. Det är inte nödvändigt att se till att översättningen är helt korrekt ännu, eftersom alla poster ändå markeras som fuzzy-översättningar. Du behöver bara kontrollera om det finns uppenbara matchningsproblem, eftersom dåligt matchade översättningar kommer att dumpas i efterföljande steg medan du vill rädda dem.

source: Fortunately, this step does not require to master the target languages as you only want to recognize similar elements in each B<msgid> and its corresponding B<msgstr>. As a speaker of French, English, and some German myself, I can do this for all European languages at least, even if I cannot say one word of most of these languages. I sometimes manage to detect matching issues in non-Latin languages by looking at string length, phrase structures (does the amount of interrogation marks match?) and other clues, but I prefer when someone else can review those languages.
sv: Lyckligtvis kräver detta steg inte att man behärskar målspråken, eftersom man bara vill känna igen liknande element i varje B-<msgid> och dess motsvarande B-<msgstr>. Eftersom jag själv talar franska, engelska och lite tyska kan jag göra detta för alla europeiska språk, även om jag inte kan ett ord av de flesta av dessa språk. Ibland lyckas jag upptäcka matchande problem i icke-latinska språk genom att titta på stränglängd, frasstrukturer (stämmer antalet frågetecken?) och andra ledtrådar, men jag föredrar att någon annan granskar dessa språk.

source: If you detect a mismatch, edit the original and translation files as if B<po4a-gettextize> reported an error, and try again. Once you have a decent PO file for your previous translation, backup it until you get po4a working correctly.
sv: Om du upptäcker en avvikelse, redigera originalfilen och översättningsfilen som om B<po4a-gettextize> rapporterade ett fel, och försök igen. När du har en bra PO-fil för din tidigare översättning, säkerhetskopiera den tills po4a fungerar korrekt.

source: Running B<po4a> for the first time
sv: Kör B-<po4a> en för första gången

source: The easiest way to setup po4a is to write a B<po4a.conf> configuration file, and use the integrated B<po4a> program (B<po4a-updatepo> and B<po4a-translate> are deprecated). Please check the "CONFIGURATION FILE" Section in L<po4a(1)> documentation for more details.
sv: Det enklaste sättet att konfigurera po4a är att skriva en B<po4a.conf> -konfigurationsfil och använda det integrerade B<po4a> -programmet (B<po4a-updatepo> och B<po4a-translate> är föråldrade). Se avsnittet "CONFIGURATION FILE" i L<po4a(1)> -dokumentationen för mer information.

source: When B<po4a> runs for the first time, the current version of the master documents will be used to update the PO files containing the old translations that you salvaged through gettextization. This can take quite a long time, because many of the B<msgid>s of from the gettextization do not exactly match the elements of the POT file built from the recent master files. This forces gettext to search for the closest one using a costly string proximity algorithm. For example, the first run over the Perl documentation's French translation (5.5 MB PO file) took about 48 hours (yes, two days) while the subsequent ones only take seconds.
sv: När B-<po4a> körs för första gången kommer den aktuella versionen av huvuddokumenten att användas för att uppdatera PO-filerna som innehåller de gamla översättningarna som du räddat genom gettextisering. Detta kan ta ganska lång tid, eftersom många av B-<msgid>erna från gettextiseringen inte exakt matchar elementen i POT-filen som skapats från de senaste huvudfilerna. Detta tvingar gettext att söka efter den närmaste med hjälp av en kostsam strängnärhetsalgoritm. Till exempel tog den första körningen av den franska översättningen av Perl-dokumentationen (5,5 MB PO-fil) cirka 48 timmar (ja, två dagar), medan de efterföljande bara tog några sekunder.

source: Moving your translations to production
sv: Flytta dina översättningar till produktion

source: After this first run, the PO files are ready to be reviewed by translators. All entries were marked as fuzzy in the PO file by B<po4a-gettextization>, forcing their careful review before use. Translators should take each entry to verify that the salvaged translation actually match the current original text, update the translation on need, and remove the fuzzy markers.
sv: Efter denna första körning är PO-filerna redo att granskas av översättarna. Alla poster har markerats som fuzzy i PO-filen av B-<po4a-gettextization>, vilket innebär att de måste granskas noggrant innan de används. Översättarna bör kontrollera varje post för att verifiera att den återställda översättningen faktiskt stämmer överens med den aktuella originaltexten, uppdatera översättningen vid behov och ta bort fuzzy-markeringarna.

source: Once enough fuzzy markers are removed, B<po4a> will start generating the translation files on disk, and you're ready to move your translation workflow to production. Some projects find it useful to rely on weblate to coordinate between translators and maintainers, but that's beyond B<po4a>' scope.
sv: När tillräckligt många oklara markeringar har tagits bort börjar B<po4a> generera översättningsfilerna på disken, och du är redo att flytta ditt översättningsflöde till produktion. Vissa projekt tycker att det är användbart att använda weblate för att samordna mellan översättare och underhållsansvariga, men det ligger utanför B<po4a>:s räckvidd.

source: po4a-normalize - normalize a documentation file by parsing it in po4a, and writing it back
sv: po4a-normalize – normalisera en dokumentationsfil genom att analysera den i po4a och skriva tillbaka den
zh_hans: po4a-normalize - 通过在 po4a 中解析文档文件并写回文档文件来规范化文档文件
zh_hant: po4a-normalize - 透過在 po4a 中解析文件檔案並寫回文件檔案來規範化文件檔案

source: The po4a (PO for anything) project goal is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not expected like documentation.
sv: Målet med po4a-projektet (PO för allt) är att underlätta översättningar (och, ännu mer intressant, underhållet av översättningar) med hjälp av gettext-verktyg på områden där de inte förväntades användas, såsom dokumentation.
zh_hans: Po4a (PO For Anything) 项目的目标是在文档等不需要翻译的领域使用 gettext 工具简化翻译(更有趣的是，简化翻译的维护)。
zh_hant: Po4a (PO For Anything) 專案的目標是在文件等不需要翻譯的領域使用 gettext 工具簡化翻譯(更有趣的是，簡化翻譯的維護)。

source: The B<po4a-normalize> script is a debugging tool used to make sure that po4a don't change the document when it's not supposed to. Only use it if you're developing a new module, or if you doubt the sanity of the tools.
sv: Skriptet B<po4a-normalize> är ett felsökningsverktyg som används för att säkerställa att po4a inte ändrar dokumentet när det inte ska göra det. Använd det endast om du utvecklar en ny modul eller om du tvivlar på verktygens tillförlitlighet.
zh_hans: B<po4a-normalize>是一个调试工具，用于确保 po4a 不会更改文档时，它不应该。仅当您正在开发新模块时，或者如果您怀疑工具的可理智性，才使用它。
zh_hant: B<po4a-normalize>是一個除錯工具，用於確保 po4a 不會更改文件時，它不應該。僅當您正在開發新模組時，或者如果您懷疑工具的可理智性，才使用它。

source: The generated document will be written to F<po4a-normalize.output> while the generated POT file will be written to F<po4a-normalize.po> by default, but you can use the B<--localized> and B<--pot> options to change that.
sv: Det genererade dokumentet skrivs till F<po4a-normalize.output>, medan den genererade POT-filen skrivs till F<po4a-normalize.po> som standard, men du kan använda flaggorna B<--localized> och B<--pot> för att ändra detta.
zh_hans: 生成的文档将写入 F<po4a-normalize.output>，而生成的 POT 文件将写入 F<po4a-normalize.po>，但您可以使用 B<--localized>和 B<--pot> 选项来更改它。
zh_hant: 生成的文件將寫入 F<po4a-normalize.output>，而生成的 POT 檔案將寫入 F<po4a-normalize.po>，但您可以使用 B<--localized>和 B<--pot> 選項來更改它。

source: Create a blank translated document. The generated translated document will be generated assuming all messages are translated by a space or new line.
sv: Skapa ett tomt översatt dokument. Det genererade översatta dokumentet kommer att genereras med antagandet att alla meddelanden översätts med ett mellanslag eller en ny rad.
zh_hans: 创建空白翻译的文档。 如果所有消息都由空格或新行翻译，将生成生成的已翻译文档。
zh_hant: 建立空白翻譯的文件。 如果所有訊息都由空格或新行翻譯，將生成生成的已翻譯文件。

source: This is useful to check what parts of the document cannot be translated.
sv: Detta är användbart för att kontrollera vilka delar av dokumentet som inte kan översättas.
zh_hans: 这可用于检查文档的哪些部分无法翻译。
zh_hant: 這可用於檢查文件的哪些部分無法翻譯。

source: Both B<--blank> and B<--capitalize> can't be specified at the same time.
sv: Både B<--blank> och B<--capitalize> kan inte anges samtidigt.

source: Create a translated document and corresponding po-file with original strings translated as their capitalized versions.
sv: Skapa ett översatt dokument och motsvarande po-fil med originalsträngarna översatta till sina versaler.

source: This is useful to check what parts of the document cannot be translated and generate test data for po4a.
sv: Detta är användbart för att kontrollera vilka delar av dokumentet som inte kan översättas och generera testdata för po4a.

source: Name of the normalized file to produce (I<po4a-normalize.output> by default).
sv: Namn på den normaliserade filen som ska skapas (standard är I<po4a-normalize.output>).
zh_hans: 要生产的规范化文件的名称（默认情况下 I<po4a-normalize.output>）。
zh_hant: 要生產的規範化檔案的名稱（預設情況下 I<po4a-normalize.output>）。

source: Pot file to produce (I<po4a-normalize.po> by default).
sv: Pot-fil att producera (I<po4a-normalize.po> som standard).
zh_hans: 要生成的 POT 文件(默认情况下为 I<po4a-Normize.po>)。
zh_hant: 要生成的 POT 檔案(預設情況下為 I<po4a-Normize.po>)。
