Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: en
sv: sv
zh_hans: zh_Hans
zh_hant: zh_Hant

source: Po4a Tools
sv: Po4a-verktyg
zh_hans: Po4a 工具
zh_hant: Po4a 工具

source: display a translated man page according to a PO
sv: visa en översatt man-sida enligt en PO
zh_hans: 根据 PO 显示翻译的手册
zh_hant: 根據 PO 顯示翻譯的手冊

source: <command>po4a-display-man</command> <arg choice='plain'><option>-p</option> </arg> <arg choice='plain'><replaceable>PO_FILE</replaceable></arg> <arg choice='opt'><arg choice='plain'><option>-m</option> </arg><arg choice='plain'><replaceable>MASTER_FILE</replaceable></arg></arg> <arg choice='opt'><arg choice='plain'><option>-o</option> </arg><arg choice='plain'><replaceable>PO4A_OPT</replaceable></arg></arg>
sv: <command>po4a-display-man</command> <arg choice='plain'><option>-p</option> </arg> <arg choice='plain'><replaceable>PO-FIL</replaceable></arg> <arg choice='opt'><arg choice='plain'><option>-m</option> </arg><arg choice='plain'><replaceable>HUVUDFIL</replaceable></arg></arg> <arg choice='opt'><arg choice='plain'><option>-o</option> </arg><arg choice='plain'><replaceable>PO4A_OPT</replaceable></arg></arg>

source: DESCRIPTION
sv: BESKRIVNING
zh_hans: 描述
zh_hant: 描述

source: Translators can use <command>po4a-display-man</command> to see how their translation of a man page will be rendered to the end users, without recompiling and reinstalling the whole project.
sv: Översättare kan använda <command>po4a-display-man</command> för att se hur deras översättning av en man-sida kommer att visas för slutanvändarna, utan att behöva kompilera om och installera om hela projektet.
zh_hans: 翻译人员可以使用 <command>po4a display man</command> 查看如何将其对手册页的翻译呈现给最终用户，而无需重新编译和重新安装整个项目。
zh_hant: 翻譯人員可以使用 <command>po4a display man</command> 檢視如何將其對手冊頁的翻譯呈現給終端使用者，而無需重新編譯和重新安裝整個專案。

source: This script only works with man pages written directly in <emphasis remap='I'>nroff</emphasis> and handled by the po4a's <emphasis remap='I'>man</emphasis> module. Manual pages generated from other formats, like DocBook or POD, are not supported. See <citerefentry><refentrytitle>po4a-display-pod</refentrytitle><manvolnum>1</manvolnum></citerefentry> for an equivalent supporting <emphasis remap='I'>POD</emphasis> documents.
sv: Detta skript fungerar endast med man-sidor som är skrivna direkt i <emphasis remap='I'>nroff</emphasis> och hanteras av po4a:s <emphasis remap='I'>man-modul</emphasis>. Manualsidor som genererats från andra format, såsom DocBook eller POD, stöds inte. Se <citerefentry><refentrytitle>po4a-display-pod</refentrytitle><manvolnum>1</manvolnum></citerefentry> för ett motsvarande stöd för <emphasis remap='I'>POD</emphasis> -dokument.
zh_hans: 该脚本仅适用于直接用<emphasis remap='I'>nroff</emphasis>编写并由 po4a 的<emphasis remap='I'>man</emphasis> 模块处理的手册页。 不支持从其他格式（如 DocBook 或 POD）生成的手册页。 请参见<citerefentry><refentrytitle>po4a-display-pod</refentrytitle><manvolnum>1</manvolnum></citerefentry>，有关支持<emphasis remap='I'>POD</emphasis>文档的等效内容。
zh_hant: 該指令碼僅適用於直接用<emphasis remap='I'>nroff</emphasis>編寫並由 po4a 的<emphasis remap='I'>man</emphasis> 模組處理的手冊頁。 不支援從其他格式（如 DocBook 或 POD）生成的手冊頁。 請參見<citerefentry><refentrytitle>po4a-display-pod</refentrytitle><manvolnum>1</manvolnum></citerefentry>，有關支援<emphasis remap='I'>POD</emphasis>文件的等效內容。

source: OPTIONS
sv: FLAGGOR
zh_hans: 选项
zh_hant: 選項

source: The PO file containing the translations.
sv: PO-filen som innehåller översättningarna.
zh_hans: 包含翻译的 PO 文件。
zh_hant: 包含翻譯的 PO 檔案。

source: The original man page. It can be the absolute or relative path to the original man page (gzipped or not), the name of the man page or the name and section of the man page (using the man.section format). When the master document is not provided with the <option>-m</option> option, <command>po4a-display-man</command> tries to find the original man page based on the line reference of the first string in the PO.
sv: Den ursprungliga man-sidan. Det kan vara den absoluta eller relativa sökvägen till den ursprungliga man-sidan (gzippad eller inte), namnet på man-sidan eller namnet och sektionen på man-sidan (med formatet man.section). När huvuddokumentet inte tillhandahålls med flaggan <option>-m</option> försöker <command>po4a-display-man</command> att hitta den ursprungliga man-sidan baserat på radreferensen för den första strängen i PO.
zh_hans: 原始手册页。它可以是原始手册页的绝对或相对路径（gzip 或 not）、手册页的名称或手册页的名称和部分（使用工段格式）。当主控文档没有提供 <option>-m</option> 选项时，<command>po4a display man</command> 会根据订单中第一个字符串的行引用来查找原始的手册页。
zh_hant: 原始手冊頁。它可以是原始手冊頁的絕對或相對路徑（gzip 或 not）、手冊頁的名稱或手冊頁的名稱和部分（使用工段格式）。當主控文件沒有提供 <option>-m</option> 選項時，<command>po4a display man</command> 會根據訂單中第一個字串的行引用來查詢原始的手冊頁。

source: Some options to pass to <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
sv: Några flaggor att vidarebefordra till <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
zh_hans: 一些选项传递到 <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
zh_hant: 一些選項傳遞到 <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: SEE ALSO
sv: SE ÄVEN
zh_hans: 参见
zh_hant: 另請參見

source: AUTHOR
sv: UPPHOVSPERSON
zh_hans: 作者
zh_hant: 作者

source: display of a translated POD file according to a PO
sv: visning av en översatt POD-fil enligt en PO
zh_hans: 根据 PO 显示翻译的 POD 文件
zh_hant: 根據 PO 顯示翻譯的 POD 檔案

source: Translators can use <command>po4a-display-pod</command> to see how their translation of a man page will be rendered to the end users, without recompiling and reinstalling the whole project. Most of the time, the POD file is only available in source package or embedded in Perl script.
sv: Översättare kan använda <command>po4a-display-pod</command> för att se hur deras översättning av en man-sida kommer att visas för slutanvändarna, utan att behöva kompilera om och installera om hela projektet. Oftast finns POD-filen endast tillgänglig i källkodspaketet eller inbäddad i Perl-skript.
zh_hans: 翻译人员可以使用 <command>po4a display pod</command> 查看如何将其对手册页的翻译呈现给最终用户，而无需重新编译和重新安装整个项目。大多数情况下，POD 文件只在源包中可用或嵌入在 Perl 脚本中。
zh_hant: 翻譯人員可以使用 <command>po4a display pod</command> 檢視如何將其對手冊頁的翻譯呈現給終端使用者，而無需重新編譯和重新安裝整個專案。大多數情況下，POD 檔案只在源包中可用或嵌入在 Perl 指令碼中。

source: The original POD file used by po4a to generate PO file.
sv: Den ursprungliga POD-filen som används av po4a för att generera PO-filen.
zh_hans: Po4a 用于生成 PO 文件的原始 POD 文件。
zh_hant: Po4a 用於生成 PO 檔案的原始 POD 檔案。

source: NAME
sv: NAMN
zh_hans: 名称
zh_hant: 名稱

source: po4a - update both the PO files and translated documents in one shot
sv: po4a – uppdatera både PO-filerna och översatta dokument på en gång
zh_hans: po4a - 一次性更新 PO 文件和翻译文档
zh_hant: po4a - 一次性更新 PO 檔案和翻譯文件

source: po4a (PO for anything) eases the maintenance of documentation translation using the classical gettext tools. The main feature of po4a is that it decouples the translation of content from its document structure. Please refer to the page L<po4a(7)> for a gentle introduction to this project.
sv: po4a (PO för allt) underlättar underhållet av dokumentationsöversättningar med hjälp av de klassiska gettext-verktygen. Den viktigaste funktionen i po4a är att den separerar översättningen av innehållet från dokumentstrukturen. Se sidan L<po4a(7)> för en enkel introduktion till detta projekt.
zh_hans: po4a (PO 代表任何东西)使用经典的 gettext 工具简化了文档翻译的维护。po4a 的主要特点是将内容的翻译与文档结构分离。请参阅 L<po4a(7)> 页了解本项目的详细介绍。
zh_hant: po4a (PO 代表任何東西)使用經典的 gettext 工具簡化了文件翻譯的維護。po4a 的主要特點是將內容的翻譯與文件結構分離。請參閱 L<po4a(7)> 頁瞭解本專案的詳細介紹。

source: Upon execution, B<po4a> parses all documentation files specified in its configuration file. It updates the PO files (containing the translation) to reflect any change to the documentation, and produce a translated documentation by injecting the content's translation (found in the PO files) into the structure of the original master document.
sv: Vid körning analyserar B<po4a> alla dokumentationsfiler som anges i dess konfigurationsfil. Det uppdaterar PO-filerna (som innehåller översättningen) för att återspegla eventuella ändringar i dokumentationen och producerar en översatt dokumentation genom att infoga översättningen av innehållet (som finns i PO-filerna) i strukturen för det ursprungliga huvuddokumentet.

source: At first, the PO files only contain the strings to translate from the original documentation. This file format allows the translators to manually provide a translation for each paragraph extracted by B<po4a>. If the documentation is modified after translation, B<po4a> marks the corresponding translations as "fuzzy" in the PO file to request a manual review by the translators. The translators can also provide so-called "addendum", that are extra content stating for example who did the translation and how to report bugs.
sv: Inledningsvis innehåller PO-filerna endast de strängar som ska översättas från den ursprungliga dokumentationen. Detta filformat gör det möjligt för översättarna att manuellt tillhandahålla en översättning för varje stycke som extraherats av B<po4a>. Om dokumentationen modifieras efter översättningen markerar B<po4a> motsvarande översättningar som "fuzzy" i PO-filen för att begära en manuell granskning av översättarna. Översättarna kan också tillhandahålla så kallade "tillägg", som är extra innehåll som anger till exempel vem som har gjort översättningen och hur man rapporterar buggar.

source: The workflow of B<po4a> is asynchronous, as suited to open-source projects. The documentation writers author the master documents at their own pace. The translators review and update the translations in the PO files. The maintainers rerun B<po4a> on need, to reflect any change to the original documentation to the PO files, and to produce updated documentation translations, by injecting the latest translation into the latest document structure.
sv: Arbetsflödet i B<po4a> är asynkront, vilket passar bra för öppen källkodsprojekt. Dokumentationsförfattarna skriver huvuddokumenten i sin egen takt. Översättarna granskar och uppdaterar översättningarna i PO-filerna. Underhållarna kör B<po4a> vid behov för att återspegla eventuella ändringar i den ursprungliga dokumentationen i PO-filerna och för att producera uppdaterade dokumentationsöversättningar genom att infoga den senaste översättningen i den senaste dokumentstrukturen.

source: By default, a given translated document is produced when at least 80% of its content is translated. The untranslated text is kept in the original language. The produced documentation thus mixes languages if the translation is not complete. You can change the 80% threshold with the I<--keep> option described below. Note however that discarding translations as soon as they are not 100% may be discouraging for the translators whose work will almost never be shown to the users, while showing "translations" that are too incomplete may be troubling for the end users.
sv: Som standard skapas ett översatt dokument när minst 80 % av dess innehåll är översatt. Den oöversatta texten behålls på originalspråket. Den skapade dokumentationen blandar alltså språk om översättningen inte är fullständig. Du kan ändra tröskelvärdet på 80 % med flaggan I<--keep> som beskrivs nedan. Observera dock att det kan vara demotiverande för översättarna att deras arbete nästan aldrig visas för användarna om översättningarna kasseras så snart de inte är 100 % färdiga, medan det kan vara störande för slutanvändarna om "översättningar" som är för ofullständiga visas.

source: Storing the translated documentation files in the version control system is probably a bad idea, since they are automatically generated. The precious files are the PO files, that contain the hard work of your fellow translators. Also, some people find it easier to interact with the translators through an online platform such as S<weblate>, but this is naturally fully optional.
sv: Att lagra de översatta dokumentationsfilerna i versionshanteringssystemet är förmodligen en dålig idé, eftersom de genereras automatiskt. De värdefulla filerna är PO-filerna, som innehåller det hårda arbete som dina kollegor har lagt ner. Vissa tycker också att det är enklare att kommunicera med översättarna via en onlineplattform som S<weblate>, men detta är naturligtvis helt valfritt.

source: Quick start tutorial
sv: Snabbstartsguide

source: Let's assume you maintain a program named B<foo> which has a man page F<man/foo.1> written in English (the bridge language in most open-source projects, but B<po4a> can be used from or to any language). Some times ago, someone provided a German translation named F<man/foo.de.1> and disappeared. This is a problem because you just got a bug report saying that your documentation contains a gravely misleading information that must be fixed in all languages, but you don't speak German so you can only modify the original, not the translation. Now, another contributor wants to contribute a translation to Japanese, a language that you don't master either.
sv: Låt oss anta att du underhåller ett program som heter B<foo> som har en man-sida F<man/foo.1> skriven på engelska (det gemensamma språket i de flesta öppen källkodsprojekt, men B<po4a> kan användas från eller till vilket språk som helst). För en tid sedan tillhandahöll någon en tysk översättning med namnet F<man/foo.de.1> och försvann sedan. Detta är ett problem eftersom du just fått en felrapport om att din dokumentation innehåller allvarligt missvisande information som måste korrigeras på alla språk, men du talar inte tyska så du kan bara ändra originalet, inte översättningen. Nu vill en annan bidragsgivare bidra med en översättning till japanska, ett språk som du inte heller behärskar.

source: It is time to convert your documentation to B<po4a> to solve your documentation maintenance nightmares. You want to update the doc when needed, you want to ease the work of your fellow translators, and you want to ensure that your users never see any outdated and thus misleading documentation.
sv: Det är dags att konvertera din dokumentation till B<po4a> för att lösa dina dokumentationsunderhållsproblem. Du vill uppdatera dokumentationen när det behövs, du vill underlätta arbetet för dina kollegor och du vill se till att dina användare aldrig ser någon föråldrad och därmed missvisande dokumentation.

source: The conversion includes two steps: setup the po4a infrastructure, and convert the previous German translation to salvage the previous work. This latter part is done using S<po4a-gettextize>, as follows. As detailed in the documentation of L<po4a-gettextize(1)>, this process rarely fully automatic, but once it's done, the B<de.po> file containing the German translation can be integrated in your po4a workflow.
sv: Konverteringen består av två steg: installera po4a-infrastrukturen och konvertera den tidigare tyska översättningen för att rädda det tidigare arbetet. Den senare delen görs med hjälp av S<po4a-gettextize> enligt följande. Som beskrivs i dokumentationen för L<po4a-gettextize(1)> är denna process sällan helt automatisk, men när den väl är klar kan filen B<de.po> som innehåller den tyska översättningen integreras i ditt po4a-arbetsflöde.

source: Let's now configure po4a. With the appropriate file layout, your configuration file could be as simple as this:
sv: Låt oss nu konfigurera po4a. Med rätt filstruktur kan din konfigurationsfil se ut så här:

source: It specifies that all PO files (containing the work of the translators) are in the F<man/po4a/> directory, and that you have only one master file, F<man/foo.1>. If you had several master files, you would have several lines similar to the second one. Each such line also specify where to write the corresponding translation files. Here, the German translation of F<man/foo.1> is in F<man/translated/foo.de.1>.
sv: Det anger att alla PO-filer (som innehåller översättarnas arbete) finns i katalogen F<man/po4a/> och att du bara har en huvudfil, F<man/foo.1>. Om du hade flera huvudfiler skulle du ha flera rader som liknar den andra. Varje sådan rad anger också var motsvarande översättningsfiler ska skrivas. Här finns den tyska översättningen av F<man/foo.1> i F<man/translated/foo.de.1>.

source: The last thing we need to complete the configuration of B<po4a> is a POT file containing the template material that should be used to start a new translation. Simply create an empty file with the S<.pot> extension in the specified S<po_directory> (e.g. F<man/po4a/foo.pot>), and B<po4a> will fill it with the expected content.
sv: Det sista vi behöver för att slutföra konfigurationen av B<po4a> är en POT-fil som innehåller mallmaterialet som ska användas för att starta en ny översättning. Skapa helt enkelt en tom fil med filändelsen S<.pot> i den angivna S<po_directory> (t.ex. F<man/po4a/foo.pot>), så fyller B<po4a> den med det förväntade innehållet.

source: Here is a recap of the files in this setup:
sv: Här är en sammanfattning av filerna i denna installation:

source: ├── man/ │ ├── foo.1 <- The original man page, in English │ ├── po4a/ │ │ ├── de.po <- The German PO translation, from gettextization │ │ └── foo.pot <- The POT template of future translations (empty at first) │ └── translated/ <- Directory where the translations will be created └── po4a.cfg <- The configuration file
sv: ├── man/ │ ├── foo.1 <- Den ursprungliga man-sidan, på engelska │ ├── po4a/ │ │ ├── de.po <- Den tyska PO-översättningen, från gettextization │ │ └── foo.pot <- POT-mallen för framtida översättningar (tom i början) │ └── translated/ <- Katalog där översättningarna kommer att skapas └── po4a.cfg <- Konfigurationsfilen

source: Once setup, executing B<po4a> will parse your documentation, update the POT template file, use it to update the PO translation files, and use them to update the documentation translation files. All in one command:
sv: När det är konfigurerat kommer kommandot B<po4a> att analysera din dokumentation, uppdatera POT-mallfilen, använda den för att uppdatera PO-översättningsfilerna och använda dem för att uppdatera dokumentationsöversättningsfilerna. Allt i ett kommando:

source: This is it. B<po4a> is now fully configured. Once you've fixed your error in F<man/foo.1>, the offending paragraph in the German translation will be replaced by the fixed text in English. Mixing languages is not optimal, but it's the only way to remove errors in translations that you don't even understand, and ensure that the content presented to the users is never misleading. Updating the German translation is also much easier in the corresponding PO file, so the language mix-up may not last long. Finally, when a Japanese translator wants to contribute a new translation, she should rename the S<foo.pot> into S<ja.po> and complete the translation. Once you have this file, just drop it in F<man/po4a/po/>. A translated page will appear as F<man/translated/foo.ja.1> (provided that enough content is translated) when you run B<po4a> again.
sv: Det var allt. B<po4a> är nu helt konfigurerat. När du har rättat felet i F<man/foo.1> kommer den felaktiga paragrafen i den tyska översättningen att ersättas med den korrigerade texten på engelska. Att blanda språk är inte optimalt, men det är det enda sättet att ta bort fel i översättningar som du inte ens förstår och säkerställa att innehållet som presenteras för användarna aldrig är missvisande. Det är också mycket enklare att uppdatera den tyska översättningen i motsvarande PO-fil, så språkblandningen kanske inte varar så länge. Slutligen, när en japansk översättare vill bidra med en ny översättning, bör hon byta namn på S<foo.pot> till S<ja.po> och slutföra översättningen. När du har den här filen lägger du bara in den i F<man/po4a/po/>. En översatt sida visas som F<man/translated/foo.ja.1> (förutsatt att tillräckligt med innehåll är översatt) när du kör B<po4a> igen.

source: Minimal threshold for translation percentage to keep (i.e. write) the resulting file (default: 80). I.e. by default, files have to be translated at least at 80% to be written on disk.
sv: Minsta tröskelvärde för översättningsprocent för att behålla (dvs. skriva) den resulterande filen (standard: 80). Dvs. som standard måste filer översättas till minst 80% to för att skrivas till disk.
zh_hans: 保留(即写入)结果文件的转换百分比的最小阈值(默认值：80)。即，默认情况下，文件必须至少翻译 80% 才能写入磁盘。
zh_hant: 保留(即寫入)結果檔案的轉換百分比的最小閾值(預設值：80)。即，預設情況下，檔案必須至少翻譯 80% 才能寫入磁碟。

source: Column at which we should wrap the resulting file if the format supports it (default: 76). If the provided value is 0 or negative, then the resulting file will not be wraped at all. This is useful with some formats that could break when rewraped.
sv: Kolumn där vi ska bryta den resulterande filen om formatet stöder det (standard: 76). Om det angivna värdet är 0 eller negativt kommer den resulterande filen inte att brytas alls. Detta är användbart med vissa format som kan brytas när de bryts om.

source: Show a short help message.
sv: Visa ett kort hjälpmelding.
zh_hans: 显示简短的帮助消息。
zh_hant: 顯示簡短的幫助訊息。

source: Charset of the files containing the documents to translate. Note that all master documents must use the same charset.
sv: Teckenuppsättning för filerna som innehåller dokumenten som ska översättas. Observera att alla huvuddokument måste använda samma teckenuppsättning.
zh_hans: 包含要翻译的文档的文件字符集。请注意，所有主文档必须使用相同的字符集。
zh_hant: 包含要翻譯的文件的檔案字符集。請注意，所有主文件必須使用相同的字符集。

source: Charset of the files containing the localized documents. Note that all translated documents will use the same charset.
sv: Teckenuppsättning för filerna som innehåller de lokaliserade dokumenten. Observera att alla översatta dokument använder samma teckenuppsättning.
zh_hans: 包含本地化文档的文件字符集。请注意，所有翻译的文档将使用相同的字符集。
zh_hant: 包含本地化文件的檔案字符集。請注意，所有翻譯的文件將使用相同的字符集。

source: Charset of the addenda. Note that all the addenda should be in the same charset.
sv: Teckenuppsättning för tilläggen. Observera att alla tillägg ska ha samma teckenuppsättning.
zh_hans: 附录的字符集。请注意，所有附录应使用相同的字符集。
zh_hant: 附錄的字符集。請注意，所有附錄應使用相同的字符集。

source: Display the version of the script and exit.
sv: Visa versionen av skriptet och avsluta.
zh_hans: 显示脚本的版本并退出。
zh_hant: 顯示指令碼的版本並退出。

source: Increase the verbosity of the program.
sv: Öka programmets detaljeringsgrad.
zh_hans: 增加程序的冗长程度。
zh_hant: 增加程式的冗長程度。

source: Decrease the verbosity of the program.
sv: Minska programmets verbositet.
zh_hans: 减少程序的冗长。
zh_hant: 減少程式的冗長。

source: Output some debugging information.
sv: Skriv ut viss felsökningsinformation.
zh_hans: 输出一些调试信息。
zh_hant: 輸出一些除錯資訊。

source: Extra option(s) to pass to the format plugin. See the documentation of each plugin for more information about the valid options and their meanings. For example, you could pass '-o tablecells' to the AsciiDoc parser, while the text parser would accept '-o tabs=split'.
sv: Extra flaggor som ska skickas till formattillägget. Se dokumentationen för varje tillägg för mer information om giltiga flaggor och deras betydelse. Du kan till exempel skicka '-o tablecells' till AsciiDoc-parsern, medan textparsern accepterar '-o tabs=split'.
zh_hans: 要传递给格式插件的额外选项。有关有效选项及其含义的更多信息，请参阅每个插件的文档。例如，您可以将 '-o tablecells' 传递给 AsciiDoc 解析器，而文本解析器将接受 '-o tabs=split'。
zh_hant: 要傳遞給格式外掛的額外選項。有關有效選項及其含義的更多資訊，請參閱每個外掛的文件。例如，您可以將 '-o tablecells' 傳遞給 AsciiDoc 解析器，而文字解析器將接受 '-o tabs=split'。

source: Always generate the POT and PO files, even if B<po4a> considers it is not necessary.
sv: Generera alltid POT- och PO-filerna, även om B<po4a> anser att det inte är nödvändigt.
zh_hans: 始终生成 POT 和 PO 文件，即使 B<po4a> 认为没有必要。
zh_hant: 始終生成 POT 和 PO 檔案，即使 B<po4a> 認為沒有必要。

source: The default behavior (when B<--force> is not specified) is the following:
sv: Standardbeteendet (när B<--force> inte är angivet) är följande:
zh_hans: 默认行为(未指定 B<--force> 时)如下：
zh_hant: 預設行為(未指定 B<--force> 時)如下：
