Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: In the long run, I would like to drop the individual scripts and only maintain one version of this code. The sure thing is that the individual scripts will not get improved anymore, so only B<po4a> will get the new features. That being said, there is no deprecation urgency. I plan to keep the individual scripts as long as possible, and at least until 2030. If your project still use B<po4a-updatepo> and B<po4a-translate> in 2030, you may have a problem.
sv: På sikt skulle jag vilja slopa de enskilda skripten och bara behålla en version av den här koden. Det som är säkert är att de enskilda skripten inte kommer att förbättras längre, så endast B<po4a> kommer att få de nya funktionerna. Med det sagt finns det ingen brådska att fasa ut dem. Jag planerar att behålla de enskilda skripten så länge som möjligt, och åtminstone fram till 2030. Om ditt projekt fortfarande använder B<po4a-updatepo> och B<po4a-translate> år 2030 kan du få problem.

source: We may also remove the deprecation of these scripts at some point, if a refactoring reduces the code duplication to zero. If you have an idea (or better: a patch), your help is welcome.
sv: Vi kan också ta bort avvecklingen av dessa skript vid någon tidpunkt, om en omstrukturering minskar koddupliceringen till noll. Om du har en idé (eller ännu bättre: en patch), är din hjälp välkommen.

source: What about the other translation tools for documentation using gettext?
sv: Hur är det med andra översättningsverktyg för dokumentation som använder gettext?
zh_hans: 其他使用 gettext 的文档翻译工具又如何呢？
zh_hant: 其他使用 gettext 的文件翻譯工具又如何呢？

source: There are a few of them. Here is a possibly incomplete list, and more tools are coming at the horizon.
sv: Det finns några stycken. Här är en lista som kanske inte är komplett, och fler verktyg är på väg.

source: This is the tool developed by KDE people to handle DocBook XML. AFAIK, it was the first program to extract strings to translate from documentation to PO files, and inject them back after translation.
sv: Detta är ett verktyg som utvecklats av KDE-teamet för att hantera DocBook XML. Såvitt jag vet var det det första programmet som extraherade strängar för översättning från dokumentation till PO-filer och infogade dem igen efter översättningen.
zh_hans: 这是 KDE 人员开发的处理 DocBook XML 的工具。AFAIK，它是第一个提取字符串以从文档转换为 PO 文件，并在转换后注入它们的程序。
zh_hant: 這是 KDE 人員開發的處理 DocBook XML 的工具。AFAIK，它是第一個提取字串以從文檔轉換為 PO 檔案，並在轉換後注入它們的程式。

source: It can only handle XML, and only a particular DTD. I'm quite unhappy with the handling of lists, which end in one big msgid. When the list become big, the chunk becomes harder to swallow.
sv: Den kan bara hantera XML och endast en viss DTD. Jag är ganska missnöjd med hanteringen av listor, som slutar i ett stort msgid. När listan blir stor blir biten svårare att smälta.
zh_hans: 它只能处理 XML，并且只能处理特定的 DTD。我对列表的处理很不满意，列表以一个大的 msgid 结尾。当清单变得很大时，大块就变得更难处理了。
zh_hant: 它只能處理 XML，並且只能處理特定的 DTD。我對列表的處理很不滿意，列表以一個大的 msgid 結尾。當清單變得很大時，大塊就變得更難處理了。

source: This program done by Denis Barbier is a sort of precursor of the po4a SGML module, which more or less deprecates it. As the name says, it handles only the DebianDoc DTD, which is more or less a deprecated DTD.
sv: Detta program, utvecklat av Denis Barbier, är en sorts föregångare till po4a SGML-modulen, som mer eller mindre har gjort det föråldrat. Som namnet antyder hanterar det endast DebianDoc DTD, som mer eller mindre är en föråldrad DTD.
zh_hans: 这个由 Denis Barbier 完成的程序是 po4a SGML 模块的一种前身，它或多或少地弃用了它。顾名思义，它只处理 DebianDoc DTD，这或多或少是一个过时的 DTD。
zh_hant: 這個由 Denis Barbier 完成的程式是 po4a SGML 模組的一種前身，它或多或少地棄用了它。顧名思義，它只處理 DebianDoc DTD，這或多或少是一個過時的 DTD。

source: Used by the GIMP Documentation Team since 2004, works quite well even if, as the name suggests, only with XML files and needs specially configured makefiles.
sv: Används av GIMP Documentation Team sedan 2004, fungerar ganska bra även om det, som namnet antyder, endast fungerar med XML-filer och kräver specialkonfigurerade makefiler.

source: The Sphinx Documentation Project also uses gettext extensively to manage its translations. Unfortunately, it works only for a few text formats, rest and markdown, although it is perhaps the only tool that does this managing the whole translation process.
sv: Sphinx Documentation Project använder också gettext i stor utsträckning för att hantera sina översättningar. Tyvärr fungerar det bara för några få textformat, rest och markdown, även om det kanske är det enda verktyget som hanterar hela översättningsprocessen.

source: The main advantages of po4a over them are the ease of extra content addition (which is even worse there) and the ability to achieve gettextization.
sv: De främsta fördelarna med po4a jämfört med dem är att det är enkelt att lägga till extra innehåll (vilket är ännu svårare där) och möjligheten att uppnå gettextisering.
zh_hans: 与它们相比，po4a 的主要优势是易于添加额外内容(这一点更糟糕)，以及实现获取文本的能力。
zh_hant: 與它們相比，po4a 的主要優勢是易於新增額外內容(這一點更糟糕)，以及實現獲取文字的能力。

source: SUMMARY of the advantages of the gettext based approach
sv: SAMMANFATTNING av fördelarna med den gettextbaserade metoden
zh_hans: 基于gettext 的方法的优点的摘要
zh_hant: 基於gettext 的方法的優點的摘要

source: The translations are not stored along with the original, which makes it possible to detect if translations become out of date.
sv: Översättningarna lagras inte tillsammans med originalet, vilket gör det möjligt att upptäcka om översättningarna blir inaktuella.
zh_hans: 翻译不会与原始版本一起存储，这使得可以检测翻译是否过时。
zh_hant: 翻譯不會與原始版本一起儲存，這使得可以檢測翻譯是否過時。

source: The translations are stored in separate files from each other, which prevents translators of different languages from interfering, both when submitting their patch and at the file encoding level.
sv: Översättningarna lagras i separata filer, vilket förhindrar att översättare av olika språk stör varandra, både när de skickar in sina patchar och på filkodningsnivå.
zh_hans: 翻译被存储在彼此独立的文件中，从而防止了不同语言的翻译者在提交补丁时和文件编码级别上的相互干扰。
zh_hant: 翻譯被儲存在彼此獨立的檔案中，從而防止了不同語言的翻譯者在提交補丁時和檔案編碼級別上的相互干擾。

source: It is based internally on B<gettext> (but B<po4a> offers a very simple interface so that you don't need to understand the internals to use it). That way, we don't have to re-implement the wheel, and because of their wide use, we can think that these tools are more or less bug free.
sv: Det baseras internt på B<gettext> (men B<po4a> erbjuder ett mycket enkelt gränssnitt så att du inte behöver förstå det interna för att kunna använda det). På så sätt behöver vi inte implementera hjulet på nytt, och tack vare deras breda användning kan vi anta att dessa verktyg är mer eller mindre buggfria.
zh_hans: 它在内部基于 B<gettext>（但是 B<po4a> 提供了一个非常简单的界面，因此您无需了解内部使用它）。 这样，我们不必重新实现，并且由于它们的广泛使用，我们可以认为这些工具或多或少没有错误。
zh_hant: 它在內部基於 B<gettext>（但是 B<po4a> 提供了一個非常簡單的介面，因此您無需了解內部使用它）。 這樣，我們不必重新實現，並且由於它們的廣泛使用，我們可以認為這些工具或多或少沒有錯誤。

source: Nothing changed for the end-user (beside the fact translations will hopefully be better maintained). The resulting documentation file distributed is exactly the same.
sv: Ingenting förändrades för slutanvändaren (förutom att översättningarna förhoppningsvis kommer att underhållas bättre). Den resulterande dokumentationsfilen som distribueras är exakt densamma.
zh_hans: 最终用户没有任何变化(除了翻译有望得到更好的维护)。 分发的结果文档文件完全相同。
zh_hant: 終端使用者沒有任何變化(除了翻譯有望得到更好的維護)。 分發的結果文件檔案完全相同。

source: No need for translators to learn a new file syntax and their favorite PO file editor (like Emacs' PO mode, Lokalize or Gtranslator) will work just fine.
sv: Översättare behöver inte lära sig någon ny filsyntax och deras favoritredigerare för PO-filer (som Emacs PO-läge, Lokalize eller Gtranslator) fungerar utan problem.
zh_hans: 翻译员不需要学习新的文件语法，他们最喜欢的 PO 文件编辑器(如 Emacs 的 PO 模式、Lokalize 或 GTranslator)就可以很好地工作。
zh_hant: 翻譯員不需要學習新的檔案語法，他們最喜歡的 PO 檔案編輯器(如 Emacs 的 PO 模式、Lokalize 或 GTranslator)就可以很好地工作。

source: gettext offers a simple way to get statistics about what is done, what should be reviewed and updated, and what is still to do. Some example can be found at those addresses:
sv: gettext erbjuder ett enkelt sätt att få statistik om vad som är gjort, vad som bör granskas och uppdateras och vad som återstår att göra. Några exempel finns på följande adresser:
zh_hans: gettext 提供了一种简单的方法来获取关于已经完成的工作、应该检查和更新的工作以及仍要做的工作的统计数据。可以在这些地址找到一些示例：
zh_hant: gettext 提供了一種簡單的方法來獲取關於已經完成的工作、應該檢查和更新的工作以及仍要做的工作的統計資料。可以在這些地址找到一些示例：

source: But everything isn't green, and this approach also has some disadvantages we have to deal with.
sv: Men allt är inte grönt, och denna strategi har också några nackdelar som vi måste ta itu med.
zh_hans: 但是，并非所有事物都是绿色的，而且这种方法还存在一些必须解决的缺点。
zh_hant: 但是，並非所有事物都是綠色的，而且這種方法還存在一些必須解決的缺點。

source: Addenda are somewhat strange at the first glance.
sv: Tillägg är något konstiga vid första anblicken.

source: You can't adapt the translated text to your preferences, like splitting a paragraph here, and joining two other ones there. But in some sense, if there is an issue with the original, it should be reported as a bug anyway.
sv: Du kan inte anpassa den översatta texten efter dina önskemål, till exempel dela upp ett stycke här och slå ihop två andra där. Men i viss mening bör ett problem med originalet ändå rapporteras som ett fel.
zh_hans: 您不能根据自己的喜好调整翻译后的文本，比如在这里拆分一个段落，在那里加入另外两个段落。但在某种意义上，如果原始版本有问题，无论如何都应该报告为 bug。
zh_hant: 您不能根據自己的喜好調整翻譯後的文字，比如在這裡拆分一個段落，在那裡加入另外兩個段落。但在某種意義上，如果原始版本有問題，無論如何都應該報告為 bug。

source: Even with an easy interface, it remains a new tool people have to learn.
sv: Även om gränssnittet är enkelt är det fortfarande ett nytt verktyg som människor måste lära sig.
zh_hans: 即使有一个简单的界面，它仍然是一个人们必须学习的新工具。
zh_hant: 即使有一個簡單的介面，它仍然是一個人們必須學習的新工具。

source: One of my dreams would be to integrate somehow po4a to Gtranslator or Lokalize. When a documentation file is opened, the strings are automatically extracted, and a translated file + po file can be written to disk. If we manage to do an MS Word (TM) module (or at least RTF) professional translators may even use it.
sv: En av mina drömmar skulle vara att på något sätt integrera po4a i Gtranslator eller Lokalize. När en dokumentationsfil öppnas extraheras strängarna automatiskt, och en översatt fil + po-fil kan skrivas till disken. Om vi lyckas skapa en MS Word (TM)-modul (eller åtminstone RTF) kan professionella översättare till och med använda den.
zh_hans: 我的梦想之一是以某种方式将 po4a 集成到 GTranslator 或 Lokalize 中。打开文档文件时，会自动提取字符串，并且可以将翻译后的文件 + po 文件写入磁盘。如果我们设法制作 MSWord(TM) 模块(或者至少是 RTF)，专业翻译人员甚至可以使用它。
zh_hant: 我的夢想之一是以某種方式將 po4a 整合到 GTranslator 或 Lokalize 中。開啟文件文件時，會自動提取字串，並且可以將翻譯後的檔案 + po 檔案寫入磁碟。如果我們設法制作 MSWord(TM) 模組(或者至少是 RTF)，專業翻譯人員甚至可以使用它。

source: The documentation of the all-in-one tool that you should use: L<po4a(1)>.
sv: Dokumentationen för det allt-i-ett-verktyg som du bör använda: L<po4a(1)>.
zh_hans: 您应该使用的多合一工具的文档：L<po4a(1)>。
zh_hant: 您應該使用的多合一工具的文件：L<po4a(1)>。

source: The documentation of the individual po4a scripts: L<po4a-gettextize(1)>, L<po4a-updatepo(1)>, L<po4a-translate(1)>, L<po4a-normalize(1)>.
sv: Dokumentationen för de enskilda po4a-skripten: L<po4a-gettextize(1)>, L<po4a-updatepo(1)>, L<po4a-translate(1)>, L<po4a-normalize(1)>.
zh_hans: 单个 po4a 脚本的文档： L<po4a-gettextize(1)>、L<po4a-updatepo(1)>、L<po4a-late(1)>、L<po4a-Normalize(1)>。
zh_hant: 單個 po4a 指令碼的文件： L<po4a-gettextize(1)>、L<po4a-updatepo(1)>、L<po4a-late(1)>、L<po4a-Normalize(1)>。

source: The additional helping scripts: L<msguntypot(1)>, L<po4a-display-man(1)>, L<po4a-display-pod(1)>.
sv: De ytterligare hjälpscripten: L<msguntypot(1)>, L<po4a-display-man(1)>, L<po4a-display-pod(1)>.
zh_hans: 其他帮助脚本：L<msgan typot(1)>、L<po4a-display-man(1)>、L<po4a-display-pod(1)>。
zh_hant: 其他幫助指令碼：L<msgan typot(1)>、L<po4a-display-man(1)>、L<po4a-display-pod(1)>。

source: The parser of each format, in particular to see the options they accept: L<Locale::Po4a::AsciiDoc(3pm)>, L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Gemtext(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Yaml(3pm)>, L<Locale::Po4a::BibTeX(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Org(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::SimplePod(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::VimHelp>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xml(3pm)>.
sv: Tolkaren för varje format, särskilt för att se vilka flaggor de accepterar: L<Locale::Po4a::AsciiDoc(3pm)>, L<Locale::Po4a::Dia(3pm)>, L<Locale::Po4a::Gemtext(3pm)>, L<Locale::Po4a::Guide(3pm)>, L<Locale::Po4a::Ini(3pm)>, L<Locale::Po4a::KernelHelp(3pm)>, L<Locale::Po4a::Man(3pm)>, L<Locale::Po4a::RubyDoc(3pm)>, L<Locale::Po4a::Texinfo(3pm)>, L<Locale::Po4a::Text(3pm)>, L<Locale::Po4a::Xhtml(3pm)>, L<Locale::Po4a::Yaml(3pm)>, L<Locale::Po4a::BibTeX(3pm)>, L<Locale::Po4a::Docbook(3pm)>, L<Locale::Po4a::Halibut(3pm)>, L<Locale::Po4a::LaTeX(3pm)>, L<Locale::Po4a::Org(3pm)>, L<Locale::Po4a::Pod(3pm)>, L<Locale::Po4a::SimplePod(3pm)>, L<Locale::Po4a::Sgml(3pm)>, L<Locale::Po4a::TeX(3pm)>, L<Locale::Po4a::VimHelp>, L<Locale::Po4a::Wml(3pm)>, L<Locale::Po4a::Xml(3pm)>.

source: The implementation of the core infrastructure: L<Locale::Po4a::TransTractor(3pm)> (particularly important to understand the code organization), L<Locale::Po4a::Chooser(3pm)>, L<Locale::Po4a::Po(3pm)>, L<Locale::Po4a::Common(3pm)>. Please also check the F<CONTRIBUTING.md> file in the source tree.
sv: Implementeringen av kärninfrastrukturen: L<Locale::Po4a::TransTractor(3pm)> (särskilt viktigt för att förstå kodens organisation), L<Locale::Po4a::Chooser(3pm)>, L<Locale::Po4a::Po(3pm)>, L<Locale::Po4a::Common(3pm)>. Se även filen F<CONTRIBUTING.md> i källkodsträdet.
zh_hans: 核心基础设施的实施：L<Locale::Po4a::TransTractor(3pm)> (particularly important to understand the code organization), L<Locale::Po4a::Chooser(3pm)>, L<Locale::Po4a::Po(3pm)>, L<Locale::Po4a::Common(3pm)>. 还请检查源代码树中的 F<CONTRIBUTING.md> 文件。
zh_hant: 核心基礎設施的實施：L<Locale::Po4a::TransTractor(3pm)> (particularly important to understand the code organization), L<Locale::Po4a::Chooser(3pm)>, L<Locale::Po4a::Po(3pm)>, L<Locale::Po4a::Common(3pm)>. 還請檢查原始碼樹中的 F<CONTRIBUTING.md> 檔案。

source: Locale::Po4a::AsciiDoc - convert AsciiDoc documents from/to PO files
sv: Locale::Po4a::AsciiDoc – konvertera AsciiDoc-dokument från/till PO-filer
zh_hans: Locale::Po4a::AsciiDoc - 从/到 PO 文件转换 AsciiDoc 文档
zh_hant: Locale::Po4a::AsciiDoc - 從/到 PO 檔案轉換 AsciiDoc 文件

source: Locale::Po4a::AsciiDoc is a module to help the translation of documentation in the AsciiDoc format.
sv: Locale::Po4a::AsciiDoc är ett modul som hjälper till med översättning av dokumentation i AsciiDoc-format.
zh_hans: Locale::Po4a::AsciiDoc 是一个帮助翻译 AsciiDoc 格式文档的模块。
zh_hant: Locale::Po4a::AsciiDoc 是一個幫助翻譯 AsciiDoc 格式文件的模組。

source: OPTIONS ACCEPTED BY THIS MODULE
sv: FLAGGOR SOM ACCEPTERAS AV DENNA MODUL
zh_hans: 此模块接受的选项
zh_hant: 此模組接受的選項

source: These are this module's particular options:
sv: Detta är modulens specifika flaggor:
zh_hans: 以下是此模块的特定选项：
zh_hant: 以下是此模組的特定選項：

source: The name of a file containing definitions for po4a, as defined in the B<INLINE CUSTOMIZATION> section. You can use this option if it is not possible to put the definitions in the document being translated.
sv: Namnet på en fil som innehåller definitioner för po4a, enligt definitionen i avsnittet B<INLINE CUSTOMIZATION>. Du kan använda denna flagga om det inte är möjligt att placera definitionerna i det dokument som översätts.
zh_hans: 包含 po4a 定义的文件的名称，如 B<INLINE CUSTOMIZATION> 部分中定义。 如果无法将定义放在要翻译的文档中，可以使用此选项。
zh_hant: 包含 po4a 定義的檔案的名稱，如 B<INLINE CUSTOMIZATION> 部分中定義。 如果無法將定義放在要翻譯的文件中，可以使用此選項。

source: In a definitions file, lines must not start by two slashes, but directly by B<po4a:>.
sv: I en definitionsfil får rader inte börja med två snedstreck, utan direkt med B<po4a:>.
zh_hans: 在定义文件中，行不能以两个斜杠开始，而直接由 B<po4a:> 开始。
zh_hant: 在定義檔案中，行不能以兩個斜槓開始，而直接由 B<po4a:> 開始。

source: Space-separated list of attribute entries you want to translate. By default, no attribute entries are translatable.
sv: En lista med attributposter som du vill översätta, separerade med mellanslag. Som standard är inga attributposter översättningsbara.
zh_hans: 要转换的属性条目的空格分隔列表。默认情况下，没有属性条目是可翻译的。
zh_hant: 要轉換的屬性條目的空格分隔列表。預設情況下，沒有屬性條目是可翻譯的。

source: Space-separated list of macro definitions.
sv: Mellanslagsavgränsad lista över makrodefinitioner.
zh_hans: 空格分隔的宏定义列表。
zh_hant: 空格分隔的宏定義列表。

source: Space-separated list of style definitions.
sv: Lista med stildefinitioner separerade med mellanslag.
zh_hans: 以空格分隔的样式定义列表。
zh_hant: 以空格分隔的樣式定義列表。

source: Enable automatic line wrapping in non-verbatim blocks, even if the result could be misinterpreted by AsciiDoc formatters.
sv: Aktivera automatisk radbrytning i icke-verbatim-block, även om resultatet kan misstolkas av AsciiDoc-formaterare.
zh_hans: 启用非逐字块中的自动行换行，即使结果可能被 AsciiDoc 格式器误解。
zh_hant: 啟用非逐字塊中的自動行換行，即使結果可能被 AsciiDoc 格式器誤解。

source: By default, po4a will not wrap the produced AsciiDoc files because a manual inspection is mandated to ensure that the wrapping does not change the formatting. Consider for instance the following list item:
sv: Som standard kommer po4a inte att bryta de producerade AsciiDoc-filerna eftersom en manuell kontroll krävs för att säkerställa att brytningen inte ändrar formateringen. Tänk till exempel på följande listpunkt:
zh_hans: 默认情况下，po4a 不会对生成的 AsciiDoc 文件进行封装，因为强制执行手动检查以确保封装不会更改格式。例如，请考虑以下列表项：
zh_hant: 預設情況下，po4a 不會對生成的 AsciiDoc 檔案進行封裝，因為強制執行手動檢查以確保封裝不會更改格式。例如，請考慮以下列表項：

source: * a long sentence that is ending with a number 1. A second sentence.
sv: * en lång mening som slutar med siffran 1. En andra mening.

source: If the wrapping leads to the following presentation, the item is split into a numbered sub-list. To make things worse, only the speakers of the language used in the translation can inspect the situation.
sv: Om omslaget leder till följande presentation delas artikeln upp i en numrerad underlista. För att göra saken ännu värre är det bara de som talar det språk som används i översättningen som kan granska situationen.
zh_hans: 如果换行指向以下演示文稿，则该项目将被拆分到一个带编号的子列表中。更糟糕的是，只有使用翻译语言的人才能检查情况。
zh_hant: 如果換行指向以下簡報，則該專案將被拆分到一個帶編號的子列表中。更糟糕的是，只有使用翻譯語言的人才能檢查情況。

source: * a long sentence that is ending with a number 1. A second sentence.
sv: * en lång mening som slutar med siffran 1. En andra mening.

source: Note that not wrapping the files produced by po4a should not be a problem since those files are meant to be processed automatically. They should not be regarded as source files anyway.
sv: Observera att det inte bör vara något problem att inte packa in filerna som skapas av po4a, eftersom dessa filer är avsedda att bearbetas automatiskt. De bör ändå inte betraktas som källfiler.
zh_hans: 请注意，不封装 po4a 生成的文件应该不是问题，因为这些文件是自动处理的。它们无论如何都不应该被视为源文件。
zh_hant: 請注意，不封裝 po4a 生成的檔案應該不是問題，因為這些檔案是自動處理的。它們無論如何都不應該被視為原始檔。

source: With this option, po4a will produce better-looking AsciiDoc files, but it may lead to possibly erroneous formatted outputs.
sv: Med denna flagga kommer po4a att producera snyggare AsciiDoc-filer, men det kan leda till eventuellt felaktigt formaterade utdata.

source: By default, the targets of block images are translatable to give opportunity to make the content point to translated images. This can be stopped by setting this option.
sv: Som standard är målen för blockbilder översättningsbara för att ge möjlighet att peka innehållet mot översatta bilder. Detta kan stoppas genom att ställa in denna flagga.
zh_hans: 默认情况下，块图像的目标是可翻译的，以提供使内容指向已翻译图像的机会。可以通过设置此选项来停止此操作。
zh_hant: 預設情況下，塊影象的目標是可翻譯的，以提供使內容指向已翻譯影象的機會。可以通過設定此選項來停止此操作。

source: This option is a flag that enables sub-table segmentation into cell content. The segmentation is limited to cell content, without any parsing inside of it.
sv: Den här flaggan är en flagga som aktiverar segmentering av undertabeller i cellinnehåll. Segmenteringen är begränsad till cellinnehåll, utan någon analys inuti det.
zh_hans: 此选项是启用子表分割为单元格内容的标志。分割仅限于单元格内容，其中没有任何解析。
zh_hant: 此選項是啟用子表分割為單元格內容的標誌。分割僅限於單元格內容，其中沒有任何解析。

source: Switch parsing rules to compatibility with different tools. Available options are "asciidoc" or "asciidoctor". Asciidoctor has stricter parsing rules, such as equality of length of opening and closing block fences.
sv: Ändra parsningsreglerna för kompatibilitet med olika verktyg. Tillgängliga flaggor är "asciidoc" eller "asciidoctor". Asciidoctor har strängare tolkningsregler, såsom att längden på öppnande och stängande blockfences måste vara lika.
zh_hans: 将解析规则切换为与不同工具兼容。可用选项为 "asciidoc" 或 "asciidoctor"。Asciidoctor 有更严格的解析规则，例如打开和关闭块围栏的长度相等。
zh_hant: 將解析規則切換為與不同工具相容。可用選項為 "asciidoc" 或 "asciidoctor"。Asciidoctor 有更嚴格的解析規則，例如開啟和關閉塊圍欄的長度相等。

source: Disable linting messages. When the source code cannot be fixed for clearer document structure, these messages are useless.
sv: Inaktivera linting-meddelanden. När källkoden inte kan korrigeras för en tydligare dokumentstruktur är dessa meddelanden meningslösa.
zh_hans: 禁用发送邮件。当无法修复源代码以使文档结构更清晰时，这些消息将毫无用处。
zh_hant: 禁用傳送郵件。當無法修復原始碼以使文件結構更清晰時，這些訊息將毫無用處。

source: Remove extra spaces from the source segments in no-wrap mode. This is useful when the translation tools are sensitive to the number of spaces.
sv: Ta bort extra mellanslag från källsegmenten i läget utan radbrytning. Detta är användbart när översättningsverktygen är känsliga för antalet mellanslag.

source: Comma-separated list of keys to process for translation in the YAML Front Matter section. All other keys are skipped. Keys are matched with a case-sensitive match. If B<yfm_paths> and B<yfm_keys> are used together, values are included if they are matched by at least one of the options. Array values are always translated, unless the B<yfm_skip_array> option is provided.
sv: Kommaseparerad lista över nycklar som ska bearbetas för översättning i YAML Front Matter-sektionen. Alla andra nycklar hoppas över. Nycklar matchas med en skiftlägeskänslig matchning. Om B<yfm_paths> och B<yfm_keys> används tillsammans inkluderas värden om de matchas av minst en av flaggorna. Arrayvärden översätts alltid, såvida inte flaggan B<yfm_skip_array> anges.

source: Do not translate array values in the YAML Front Matter section.
sv: Översätt inte arrayvärden i YAML Front Matter-sektionen.
zh_hans: 不要转换 YAML Front Matter 部分中的数组值。
zh_hant: 不要轉換 YAML Front Matter 部分中的陣列值。

source: Comma-separated list of hash paths to process for extraction in the YAML Front Matter section, all other paths are skipped. Paths are matched with a case-sensitive match. If B<yfm_paths> and B<yfm_keys> are used together, values are included if they are matched by at least one of the options. Arrays values are always returned unless the B<yfm_skip_array> option is provided.
sv: Kommaseparerad lista över hashvägar som ska bearbetas för extrahering i YAML Front Matter-sektionen, alla andra vägar hoppas över. Vägar matchas med en skiftlägeskänslig matchning. Om B<yfm_paths> och B<yfm_keys> används tillsammans inkluderas värden om de matchas av minst en av flaggorna. Arrayvärden returneras alltid om inte flaggan B<yfm_skip_array> anges.

source: INLINE CUSTOMIZATION
sv: INLINE-ANPASSNING
zh_hans: 在线定制
zh_hant: 線上定製

source: The AsciiDoc module can be customized with lines starting by B<//po4a:>. These lines are interpreted as commands to the parser. The following commands are recognized:
sv: AsciiDoc-modulen kan anpassas med rader som börjar med B<//po4a:>. Dessa rader tolkas som kommandon till parsern. Följande kommandon känns igen:
zh_hans: AsciiDoc 模块可自定义由 B<//po4a:>。 这些行被解释为解析器的命令。 识别以下命令：
zh_hant: AsciiDoc 模組可自定義由 B<//po4a:>。 這些行被解釋為解析器的命令。 識別以下命令：
