Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: There are some options (described in the next section) that can customize this behavior. If this doesn't fit to your document format you're encouraged to write your own module derived from this, to describe your format's details. See the section B<WRITING DERIVATE MODULES> below, for the process description.
sv: Det finns några flaggor (beskrivna i nästa avsnitt) som kan anpassa detta beteende. Om detta inte passar ditt dokumentformat uppmuntras du att skriva din egen modul som härrör från denna, för att beskriva detaljerna i ditt format. Se avsnittet B-<WRITING DERIVATE MODULES> en nedan för en beskrivning av processen.
zh_hans: 有一些选项 (将在下一节中介绍) 可以自定义此行为。如果这不适合您的文档格式，则鼓励您编写由此衍生的您自己的模块，以描述您的格式的详细信息。有关过程描述，请参阅下面的 B<WRITING DERIVATE MODULES> 小节。
zh_hant: 有一些選項 (將在下一節中介紹) 可以自定義此行為。如果這不適合您的文件格式，則鼓勵您編寫由此衍生的您自己的模組，以描述您的格式的詳細資訊。有關過程描述，請參閱下面的 B<WRITING DERIVATE MODULES> 小節。

source: The global debug option causes this module to show the excluded strings, in order to see if it skips something important.
sv: Det globala felsökningsflaggan gör att denna modul visar de uteslutna strängarna, för att se om den hoppar över något viktigt.
zh_hans: 全局调试选项会导致此模块显示排除的字符串，以查看它是否跳过了重要内容。
zh_hant: 全域性除錯選項會導致此模組顯示排除的字串，以檢視它是否跳過了重要內容。

source: Prevents it to strip the spaces around the extracted strings.
sv: Förhindrar att mellanslag runt de extraherade strängarna tas bort.
zh_hans: 防止它剥离提取字符串周围的空格。
zh_hant: 防止它剝離提取字串周圍的空格。

source: Canonicalizes the string to translate, considering that whitespaces are not important, and wraps the translated document. This option can be overridden by custom tag options. See the B<translated> option below.
sv: Kanoniserar strängen som ska översättas, med hänsyn till att blanktecken inte är viktiga, och slår in det översatta dokumentet. Denna flagga kan åsidosättas av anpassade taggflaggor. Se flaggan B-<translated> nedan.
zh_hans: 考虑到空格并不重要，规范化要翻译的字符串，并对翻译后的文档进行换行。自定义标记选项可以覆盖此选项。请参阅下面的 B<translated> 选项。
zh_hant: 考慮到空格並不重要，規範化要翻譯的字串，並對翻譯後的文件進行換行。自定義標記選項可以覆蓋此選項。請參閱下面的 B<translated> 選項。

source: Attributes are wrapped by default. This option disables wrapping.
sv: Attribut är som standard inslagna. Den här flaggan inaktiverar inslagningen.
zh_hans: 默认情况下，属性是换行的。此选项禁用换行。
zh_hant: 預設情況下，屬性是換行的。此選項禁用換行。

source: It makes the tags and attributes searching to work in a case insensitive way. If it's defined, it will treat E<lt>BooKE<gt>laNG and E<lt>BOOKE<gt>Lang as E<lt>bookE<gt>lang.
sv: Det gör att sökningen efter taggar och attribut fungerar utan hänsyn till versaler och gemener. Om det är definierat kommer det att behandla E<lt>BooKE<gt>laNG och E<lt>BOOKE<gt>Lang som E<lt>bookE<gt>lang.
zh_hans: 它使标签和属性搜索以不区分大小写的方式工作。如果定义了它，它会将 E<lt>BooKE<gt>laNG 和 E<lt>BOOKE<gt>Lang 视为 E<lt>bookE<gt>lang。
zh_hant: 它使標籤和屬性搜尋以不區分大小寫的方式工作。如果定義了它，它會將 E<lt>BooKE<gt>laNG 和 E<lt>BOOKE<gt>Lang 視為 E<lt>bookE<gt>lang。

source: Escape quotes in output strings. Necessary, for example, for creating string resources for use by Android build tools.
sv: Undvik citattecken i utdatasträngar. Nödvändigt, till exempel för att skapa strängresurser för användning av Android-byggverktyg.
zh_hans: 输出字符串中的转义引号。例如，创建供 Android 构建工具使用的字符串资源时是必需的。
zh_hant: 輸出字串中的轉義引號。例如，建立供 Android 構建工具使用的字串資源時是必需的。

source: See also: https://developer.android.com/guide/topics/resources/string-resource.html
sv: Se även: https://developer.android.com/guide/topics/resources/string-resource.html
zh_hans: 另请参阅：https://developer.android.com/guide/topics/resources/string-resource.html
zh_hant: 另請參閱：https://developer.android.com/guide/topics/resources/string-resource.html

source: When defined, external entities are included in the generated (translated) document, and for the extraction of strings. If it's not defined, you will have to translate external entities separately as independent documents.
sv: När externa enheter definieras inkluderas de i det genererade (översatta) dokumentet och för extrahering av strängar. Om de inte definieras måste du översätta externa enheter separat som oberoende dokument.
zh_hans: 定义后，外部实体将包括在生成的 (翻译的) 文档中，并用于提取字符串。如果未定义，则必须将外部实体单独转换为独立文档。
zh_hant: 定義後，外部實體將包括在生成的 (翻譯的) 文件中，並用於提取字串。如果未定義，則必須將外部實體單獨轉換為獨立文件。

source: This option defines the behavior of the module when it encounters invalid XML syntax (a closing tag which does not match the last opening tag). It can take the following values:
sv: Den här flaggan definierar modulens beteende när den stöter på ogiltig XML-syntax (en avslutande tagg som inte matchar den sista öppnande taggen). Det kan ha följande värden:
zh_hans: 此选项定义模块遇到无效 XML 语法 (结束标记与最后一个开始标记不匹配) 时的行为。它可以采用以下值：
zh_hant: 此選項定義模組遇到無效 XML 語法 (結束標記與最後一個開始標記不匹配) 時的行為。它可以採用以下值：

source: This is the default value. The module will exit with an error.
sv: Detta är standardvärdet. Modulen avslutas med ett felmeddelande.
zh_hans: 这是默认值。模块将退出，并出现错误。
zh_hant: 這是預設值。模組將退出，並出現錯誤。

source: The module will continue, and will issue a warning.
sv: Modulen fortsätter och utfärdar en varning.
zh_hans: 该模块将继续运行，并发出警告。
zh_hant: 該模組將繼續執行，併發出警告。

source: The module will continue without any warnings.
sv: Modulen fortsätter utan några varningar.
zh_hans: 模块将继续，没有任何警告。
zh_hant: 模組將繼續，沒有任何警告。

source: Be careful when using this option. It is generally recommended to fix the input file.
sv: Var försiktig när du använder den här flaggan. Det rekommenderas generellt att fixa inmatningsfilen.
zh_hans: 使用此选项时要小心。通常建议修复输入文件。
zh_hant: 使用此選項時要小心。通常建議修復輸入檔案。

source: Note: This option is deprecated.
sv: Observera: Den här flaggan är föråldrad.
zh_hans: 注意：此选项已弃用。
zh_hant: 注意：此選項已棄用。

source: Extracts only the specified tags in the B<tags> option. Otherwise, it will extract all the tags except the ones specified.
sv: Extraherar endast de angivna taggarna i flaggan B-<tags>. Annars extraheras alla taggar utom de angivna.
zh_hans: 仅提取 B<tags> 选项中指定的标记。否则，它将提取除指定标记之外的所有标记。
zh_hant: 僅提取 B<tags> 選項中指定的標記。否則，它將提取除指定標記之外的所有標記。

source: String that will try to match with the first line of the document's doctype (if defined). If it doesn't, a warning will indicate that the document might be of a bad type.
sv: Sträng som försöker matcha den första raden i dokumentets doctype (om sådan finns definierad). Om den inte matchar visas en varning om att dokumentet kan vara av fel typ.
zh_hans: 尝试与文档的 doctype 的第一行匹配的字符串(如果已定义)。如果不是，则会出现一条警告，指示该文档的类型可能不正确。
zh_hant: 嘗試與文件的 doctype 的第一行匹配的字串(如果已定義)。如果不是，則會出現一條警告，指示該文件的型別可能不正確。

source: String indicating the path (e.g. E<lt>bbbE<gt>E<lt>aaaE<gt>) of a tag where a lang="..." attribute shall be added. The language will be defined as the basename of the PO file without any .po extension.
sv: Sträng som anger sökvägen (t.ex. E<lt>bbbE<gt>E<lt>aaaE<gt>) till en tagg där attributet lang="..." ska läggas till. Språket definieras som basnamnet på PO-filen utan filändelsen .po.
zh_hans: 指示标记的路径 (例如，E<lt>bbbE<gt>E<lt>aaaE<gt>) 的字符串，其中 lang="..." 需要增加属性。语言将定义为 PO 文件的基本名称，不带任何 .po 扩展名。
zh_hant: 指示標記的路徑 (例如，E<lt>bbbE<gt>E<lt>aaaE<gt>) 的字串，其中 lang="..." 需要增加屬性。語言將定義為 PO 檔案的基本名稱，不帶任何 .po 副檔名。

source: Boolean indicating whether closing tags are optional (as in HTML). By default, missing closing tags raise an error handled according to B<ontagerror>.
sv: Boolesk variabel som anger om slutetaggar är valfria (som i HTML). Som standard genererar saknade slutetaggar ett fel som hanteras enligt B<ontagerror>.
zh_hans: 指示关闭标记是否可选的布尔值（如 HTML 中所示）。默认情况下，缺少的关闭标记会引发根据 B<ontagerror> 处理的错误。
zh_hant: 指示關閉標記是否可選的布林值（如 HTML 中所示）。預設情況下，缺少的關閉標記會引發根據 B<ontagerror> 處理的錯誤。

source: Note: This option is deprecated. You should use the B<translated> and B<untranslated> options instead.
sv: Observera: Den här flaggan är föråldrad. Du bör istället använda flaggorna B<translated> och B<untranslated>.
zh_hans: 注意：此选项已弃用。您应该改用 B<translated> 和 B<untranslated> 选项。
zh_hant: 注意：此選項已棄用。您應該改用 B<translated> 和 B<untranslated> 選項。

source: Space-separated list of tags you want to translate or skip. By default, the specified tags will be excluded, but if you use the "tagsonly" option, the specified tags will be the only ones included. The tags must be in the form E<lt>aaaE<gt>, but you can join some (E<lt>bbbE<gt>E<lt>aaaE<gt>) to say that the content of the tag E<lt>aaaE<gt> will only be translated when it's into a E<lt>bbbE<gt> tag.
sv: En lista med taggar som du vill översätta eller hoppa över, separerade med mellanslag. Som standard kommer de angivna taggarna att exkluderas, men om du använder flaggan "tagsonly" kommer endast de angivna taggarna att inkluderas. Taggarna måste ha formen E<lt>aaaE<gt>, men du kan slå ihop några (E<lt>bbbE<gt>E<lt>aaaE<gt>) för att ange att innehållet i taggen E<lt>aaaE<gt> endast ska översättas när det finns i en E<lt>bbbE<gt> tagg.
zh_hans: 要翻译或跳过的以空格分隔的标签列表。默认情况下，将排除指定的标记，但如果使用 "tagsonly" 选项，则只包含指定的标记。标记的格式必须是 E<lt>aaaE<gt>，但是您可以加入一些 (E<lt>bbbE<gt>E<lt>aaaE<gt>)，说明标记 E<lt>aaaE<gt> 的内容只有在转换为 E<lt>bbbE<gt> 标记时才会被转换。
zh_hant: 要翻譯或跳過的以空格分隔的標籤列表。預設情況下，將排除指定的標記，但如果使用 "tagsonly" 選項，則只包含指定的標記。標記的格式必須是 E<lt>aaaE<gt>，但是您可以加入一些 (E<lt>bbbE<gt>E<lt>aaaE<gt>)，說明標記 E<lt>aaaE<gt> 的內容只有在轉換為 E<lt>bbbE<gt> 標記時才會被轉換。

source: You can also specify some tag options by putting some characters in front of the tag hierarchy. For example, you can put I<w> (wrap) or I<W> (don't wrap) to override the default behavior specified by the global B<wrap> option.
sv: Du kan också ange vissa taggflaggor genom att placera vissa tecken framför tagghierarkin. Du kan till exempel placera I<w> (bryt) eller I<W> (bryt inte) för att åsidosätta standardbeteendet som anges av det globala flaggan B<wrap>.
zh_hans: 您还可以通过在标签层次结构前面放置一些字符来指定一些标签选项。例如，您可以放入 'W' (换行) 或 'W' (不换行) 来覆盖全局 B<wrap> 选项指定的默认行为。
zh_hant: 您還可以透過在標籤層次結構前面放置一些字元來指定一些標籤選項。例如，您可以放入 'W' (換行) 或 'W' (不換行) 來覆蓋全域性 B<wrap> 選項指定的預設行為。

source: Example: WE<lt>chapterE<gt>E<lt>titleE<gt>
sv: Exempel: WE<lt>chapterE<gt>E<lt>titleE<gt>
zh_hans: 例如：WE<lt>chapterE<gt>E<lt>titleE<gt>
zh_hant: 例如：WE<lt>chapterE<gt>E<lt>titleE<gt>

source: Space-separated list of tag's attributes you want to translate. You can specify the attributes by their name (for example, "lang"), but you can prefix it with a tag hierarchy, to specify that this attribute will only be translated when it's in the specified tag. For example: E<lt>bbbE<gt>E<lt>aaaE<gt>lang specifies that the lang attribute will only be translated if it's in an E<lt>aaaE<gt> tag, and it's in a E<lt>bbbE<gt> tag.
sv: En lista med taggattribut som du vill översätta, separerade med mellanslag. Du kan ange attributen med deras namn (till exempel "lang"), men du kan också lägga till en tagghierarki framför namnet för att ange att attributet endast ska översättas när det finns i den angivna taggen. Till exempel: E<lt>bbbE<gt>E<lt>aaaE<gt>lang anger att attributet lang endast ska översättas om det finns i en E<lt>aaaE<gt> tagg och om det finns i en E<lt>bbbE<gt> tagg.
zh_hans: 要转换的标记属性的空格分隔列表。您可以按名称指定属性 (例如，"lang")，但可以在其前面加上标记层次结构，以指定此属性仅在其位于指定的标记中时才会被转换。例如：E<lt>bbbE<gt>E<lt>aaaE<gt>lang 指定只有当 lang 属性在 E<lt>aaaE<gt> 标记中，并且它在 E<lt>bbbE<gt> 标记中时，lang 属性才会被转换。
zh_hant: 要轉換的標記屬性的空格分隔列表。您可以按名稱指定屬性 (例如，"lang")，但可以在其前面加上標記層次結構，以指定此屬性僅在其位於指定的標記中時才會被轉換。例如：E<lt>bbbE<gt>E<lt>aaaE<gt>lang 指定只有當 lang 屬性在 E<lt>aaaE<gt> 標記中，並且它在 E<lt>bbbE<gt> 標記中時，lang 屬性才會被轉換。

source: Do not translate attributes in inline tags. Instead, replace all attributes of a tag by po4a-id=<id>.
sv: Översätt inte attribut i inline-taggar. Ersätt istället alla attribut i en tagg med po4a-id=<id>.
zh_hans: 不要转换行内标签中的属性。相反，将标记的所有属性替换为 po4a-id=<id>。
zh_hant: 不要轉換行內標籤中的屬性。相反，將標記的所有屬性替換為 po4a-id=<id>。

source: This is useful when attributes shall not be translated, as this simplifies the strings for translators, and avoids typos.
sv: Detta är användbart när attribut inte ska översättas, eftersom det förenklar strängarna för översättare och undviker stavfel.
zh_hans: 当属性不应该被翻译时，这很有用，因为这简化了翻译人员的字符串，并避免了打字错误。
zh_hant: 當屬性不應該被翻譯時，這很有用，因為這簡化了翻譯人員的字串，並避免了打字錯誤。

source: Space-separated list of tags which should not be treated as tags. These tags are treated as inline, and do not need to be closed.
sv: Mellanslagsavgränsad lista över taggar som inte ska behandlas som taggar. Dessa taggar behandlas som inline och behöver inte stängas.
zh_hans: 不应视为标记的以空格分隔的标记列表。这些标记被视为内联标记，不需要关闭。
zh_hant: 不應視為標記的以空格分隔的標記列表。這些標記被視為內聯標記，不需要關閉。

source: Space-separated list of tags which should break the sequence. By default, all tags break the sequence.
sv: Lista med taggar separerade med mellanslag som ska bryta sekvensen. Som standard bryter alla taggar sekvensen.
zh_hans: 空格分隔的应中断序列的标记列表。默认情况下，所有标签都会打破顺序。
zh_hant: 空格分隔的應中斷序列的標記列表。預設情況下，所有標籤都會打破順序。

source: The tags must be in the form <aaa>, but you can join some (<bbb><aaa>), if a tag (<aaa>) should only be considered when it's within another tag (<bbb>).
sv: Taggarna måste ha formen <aaa>, men du kan sammanfoga några (<bbb><aaa>), om en tagg (<aaa>) endast ska beaktas när den finns inom en annan tagg (<bbb>).
zh_hans: 标记的形式必须为 <aaa>，但如果标记 (<aaa>) 仅在另一个标记 (<bbb>) 内时才应考虑，则可以联接一些 (<bbb><aaa>)。
zh_hant: 標記的形式必須為 <aaa>，但如果標記 (<aaa>) 僅在另一個標記 (<bbb>) 內時才應考慮，則可以聯接一些 (<bbb><aaa>)。

source: Please note a tag should be listed in only one of the B<break>, B<inline> B<placeholder>, or B<customtag> setting string.
sv: Observera att en tagg endast ska anges i en av inställningssträngarna B<break>, B<inline> B<placeholder> eller B<customtag>.
zh_hans: 请注意，标记只能在 B<break>、B<inline> 、B<placeholder> 或 B<customtag> 设置字符串之一中列出。
zh_hant: 請注意，標記只能在 B<break>、B<inline> 、B<placeholder> 或 B<customtag> 設定字串之一中列出。

source: Space-separated list of tags which should be treated as inline. By default, all tags break the sequence.
sv: Mellanslagsavgränsad lista över taggar som ska behandlas som inline. Som standard bryter alla taggar sekvensen.
zh_hans: 应视为内联的以空格分隔的标记列表。默认情况下，所有标签都会打破顺序。
zh_hant: 應視為內聯的以空格分隔的標記列表。預設情況下，所有標籤都會打破順序。

source: Space-separated list of tags which should be treated as placeholders. Placeholders do not break the sequence, but the content of placeholders is translated separately.
sv: Lista med taggar separerade med mellanslag som ska behandlas som platshållare. Platshållare bryter inte sekvensen, men innehållet i platshållarna översätts separat.
zh_hans: 应视为占位符的以空格分隔的标记列表。占位符不会打乱顺序，但会单独转换占位符的内容。
zh_hant: 應視為佔位符的以空格分隔的標記列表。佔位符不會打亂順序，但會單獨轉換佔位符的內容。

source: The location of the placeholder in its block will be marked with a string similar to:
sv: Platshållarens placering i sitt block markeras med en sträng som liknar:
zh_hans: 占位符在其块中的位置将使用类似于以下内容的字符串进行标记：
zh_hant: 佔位符在其塊中的位置將使用類似於以下內容的字串進行標記：

source: <placeholder type=\"footnote\" id=\"0\"/>
sv: <platshållare typ=\"fotnot\" id=\"0\"/>

source: By default, Processing Instructions (i.e., C<E<lt>? ... ?E<gt>> tags) are handled as inline tags. Pass this option if you want the PI to be handled as breaking tag. Note that unprocessed PHP tags are handled as Processing Instructions by the parser.
sv: Som standard hanteras bearbetningsinstruktioner (dvs. C<E<lt>? ... ?E<gt>>-taggar) som inline-taggar. Ange denna flagga om du vill att PI ska hanteras som brytande tagg. Observera att obearbetade PHP-taggar hanteras som bearbetningsinstruktioner av tolkaren.
zh_hans: 默认情况下，处理指令(即 C<E<lt>? ... ?E<gt>> 标记)作为内联标记处理。如果希望将 PI 作为中断标记处理，请通过此选项。请注意，解析器将未处理的 PHP 标记作为处理指令进行处理。
zh_hant: 預設情況下，處理指令(即 C<E<lt>? ... ?E<gt>> 標記)作為內聯標記處理。如果希望將 PI 作為中斷標記處理，請透過此選項。請注意，解析器將未處理的 PHP 標記作為處理指令進行處理。

source: Space separated list of tags that the module should not try to set by default in any category.
sv: Lista med taggar separerade med mellanslag som modulen inte ska försöka ställa in som standard i någon kategori.
zh_hans: 默认情况下，模块不应尝试在任何类别中设置的标记的空格分隔列表。
zh_hant: 預設情況下，模組不應嘗試在任何類別中設定的標記的空格分隔列表。

source: If you have a tag which has its default setting by the subclass of this module but you want to set alternative setting, you need to list that tag as a part of the B<nodefault> setting string.
sv: Om du har en tagg som har sin standardinställning av underklassen för denna modul men du vill ställa in en alternativ inställning, måste du lista den taggen som en del av B-<nodefault> -inställningssträngen.
zh_hans: 如果您的标记按此模块的子类具有其默认设置，但您想要设置替代设置，则需要将该标记作为 B<nodefault> 设置字符串的一部分列出。
zh_hant: 如果您的標記按此模組的子類具有其預設設定，但您想要設定替代設定，則需要將該標記作為 B<nodefault> 設定字串的一部分列出。

source: Support C preprocessor directives. When this option is set, po4a will consider preprocessor directives as paragraph separators. This is important if the XML file must be preprocessed because otherwise the directives may be inserted in the middle of lines if po4a consider it belong to the current paragraph, and they won't be recognized by the preprocessor. Note: the preprocessor directives must only appear between tags (they must not break a tag).
sv: Stöd för C-preprocessordirektiv. När denna flagga är aktiverat kommer po4a att betrakta preprocessordirektiv som styckeavgränsare. Detta är viktigt om XML-filen måste förbehandlas, eftersom direktiven annars kan infogas mitt i raderna om po4a anser att de tillhör det aktuella stycket, och de kommer då inte att kännas igen av preprocessorn. Observera: preprocessordirektiven får endast förekomma mellan taggar (de får inte bryta en tagg).
zh_hans: 支持 C 预处理器指令。设置此选项时，po4a 将把预处理器指令视为段落分隔符。如果必须对 XML 文件进行预处理，这一点很重要，因为否则，如果 po4a 认为它属于当前段落，则指令可能会插入到行的中间，并且预处理器无法识别它们。注意：预处理器指令只能出现在标记之间 (它们不能换开标记)。
zh_hant: 支援 C 預處理器指令。設定此選項時，po4a 將把預處理器指令視為段落分隔符。如果必須對 XML 檔案進行預處理，這一點很重要，因為否則，如果 po4a 認為它屬於當前段落，則指令可能會插入到行的中間，並且預處理器無法識別它們。注意：預處理器指令只能出現在標記之間 (它們不能換開標記)。

source: Space-separated list of tags you want to translate.
sv: En lista med taggar som du vill översätta, separerade med mellanslag.
zh_hans: 要翻译的标记的空格分隔列表。
zh_hant: 要翻譯的標記的空格分隔列表。

source: You can also specify some tag options by putting some characters in front of the tag hierarchy. This overrides the default behavior specified by the global B<wrap> and B<defaulttranslateoption> option.
sv: Du kan också ange vissa taggflaggor genom att placera vissa tecken framför tagghierarkin. Detta åsidosätter standardbeteendet som anges av de globala flaggorna B<wrap> och B<defaulttranslateoption>.
zh_hans: 您还可以通过在标签层次结构前面放置一些字符来指定一些标签选项。这将覆盖全局 B<wrap> 和 B<defaulttranslateoption> 选项指定的默认行为。
zh_hant: 您還可以透過在標籤層次結構前面放置一些字元來指定一些標籤選項。這將覆蓋全域性 B<wrap> 和 B<defaulttranslateoption> 選項指定的預設行為。

source: Tags should be translated and content can be re-wrapped.
sv: Taggarna bör översättas och innehållet kan omformuleras.
zh_hans: 标签应该被翻译，内容可以重新封装。
zh_hant: 標籤應該被翻譯，內容可以重新封裝。

source: Tags should be translated and content should not be re-wrapped.
sv: Taggar ska översättas och innehållet ska inte omformateras.
zh_hans: 标签应该被翻译，内容不应该被重新包装。
zh_hant: 標籤應該被翻譯，內容不應該被重新包裝。

source: Tags should be translated inline.
sv: Taggar ska översättas inline.
zh_hans: 标签应该内联翻译。
zh_hant: 標籤應該內聯翻譯。

source: Tags should be translated as placeholders.
sv: Taggar ska översättas som platshållare.
zh_hans: 标记应转换为占位符。
zh_hant: 標記應轉換為佔位符。

source: Internally, the XML parser only cares about these four options: I<w> I<W> I<i> I<p>.
sv: Internt bryr sig XML-tolkaren endast om dessa fyra flaggor: I<w> I<W> I<i> I<p>.
zh_hans: 在内部，XML 解析器只关心以下四个选项： I<w> I<W> I<i> I<p>。
zh_hant: 在內部，XML 解析器只關心以下四個選項： I<w> I<W> I<i> I<p>。

source: * Tags listed in B<break> are set to I<w> or I<W> depending on the B<wrap> option.
sv: * Taggar som listas i B<break> ställs in på I<w> eller I<W> beroende på flaggan B<wrap>.
zh_hans: * 根据 B<break> 选项，将 B<Break> 中列出的标记设置为 I<w> 或 I<W> 。
zh_hant: * 根據 B<break> 選項，將 B<Break> 中列出的標記設定為 I<w> 或 I<W> 。

source: * Tags listed in B<inline> are set to I<i>.
sv: * Taggar som listas i B<inline> är inställda på I<i>.
zh_hans: * B<inline> 中列出的标记设置为 I<i>。
zh_hant: * B<inline> 中列出的標記設定為 I<i>。

source: * Tags listed in B<placeholder> are set to I<p>.
sv: * Taggar som anges i B<placeholder> är inställda på I<p>.
zh_hans: * B<placeholder> 中列出的标记设置为 I<p>。
zh_hant: * B<placeholder> 中列出的標記設定為 I<p>。

source: * Tags listed in B<untranslated> are without any of these options set.
sv: * Taggar som listas i B<untranslated> har ingen av dessa flaggor inställda.
zh_hans: * B<untranslated> 中列出的标记未设置任何这些选项。
zh_hant: * B<untranslated> 中列出的標記未設定任何這些選項。

source: You can verify actual internal parameter behavior by invoking B<po4a> with B<--debug> option.
sv: Du kan verifiera det faktiska interna parametrarbeteendet genom att anropa B-<po4a> med flaggan B-<--debug>.
zh_hans: 您可以通过使用 B<--debug> 选项调用 B<po4a> 来验证实际的内部参数行为。
zh_hant: 您可以透過使用 B<--debug> 選項呼叫 B<po4a> 來驗證實際的內部引數行為。

source: Please note a tag should be listed in either B<translated> or B<untranslated> setting string.
sv: Observera att en tagg ska anges i antingen B<translated> eller B<untranslated> inställningssträngen.
zh_hans: 请注意，标签应列在 B<translated> 或 B<untranslated> 设置字符串中。
zh_hant: 請注意，標籤應列在 B<translated> 或 B<untranslated> 設定字串中。

source: Space-separated list of tags you do not want to translate.
sv: Lista med taggar som du inte vill översätta, separerade med mellanslag.
zh_hans: 您不想翻译的以空格分隔的标签列表。
zh_hant: 您不想翻譯的以空格分隔的標籤列表。

source: Please note a translatable inline tag in an untranslated tag is treated as a translatable breaking tag, I<i> setting is dropped and I<w> or I<W> is set depending on the B<wrap> option.
sv: Observera att en översättningsbar inline-tagg i en icke översatt tagg behandlas som en översättningsbar brytande tagg, inställningen I<i> tas bort och I<w> eller I<W> ställs in beroende på flaggan B<wrap>.
zh_hans: 请注意，未翻译标记中的可翻译行内标记将被视为可翻译中断标记，I<i> 设置将被删除，I<w> 或 I<W> 将根据 B<wrap> 选项进行设置。
zh_hant: 請注意，未翻譯標記中的可翻譯行內標記將被視為可翻譯中斷標記，I<i> 設定將被刪除，I<w> 或 I<W> 將根據 B<wrap> 選項進行設定。

source: The default categories for tags that are not in any of the translated, untranslated, break, inline, or placeholder.
sv: Standardkategorierna för taggar som inte finns i någon av kategorierna översatt, oöversatt, brytning, inline eller platshållare.
zh_hans: 不在任何已翻译、未翻译、分隔符、内联或占位符中的标签的默认类别。
zh_hant: 不在任何已翻譯、未翻譯、分隔符、內聯或佔位符中的標籤的預設類別。

source: This is a set of letters as defined in B<translated> and this setting is only valid for translatable tags.
sv: Detta är en uppsättning bokstäver som definieras i B<translated> och denna inställning gäller endast för översättningsbara taggar.
zh_hans: 这是 B<translated> 中定义的一组字母，此设置仅对可翻译标记有效。
zh_hant: 這是 B<translated> 中定義的一組字母，此設定僅對可翻譯標記有效。

source: WRITING DERIVATIVE MODULES
sv: SKRIVA DERIVATMODULER
zh_hans: 编写衍生模块
zh_hant: 編寫衍生模組

source: DEFINE WHAT TAGS AND ATTRIBUTES TO TRANSLATE
sv: DEFINIERA VILKA TAGGAR OCH ATTRIBUT SOM SKA ÖVERSÄTTAS
zh_hans: 定义要转换的标签和属性
zh_hant: 定義要轉換的標籤和屬性

source: The simplest customization is to define which tags and attributes you want the parser to translate. This should be done in the initialize function. First you should call the main initialize, to get the command-line options, and then, append your custom definitions to the options hash. If you want to treat some new options from command line, you should define them before calling the main initialize:
sv: Den enklaste anpassningen är att definiera vilka taggar och attribut du vill att parsern ska översätta. Detta bör göras i initialiseringsfunktionen. Först bör du anropa huvudinitialiseringen för att hämta kommandoradsflaggor och sedan lägga till dina anpassade definitioner till flagghashen. Om du vill behandla några nya flaggor från kommandoraden bör du definiera dem innan du anropar huvudinitialiseringen:
zh_hans: 最简单的定制是定义希望解析器转换哪些标记和属性。这应该在 initialize 函数中完成。首先，您应该调用 main initialize 来获取命令行选项，然后将您的自定义定义附加到选项散列中。如果您想从命令行处理一些新选项，您应该在调用 main initialize 之前定义它们：
zh_hant: 最簡單的定製是定義希望解析器轉換哪些標記和屬性。這應該在 initialize 函式中完成。首先，您應該呼叫 main initialize 來獲取命令列選項，然後將您的自定義定義附加到選項雜湊中。如果您想從命令列處理一些新選項，您應該在呼叫 main initialize 之前定義它們：
