Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: This module is still beta. Please send feedback and feature requests.
sv: Denna modul är fortfarande i betaversion. Skicka gärna feedback och önskemål om funktioner.
zh_hans: 此模块仍为测试版。请发送反馈和功能请求。
zh_hant: 此模組仍為測試版。請傳送反饋和功能請求。

source: CAVEAT
sv: VARNING
zh_hans: 警告
zh_hant: 警告

source: Some constructs are badly supported. The known ones are documented below.
sv: Vissa konstruktioner har dåligt stöd. De kända konstruktionerna dokumenteras nedan.
zh_hans: 有些构造的支持率很低。已知的记录如下。
zh_hant: 有些構造的支援率很低。已知的記錄如下。

source: Verbatim blocks
sv: Verbatim-block
zh_hans: 逐字记录块
zh_hant: 逐字記錄塊

source: The verbatim block is not considered as a whole. Each line will be translated separately.
sv: Verbatim-blocket betraktas inte som en helhet. Varje rad översätts separat.
zh_hans: 不会将逐字逐句的块作为一个整体来考虑。每一行都将单独翻译。
zh_hant: 不會將逐字逐句的塊作為一個整體來考慮。每一行都將單獨翻譯。

source: Locale::Po4a::Ini - convert INI files from/to PO files
sv: Locale::Po4a::Ini - konvertera INI-filer från/till PO-filer
zh_hans: Locale::Po4a::Ini - 将 INI 文件从/转换为 PO 文件
zh_hant: Locale::Po4a::Ini - 將 INI 檔案從/轉換為 PO 檔案

source: Locale::Po4a::Ini is a module to help the translation of INI files into other [human] languages.
sv: Locale::Po4a::Ini är ett modul som hjälper till att översätta INI-filer till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Ini 是一个帮助将INI文件翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Ini 是一個幫助將INI檔案翻譯成其他 [人類] 語言的模組。

source: The module searches for lines of the following format and extracts the quoted text:
sv: Modulen söker efter rader i följande format och extraherar den citerade texten:
zh_hans: 系统搜索以下格式的行，并提取引号文本：
zh_hant: 系統搜尋以下格式的行，並提取引號文字：

source: identificator="text than can be translated"
sv: identifierare="text som kan översättas"
zh_hans: identificator="可以翻译的文本"
zh_hant: identificator="可以翻譯的文字"

source: NOTE: If the text is not quoted, it will be ignored.
sv: OBS: Om texten inte citeras kommer den att ignoreras.
zh_hans: 注：如果文本未加引号，将被忽略。
zh_hant: 注：如果文字未加引號，將被忽略。

source: Locale::Po4a::KernelHelp - convert kernel configuration help from/to PO files
sv: Locale::Po4a::KernelHelp – konvertera hjälp för kärnkonfiguration från/till PO-filer
zh_hans: Locale::Po4a::KernelHelp - 将内核配置帮助从/转换为 PO 文件
zh_hant: Locale::Po4a::KernelHelp - 將核心配置幫助從/轉換為 PO 檔案

source: Locale::Po4a::KernelHelp is a module to help the translation of documentation for the Linux kernel configuration options into other [human] languages.
sv: Locale::Po4a::KernelHelp är ett modul som hjälper till att översätta dokumentationen för Linux-kärnans konfigurationsflaggor till andra [mänskliga] språk.
zh_hans: Locale::Po4a::KernelHelp 一个模块，用于帮助将 Linux 内核配置选项的文档翻译成其他 [人类] 语言。
zh_hant: Locale::Po4a::KernelHelp 一個模組，用於幫助將 Linux 核心配置選項的文件翻譯成其他 [人類] 語言。

source: This module is just written, and needs more tests. Most of the needed work will concern the tools used to parse this file (and configure the kernel), so that they accept to read the documentation from another (translated) file.
sv: Denna modul är precis skriven och behöver testas mer. Det mesta av det arbete som behövs kommer att handla om de verktyg som används för att analysera denna fil (och konfigurera kärnan), så att de accepterar att läsa dokumentationen från en annan (översatt) fil.
zh_hans: 此模块刚刚编写，需要更多测试。所需的大部分工作将涉及用于解析此文件 (并配置内核) 的工具，以便它们接受从另一个 (翻译后的) 文件中读取文档。
zh_hant: 此模組剛剛編寫，需要更多測試。所需的大部分工作將涉及用於解析此檔案 (並配置內核) 的工具，以便它們接受從另一個 (翻譯後的) 檔案中讀取文件。

source: Locale::Po4a::LaTeX - convert LaTeX documents and derivates from/to PO files
sv: Locale::Po4a::LaTeX – konvertera LaTeX-dokument och derivat från/till PO-filer
zh_hans: Locale::Po4a::LaTeX - 将 LaTeX 文档和衍生从/转换为 PO 文件
zh_hant: Locale::Po4a::LaTeX - 將 LaTeX 文件和衍生從/轉換為 PO 檔案

source: Locale::Po4a::LaTeX is a module to help the translation of LaTeX documents into other [human] languages. It can also be used as a base to build modules for LaTeX-based documents.
sv: Locale::Po4a::LaTeX är ett modul som hjälper till att översätta LaTeX-dokument till andra [mänskliga] språk. Det kan också användas som bas för att bygga moduler för LaTeX-baserade dokument.
zh_hans: Locale::Po4a::LaTeX 是一个帮助将 LaTeX 文档翻译成其他 [人类] 语言的模块。它还可以用作构建基于 LaTeX 文档的模块的基础。
zh_hant: Locale::Po4a::LaTeX 是一個幫助將 LaTeX 文件翻譯成其他 [人類] 語言的模組。它還可以用作構建基於 LaTeX 文件的模組的基礎。

source: This module contains the definitions of common LaTeX commands and environments.
sv: Denna modul innehåller definitioner av vanliga LaTeX-kommandon och miljöer.
zh_hans: 此模块包含常见 LaTeX 命令和环境的定义。
zh_hant: 此模組包含常見 LaTeX 命令和環境的定義。

source: See the L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> manpage for the list of recognized options.
sv: Se man-sidan för L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> för en lista över erkända flaggor.
zh_hans: 有关可识别选项的列表，请参见 L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> 手册页。
zh_hant: 有關可識別選項的列表，請參見 L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> 手冊頁。

source: Locale::Po4a::Man - convert manual pages from/to PO files
sv: Locale::Po4a::Man - konvertera manualer från/till PO-filer
zh_hans: Locale::Po4a::Man - 将手动页面从/转换为 PO 文件
zh_hant: Locale::Po4a::Man - 將手動頁面從/轉換為 PO 檔案

source: Locale::Po4a::Man is a module to help the translation of documentation in the nroff format (the language of manual pages) into other [human] languages.
sv: Locale::Po4a::Man är ett modul som hjälper till att översätta dokumentation i nroff-format (språket i manualer) till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Man 是一个模块，用于帮助将 nroff 格式(手册页的语言)的文档翻译成其他 [人类] 语言。
zh_hant: Locale::Po4a::Man 是一個模組，用於幫助將 nroff 格式(手冊頁的語言)的文件翻譯成其他 [人類] 語言。

source: TRANSLATING WITH PO4A::MAN
sv: ÖVERSÄTTNING MED PO4A::MAN
zh_hans: 使用 PO4A::MAN 进行翻译
zh_hant: 使用 PO4A::MAN 進行翻譯

source: This module tries pretty hard to make translator's life easier. For that, the text presented to translators isn't a verbatim copy of the text found in the man page. Indeed, the cruder parts of the nroff format are hidden, so that translators can't mess up with them.
sv: Denna modul försöker verkligen underlätta översättarens arbete. Därför är texten som översättarna får inte en ordagrann kopia av texten i manualen. De grövre delarna av nroff-formatet är dolda, så att översättarna inte kan förstöra dem.
zh_hans: 这个模块非常努力地让翻译员的工作变得更容易。因此，呈现给翻译人员的文本不是手册页中的文本的逐字副本。实际上，nroff 格式的粗略部分是隐藏的，这样翻译人员就不会把它们搞砸了。
zh_hant: 這個模組非常努力地讓翻譯員的工作變得更容易。因此，呈現給翻譯人員的文字不是手冊頁中的文字的逐字副本。實際上，nroff 格式的粗略部分是隱藏的，這樣翻譯人員就不會把它們搞砸了。

source: Text wrapping
sv: Figursättning
zh_hans: 文本换行
zh_hant: 文字換行

source: Unindented paragraphs are automatically rewrapped for the translator. This can lead to some minor difference in the generated output, since the rewrapping rules used by groff aren't very clear. For example, two spaces after a parenthesis are sometimes preserved.
sv: Avsnitt utan indrag omformateras automatiskt för översättaren. Detta kan leda till mindre skillnader i det genererade resultatet, eftersom de omformateringsregler som används av groff inte är särskilt tydliga. Till exempel behålls ibland två mellanslag efter en parentes.
zh_hans: 未缩进的段落会自动为翻译器重新换行。这可能会在生成的输出中导致一些细微的差异，因为 groff 使用的重新包装规则不是很清楚。例如，有时保留括号后的两个空格。
zh_hant: 未縮排的段落會自動為翻譯器重新換行。這可能會在生成的輸出中導致一些細微的差異，因為 groff 使用的重新包裝規則不是很清楚。例如，有時保留括號後的兩個空格。

source: Anyway, the difference will only be about the position of the extra spaces in wrapped paragraph, and I think it's worth.
sv: Hur som helst, skillnaden kommer bara att handla om placeringen av de extra mellanslagen i det ombrutna stycket, och jag tycker att det är värt det.
zh_hans: 无论如何，不同之处只在于换行段落中额外空格的位置，我认为这是值得的。
zh_hant: 無論如何，不同之處只在於換行段落中額外空格的位置，我認為這是值得的。

source: Font specification
sv: Fontspecifikation
zh_hans: 字体规格
zh_hant: 字型規格

source: The first change is about font change specifications. In nroff, there are several ways to specify if a given word should be written in small, bold or italics. In the text to translate, there is only one way, borrowed from the POD (Perl online documentation) format:
sv: Den första ändringen gäller specifikationer för teckensnittsändringar. I nroff finns det flera sätt att ange om ett visst ord ska skrivas med små bokstäver, fetstil eller kursiv stil. I texten som ska översättas finns det bara ett sätt, lånat från POD-formatet (Perl online documentation):
zh_hans: 第一个更改是关于字体更改规范。在 nroff 中，有几种方法可以指定给定的单词应该用小写、粗体还是斜体书写。在要翻译的文本中，只有一种方法，借用 POD (Perl Online Documentation) 格式：
zh_hant: 第一個更改是關於字型更改規範。在 nroff 中，有幾種方法可以指定給定的單詞應該用小寫、粗體還是斜體書寫。在要翻譯的文字中，只有一種方法，借用 POD (Perl Online Documentation) 格式：

source: IE<lt>textE<gt> -- italic text
sv: IE<lt>textE<gt> -- kursiv text
zh_hans: IE<lt>textE<gt> -- 斜体文本
zh_hant: IE<lt>textE<gt> -- 斜體文字

source: equivalent to \fItext\fP or ".I text"
sv: motsvarande \fItext\fP eller ".I text"
zh_hans: 等效于 \fItext\fP 或 ".I text"
zh_hant: 等效於 \fItext\fP 或 ".I text"

source: BE<lt>textE<gt> -- bold text
sv: BE<lt>textE<gt> -- fet text
zh_hans: BE<lt>textE<gt> -- 粗体文本
zh_hant: BE<lt>textE<gt> -- 粗體文字

source: equivalent to \fBtext\fP or ".B text"
sv: motsvarande \fBtext\fP eller ".B text"
zh_hans: 等效于 \fBtext\fP 或 ".B text"
zh_hant: 等效於 \fBtext\fP 或 ".B text"

source: equivalent to \fRtext\fP
sv: motsvarande \fRtext\fP
zh_hans: 等效于 \fRtext\fP
zh_hant: 等效於 \fRtext\fP

source: CWE<lt>textE<gt> -- constant width text
sv: CWE-<lt>textE-<gt> -- text med konstant bredd
zh_hans: CWE<lt>textE<gt> -- 等长宽度文本
zh_hant: CWE<lt>textE<gt> -- 等長寬度文字

source: equivalent to \f(CWtext\fP or ".CW text"
sv: motsvarande \f(CWtext\fP eller ".CW text"
zh_hans: 等效于 \f(CWtext\fP 或 ".CW text"
zh_hant: 等效於 \f(CWtext\fP 或 ".CW text"

source: Remark: The CW face is not available for all groff devices. It is not recommended to use it. It is provided for your convenience.
sv: Anmärkning: CW-ansiktet är inte tillgängligt för alla groff-enheter. Det rekommenderas inte att använda det. Det tillhandahålls för din bekvämlighet.
zh_hans: 备注：并非所有 groff 设备都提供 CW 面。不推荐使用。这是为了您的方便而提供的。
zh_hant: 備註：並非所有 groff 裝置都提供 CW 面。不推薦使用。這是為了您的方便而提供的。

source: Automatic characters transliteration
sv: Automatisk translitterering av tecken
zh_hans: 字符自动音译
zh_hant: 字元自動音譯

source: Po4a automatically transliterate some characters to ease the translation or the review of the translation. Here is the list of the transliterations:
sv: Po4a omvandlar automatiskt vissa tecken för att underlätta översättningen eller granskningen av översättningen. Här är listan över omvandlingarna:
zh_hans: Po4a 会自动音译某些字符，以简化翻译或审核翻译。以下是音译的列表：
zh_hant: Po4a 會自動音譯某些字元，以簡化翻譯或稽核翻譯。以下是音譯的列表：

source: hyphens
sv: bindestreck
zh_hans: 连字符
zh_hant: 連字元

source: Hyphens (-) and minus signs (\-) in man pages are all transliterated as simple dashes (-) in the PO file. Then all dash are transliterated into roff minus signs (\-) when the translation is inserted into the output document.
sv: Bindestreck (-) och minustecken (\-) i man-sidor translittereras alla till enkla streck (-) i PO-filen. Därefter translittereras alla streck till roff-minustecken (\-) när översättningen infogas i utdatadokumentet.
zh_hans: 手册页中的连字符 (-) 和减号 (\-) 在 PO 文件中都音译为简单的破折号 (-)。然后，在将翻译插入到输出文档中时，所有破折号都音译为 roff 减号 (\-)。
zh_hant: 手冊頁中的連字元 (-) 和減號 (\-) 在 PO 檔案中都音譯為簡單的破折號 (-)。然後，在將翻譯插入到輸出文件中時，所有破折號都音譯為 roff 減號 (\-)。

source: Translators can force an hyphen by using the roff glyph '\[hy]' in their translations.
sv: Översättare kan tvinga fram ett bindestreck genom att använda roff-tecknet '\[hy]' i sina översättningar.
zh_hans: 翻译人员可以在翻译中使用 roff 字形 '\[hy]' 强制使用连字符。
zh_hant: 翻譯人員可以在翻譯中使用 roff 字形 '\[hy]' 強制使用連字元。

source: non-breaking spaces
sv: icke-brytande mellanslag
zh_hans: 不间断空格
zh_hant: 不間斷空格

source: Translators can use non-breaking spaces in their translations. These non-breaking spaces (0xA0 in latin1) will be transliterated into a roff non-breaking space ('\ ').
sv: Översättare kan använda fasta mellanslag i sina översättningar. Dessa fasta mellanslag (0xA0 i latin1) kommer att translittereras till ett roff-fast mellanslag ('\ ').
zh_hans: 翻译人员可以在翻译中使用不间断空格。这些不间断空格 (latin1 中的 0xA0)将音译为 roff 不间断空格('\ ')。
zh_hant: 翻譯人員可以在翻譯中使用不間斷空格。這些不間斷空格 (latin1 中的 0xA0)將音譯為 roff 不間斷空格('\ ')。

source: quotes transliterations
sv: citat translitterationer
zh_hans: 引用音译
zh_hant: 引用音譯

source: `` and '' are respectively tranliterated into \*(lq and \*(rq.
sv: `` och '' translittereras respektive till \*(lq och \*(rq.
zh_hans: `` 和 '' 分别音译为 \*(lq 和 \*(rq.
zh_hant: `` 和 '' 分別音譯為 \*(lq 和 \*(rq.

source: To avoid these transliterations, translators can insert a zero width roff character (i.e., using `\&` or '\&' respectively).
sv: För att undvika dessa translitterationer kan översättare infoga ett roff-tecken med nollbredd (dvs. använda `\&` respektive '\&').
zh_hans: 为了避免这些音译，翻译人员可以插入零宽度 roff 字符(即分别使用 '\&' 或 '\&')。
zh_hant: 為了避免這些音譯，翻譯人員可以插入零寬度 roff 字元(即分別使用 '\&' 或 '\&')。

source: Putting 'E<lt>' and 'E<gt>' in translations
sv: Att lägga till "E<lt>" och "E<gt>" i översättningar
zh_hans: 在翻译中放 'E<lt>' 和 'E<gt>'
zh_hant: 在翻譯中放 'E<lt>' 和 'E<gt>'

source: Since these chars are used to delimit parts under font modification, you can't use them verbatim. Use EE<lt>ltE<gt> and EE<lt>gtE<gt> instead (as in POD, one more time).
sv: Eftersom dessa tecken används för att avgränsa delar under teckensnittsmodifiering kan du inte använda dem ordagrant. Använd istället EE<lt>ltE<gt> och EE<lt>gtE<gt> (som i POD, en gång till).
zh_hans: 由于这些字符用于分隔字体修改后的部分，因此您不能逐字使用它们。改为使用 EE<lt>ltE<gt> 和 EE<lt>gtE<gt> (与 POD 中相同)。
zh_hant: 由於這些字元用於分隔字型修改後的部分，因此您不能逐字使用它們。改為使用 EE<lt>ltE<gt> 和 EE<lt>gtE<gt> (與 POD 中相同)。

source: Activate debugging for some internal mechanisms of this module. Use the source to see which parts can be debugged.
sv: Aktivera felsökning för vissa interna mekanismer i denna modul. Använd källkoden för att se vilka delar som kan felsökas.
zh_hans: 激活此模块某些内部机制的调试。 使用源查看哪些部件可以调试。
zh_hant: 啟用此模組某些內部機制的除錯。 使用源檢視哪些部件可以除錯。

source: Increase verbosity.
sv: Öka detaljeringsgraden.
zh_hans: 增加详细程度。
zh_hant: 增加詳細程度。

source: B<groff_code>
sv: B<groff_kod>

source: This option controls the behavior of the module when it encounter a .de, .ie or .if section. It can take the following values:
sv: Den här flaggan styr modulens beteende när den stöter på en .de-, .ie- eller .if-sektion. Det kan ha följande värden:
zh_hans: 此选项控制模块在遇到.de、.ie 或 .if 节时的行为。它可以采用下列值：
zh_hant: 此選項控制模組在遇到.de、.ie 或 .if 節時的行為。它可以採用下列值：

source: This is the default value. The module will fail when a .de, .ie or .if section is encountered.
sv: Detta är standardvärdet. Modulen kommer att misslyckas när en .de-, .ie- eller .if-sektion påträffas.
zh_hans: 这是默认值。遇到 .de、.ie 或 .if 章节时，模块将失败。
zh_hant: 這是預設值。遇到 .de、.ie 或 .if 章節時，模組將失敗。

source: Indicates that the .de, .ie or .if sections must be copied as is from the original to the translated document.
sv: Anger att avsnitten .de, .ie eller .if måste kopieras som de är från originalet till det översatta dokumentet.
zh_hans: 指示必须按原样将 .de、.ie 或 .if 节从原始文档复制到翻译后的文档。
zh_hant: 指示必須按原樣將 .de、.ie 或 .if 節從原始文件複製到翻譯後的文件。

source: Indicates that the .de, .ie or .if sections will be proposed for the translation. You should only use this option if a translatable string is contained in one of these section. Otherwise, I<verbatim> should be preferred.
sv: Anger att avsnitten .de, .ie eller .if kommer att föreslås för översättning. Du bör endast använda denna flagga om en översättningsbar sträng finns i ett av dessa avsnitt. I annat fall bör I<verbatim> föredras.
zh_hans: 指示将为翻译建议 .de、.ie 或 .if 章节。仅当这些部分之一中包含可翻译字符串时，才应使用此选项。否则，应该首选 I<verbatim>。
zh_hant: 指示將為翻譯建議 .de、.ie 或 .if 章節。僅當這些部分之一中包含可翻譯字串時，才應使用此選項。否則，應該首選 I<verbatim>。

source: This option specifies that the file was generated, and that po4a should not try to detect if the man pages was generated from another format. This option is mandatory to use po4a on generated man pages. Note that translating generated pages instead of sources ones is often more fragile, and thus a bad idea.
sv: Den här flaggan anger att filen har genererats och att po4a inte ska försöka upptäcka om man-sidorna har genererats från ett annat format. Den här flaggan är obligatoriskt för att kunna använda po4a på genererade man-sidor. Observera att det ofta är mer känsligt att översätta genererade sidor istället för källtexter, och därför är det en dålig idé.
zh_hans: 该选项指定文件是生成的，并且 po4a 不应尝试检测手册页是否由另一种格式生成。要在生成的手册页上使用 po4a，此选项是必需的。请注意，转换生成的页面而不是源页面通常更脆弱，因此不是一个好主意。
zh_hant: 該選項指定檔案是生成的，並且 po4a 不應嘗試檢測手冊頁是否由另一種格式生成。要在生成的手冊頁上使用 po4a，此選項是必需的。請注意，轉換生成的頁面而不是源頁面通常更脆弱，因此不是一個好主意。

source: This option is only useful for mdoc pages.
sv: Den här flaggan är bara användbart för mdoc-sidor.
zh_hans: 此选项仅对 mdoc 页面有用。
zh_hant: 此選項僅對 mdoc 頁面有用。

source: It selects a stricter support of the mdoc format by telling po4a not to translate the 'NAME' section. mdoc pages whose 'NAME' section is translated won't generate any header or footer.
sv: Det väljer ett striktare stöd för mdoc-formatet genom att tala om för po4a att inte översätta avsnittet 'NAME'. mdoc-sidor vars 'NAME'-avsnitt översätts genererar inga sidhuvuden eller sidfötter.
zh_hans: 它通过告诉 po4a 不翻译 'NAME' 部分来选择更严格的 mdoc 格式支持。翻译了 'NAME' 部分的 mdoc 页面不会生成任何页眉或页脚。
zh_hant: 它透過告訴 po4a 不翻譯 'NAME' 部分來選擇更嚴格的 mdoc 格式支援。翻譯了 'NAME' 部分的 mdoc 頁面不會生成任何頁首或頁尾。

source: According to the groff_mdoc page, the NAME, SYNOPSIS and DESCRIPTION sections are mandatory. There are no known issues with translated SYNOPSIS or DESCRIPTION section, but you can also specify these sections this way: -o mdoc=NAME,SYNOPSIS,DESCRIPTION
sv: Enligt sidan groff_mdoc är avsnitten NAME, SYNOPSIS och DESCRIPTION obligatoriska. Det finns inga kända problem med översatta SYNOPSIS- eller DESCRIPTION-avsnitt, men du kan också ange dessa avsnitt på följande sätt: -o mdoc=NAME,SYNOPSIS,DESCRIPTION

source: This mdoc issue can also be solved with an addendum like this one: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"
sv: Det här mdoc-problemet kan också lösas med ett tillägg som detta: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Månad dag, år" OS "Avsnittets namn"

source: The following options specify the behavior of a user-defined macro (with a .de request), or of a classical macro that is not supported by po4a. They take as argument a comma-separated list of macros. For example:
sv: Följande flaggor anger beteendet för ett användardefinierat makro (med en .de-begäran) eller för ett klassiskt makro som inte stöds av po4a. De tar som argument en kommaseparerad lista med makron. Till exempel:

source: Note: if a macro is not supported by po4a and if you consider that it is a standard roff macro, you should submit it to the po4a development team.
sv: Observera: om ett makro inte stöds av po4a och du anser att det är ett standardmakro för roff, bör du skicka in det till po4a-utvecklingsteamet.
zh_hans: 注意：如果某个宏不受 po4a 支持，并且您认为它是标准的 roff 宏，那么您应该将其提交给 po4a 开发团队。
zh_hant: 注意：如果某個宏不受 po4a 支援，並且您認為它是標準的 roff 宏，那麼您應該將其提交給 po4a 開發團隊。

source: B<untranslated> indicates that this macro (at its arguments) don't have to be translated.
sv: B<untranslated> indikerar att detta makro (vid dess argument) inte behöver översättas.
zh_hans: B<untranslated> 指示不必翻译此宏(在其参数处)。
zh_hant: B<untranslated> 指示不必翻譯此宏(在其引數處)。

source: B<noarg> is like B<untranslated>, except that po4a will verify that no argument is added to this macro.
sv: B<noarg> är som B<untranslated>, förutom att po4a kommer att verifiera att inget argument läggs till i denna makro.
zh_hans: B<noarg> 类似于 B<untransted>，不同之处在于 po4a 将验证没有参数添加到此宏。
zh_hant: B<noarg> 類似於 B<untransted>，不同之處在於 po4a 將驗證沒有引數新增到此宏。

source: B<translate_joined> indicates that po4a must propose to translate the arguments of the macro.
sv: B<translate_joined> indikerar att po4a måste föreslå att makroets argument översätts.
zh_hans: B<translate_joined> 指示 po4a 必须提议翻译宏的参数。
zh_hant: B<translate_joined> 指示 po4a 必須提議翻譯宏的引數。

source: With B<translate_each>, the arguments will also be proposed for the translation, except that each one will be translated separately.
sv: Med B<translate_each> kommer argumenten också att föreslås för översättningen, med undantag för att varje argument kommer att översättas separat.
zh_hans: 对于 B<translate_each>，除了每个参数将被单独翻译外，还将为翻译建议参数。
zh_hant: 對於 B<translate_each>，除了每個引數將被單獨翻譯外，還將為翻譯建議引數。

source: This option takes as argument a list of comma-separated couples I<begin>:I<end>, where I<begin> and I<end> are commands that delimit the begin and end of a section that should not be rewrapped.
sv: Denna flagga tar som argument en lista med kommaseparerade par I<begin>:I<end>, där I<begin> och I<end> är kommandon som avgränsar början och slutet på ett avsnitt som inte ska ombrytas.
zh_hans: 该选项将逗号分隔的对列表 I<begin>:I<end> 作为参数，其中 I<begin> 和 I<end> 是分隔不应该重新换行的节的开始和结束的命令。
zh_hant: 該選項將逗號分隔的對列表 I<begin>:I<end> 作為引數，其中 I<begin> 和 I<end> 是分隔不應該重新換行的節的開始和結束的命令。

source: Note: no test is done to ensure that an I<end> command matches its I<begin> command; any ending command stop the no_wrap mode. If you have a I<begin> (respectively I<end>) macro that has no I<end> (respectively I<begin>), you can specify an existing I<end> (like fi) or I<begin> (like nf) as a counterpart. These macros (and their arguments) won't be translated.
sv: Observera: inget test utförs för att säkerställa att ett I<end> -kommando matchar sitt I<begin> -kommando; alla avslutande kommandon stoppar no_wrap-läget. Om du har ett I<begin> -makro (respektive I<end>) som inte har något I<end> -makro (respektive I<begin>), kan du ange ett befintligt I<end> -makro (som fi) eller I<begin> -makro (som nf) som motsvarighet. Dessa makron (och deras argument) kommer inte att översättas.
zh_hans: 注意：不执行任何测试来确保 I<end> 命令与其 I<begin> 命令匹配；任何结束命令都会停止 no_wrap 模式。如果您有一个没有 I<end> (分别是 I<begin> )的 I<begin> (分别是 I<end>)宏，则可以指定现有的 I<end> (如 fi)或 I<begin> (如 nf)作为对应宏。这些宏 (及其参数) 不会被翻译。
zh_hant: 注意：不執行任何測試來確保 I<end> 命令與其 I<begin> 命令匹配；任何結束命令都會停止 no_wrap 模式。如果您有一個沒有 I<end> (分別是 I<begin> )的 I<begin> (分別是 I<end>)宏，則可以指定現有的 I<end> (如 fi)或 I<begin> (如 nf)作為對應宏。這些宏 (及其引數) 不會被翻譯。

source: This option specifies a list of comma-separated macros that must not split the current paragraph. The string to translate will then contain I<foo E<lt>.bar baz quxE<gt> quux>, where I<bar> is the command that should be inlined, and I<baz qux> its arguments.
sv: Den här flaggan anger en lista med makron separerade med kommatecken som inte får dela upp det aktuella stycket. Strängen som ska översättas kommer då att innehålla I<foo E<lt>.bar baz quxE<gt> quux>, där I<bar> är kommandot som ska infogas och I<baz qux> dess argument.
zh_hans: 此选项指定不得拆分当前段落的逗号分隔宏列表。然后，要转换的字符串将包含 I<foo E<lt>.bar baz quxE<gt> quux>，其中 I<bar> 是应该内联的命令，I<baz qux> 是其参数。
zh_hant: 此選項指定不得拆分當前段落的逗號分隔宏列表。然後，要轉換的字串將包含 I<foo E<lt>.bar baz quxE<gt> quux>，其中 I<bar> 是應該內聯的命令，I<baz qux> 是其參數。

source: B<unknown_macros>
sv: B<okända_makron>

source: This option indicates how po4a should behave when an unknown macro is found. By default, po4a fails with a warning. It can take the following values: B<failed> (the default value), B<untranslated>, B<noarg>, B<translate_joined>, or B<translate_each> (see above for an explanation of these values).
sv: Denna flagga anger hur po4a ska agera när ett okänt makro hittas. Som standard avbryts po4a med en varning. Det kan ha följande värden: B<failed> (standardvärdet), B<untranslated>, B<noarg>, B<translate_joined> eller B<translate_each> (se ovan för en förklaring av dessa värden).
zh_hans: 此选项指示找到未知宏时 po4a 的行为。默认情况下，po4a 失败并显示警告。它可以采用以下值： B<failed> (默认值)、B<untranslated>、B<noarg>、B<translate_joined> 或 B<translate_each> (有关这些值的解释，请参见上文)。
zh_hant: 此選項指示找到未知宏時 po4a 的行為。預設情況下，po4a 失敗並顯示警告。它可以採用以下值： B<failed> (預設值)、B<untranslated>、B<noarg>、B<translate_joined> 或 B<translate_each> (有關這些值的解釋，請參見上文)。

source: AUTHORING MAN PAGES COMPLIANT WITH PO4A::MAN
sv: SKRIVA MAN-SIDOR SOM ÖVERENSSTÄMMER MED PO4A::MAN
zh_hans: 创作符合 PO4A::MAN 的手册页
zh_hant: 創作符合 PO4A::MAN 的手冊頁
