Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Functions to build a message catalog
sv: Funktioner för att skapa en meddelandekatalog
zh_hans: 用于构建消息目录的函数
zh_hant: 用於構建訊息目錄的函式

source: Push a new entry at the end of the current catalog. The arguments should form a hash table. The valid keys are:
sv: Lägg till en ny post i slutet av den aktuella katalogen. Argumenten ska bilda en hashtabell. Giltiga nycklar är:
zh_hans: 在当前目录的末尾推送新条目。参数应形成哈希表。有效密钥为：
zh_hant: 在當前目錄的末尾推送新條目。引數應形成雜湊表。有效金鑰為：

source: the string in original language.
sv: strängen på originalspråket.
zh_hans: 原始语言的字符串。
zh_hant: 原始語言的字串。

source: the translation.
sv: översättningen.
zh_hans: 翻译。
zh_hant: 翻譯。

source: an indication of where this string was found. Example: file.c:46 (meaning in 'file.c' at line 46). It can be a space-separated list in case of multiple occurrences.
sv: en indikation på var denna sträng hittades. Exempel: file.c:46 (vilket betyder i 'file.c' på rad 46). Det kan vara en lista separerad med mellanslag om det finns flera förekomster.
zh_hans: 指示找到此字符串的地点。示例：file.c:46(意思是在第 46 行的 'file.c' 中)。它可以是空格分隔列表，以防发生多次。
zh_hant: 指示找到此字串的地點。示例：file.c:46(意思是在第 46 行的 'file.c' 中)。它可以是空格分隔列表，以防發生多次。

source: a comment added here manually (by the translators). The format here is free.
sv: en kommentar som har lagts till här manuellt (av översättarna). Formatet här är fritt.
zh_hans: 此处手动添加的评论（由翻译人员）。此处的格式是免费的。
zh_hant: 此處手動新增的評論（由翻譯人員）。此處的格式是免費的。

source: a comment which was automatically added by the string extraction program. See the B<--add-comments> option of the B<xgettext> program for more information.
sv: en kommentar som automatiskt lades till av strängutdragningsprogrammet. Se flaggan B<--add-comments> i programmet B<xgettext> för mer information.
zh_hans: 由字符串提取程序自动添加的注释。有关详细信息，请参阅 B<--add-comments> 程序的 B<xgettext> 选项。
zh_hant: 由字串提取程式自動新增的註釋。有關詳細資訊，請參閱 B<--add-comments> 程式的 B<xgettext> 選項。

source: space-separated list of all defined flags for this entry.
sv: mellanslagsavgränsad lista över alla definierade flaggor för denna post.
zh_hans: 此条目的所有已定义标志的以空格分隔的列表。
zh_hant: 此條目的所有已定義標誌的以空格分隔的列表。

source: Valid flags are: B<c-text>, B<python-text>, B<lisp-text>, B<elisp-text>, B<librep-text>, B<smalltalk-text>, B<java-text>, B<awk-text>, B<object-pascal-text>, B<ycp-text>, B<tcl-text>, B<wrap>, B<no-wrap> and B<fuzzy>.
sv: Giltiga flaggor är: B<c-text>, B<python-text>, B<lisp-text>, B<elisp-text>, B<librep-text>, B<smalltalk-text>, B<java-text>, B<awk-text>, B<object-pascal-text>, B<ycp-text>, B<tcl-text>, B<wrap>, B<no-wrap> och B<fuzzy>.
zh_hans: 有效标志为： B<c-text>, B<python-text>, B<lisp-text>, B<elisp-text>, B<librep-text>, B<smalltalk-text>, B<java-text>, B<awk-text>, B<object-pascal-text>, B<ycp-text>, B<tcl-text>, B<wrap>, B<no-wrap> 和 B<fuzzy>.
zh_hant: 有效標誌為： B<c-text>, B<python-text>, B<lisp-text>, B<elisp-text>, B<librep-text>, B<smalltalk-text>, B<java-text>, B<awk-text>, B<object-pascal-text>, B<ycp-text>, B<tcl-text>, B<wrap>, B<no-wrap> 和 B<fuzzy>.

source: See the gettext documentation for their meaning.
sv: Se gettext-dokumentationen för deras betydelse.
zh_hans: 有关它们的含义，请参阅 gettext 文档。
zh_hant: 有關它們的含義，請參閱 gettext 文件。

source: this is mostly an internal argument: it is used while gettextizing documents. The idea here is to parse both the original and the translation into a PO object, and merge them, using one's msgid as msgid and the other's msgid as msgstr. To make sure that things get ok, each msgid in PO objects are given a type, based on their structure (like "chapt", "sect1", "p" and so on in DocBook). If the types of strings are not the same, that means that both files do not share the same structure, and the process reports an error.
sv: detta är främst ett internt argument: det används vid gettextisering av dokument. Tanken här är att analysera både originalet och översättningen till ett PO-objekt och slå ihop dem, med den enas msgid som msgid och den andras msgid som msgstr. För att säkerställa att allt blir korrekt tilldelas varje msgid i PO-objekt en typ baserat på deras struktur (som "chapt", "sect1", "p" och så vidare i DocBook). Om strängtyperna inte är desamma betyder det att de båda filerna inte har samma struktur, och processen rapporterar ett fel.
zh_hans: 这主要是一个内部参数：它是在对文档进行获取文本化时使用的。这里的想法是将原始和翻译都解析成 PO 对象，并将它们合并，使用一个的 msgid 作为 msgid，使用另一个的 msgid 作为 msgstr。为了确保一切正常，PO 对象中的每个 msgid 都根据它们的结构 (就像 DocBook 中的 "chapt"、"sect1"、"p" 等)被赋予一个类型。如果字符串类型不同，则意味着两个文件不共享相同的结构，并且该过程会报告错误。
zh_hant: 這主要是一個內部引數：它是在對文件進行獲取文字化時使用的。這裡的想法是將原始和翻譯都解析成 PO 物件，並將它們合併，使用一個的 msgid 作為 msgid，使用另一個的 msgid 作為 msgstr。為了確保一切正常，PO 物件中的每個 msgid 都根據它們的結構 (就像 DocBook 中的 "chapt"、"sect1"、"p" 等)被賦予一個型別。如果字元串型別不同，則意味著兩個檔案不共享相同的結構，並且該過程會報告錯誤。

source: This information is written as automatic comment in the PO file since this gives to translators some context about the strings to translate.
sv: Denna information skrivs som automatisk kommentar i PO-filen, eftersom det ger översättarna lite sammanhang om de strängar som ska översättas.
zh_hans: 此信息在 PO 文件中作为自动注释写入，因为这为翻译人员提供了有关要翻译的字符串的一些上下文。
zh_hant: 此資訊在 PO 檔案中作為自動註釋寫入，因為這為翻譯人員提供了有關要翻譯的字串的一些上下文。

source: boolean indicating whether whitespaces can be mangled in cosmetic reformattings. If true, the string is canonized before use.
sv: booleskt värde som anger om blanktecken kan ändras vid kosmetiska omformateringar. Om värdet är sant kanoniseras strängen före användning.
zh_hans: 指示在外观中是否可以损坏空格的布尔值。如果为 true，则字符串在使用之前被规范化。
zh_hant: 指示在外觀中是否可以損壞空格的布林值。如果為 true，則字串在使用之前被規範化。

source: This information is written to the PO file using the B<wrap> or B<no-wrap> flag.
sv: Denna information skrivs till PO-filen med hjälp av flaggan B<wrap> eller B<no-wrap>.
zh_hans: 此信息使用 B<wrap> 或 B<no-wrap> 标志写入 PO 文件。
zh_hant: 此資訊使用 B<wrap> 或 B<no-wrap> 標誌寫入 PO 檔案。

source: ignored; the key is kept for backward computability.
sv: ignoreras; nyckeln behålls för bakåtberäkningsbarhet.

source: Miscellaneous functions
sv: Övriga funktioner
zh_hans: 其他功能
zh_hant: 其他功能

source: Returns the number of entries in the catalog (without the header).
sv: Returnerar antalet poster i katalogen (utan rubriken).
zh_hans: 返回目录中的条目数 (不带标题)。
zh_hant: 返回目錄中的條目數 (不帶標題)。

source: Returns the number of entries in document. If a string appears multiple times in the document, it will be counted multiple times.
sv: Returnerar antalet poster i dokumentet. Om en sträng förekommer flera gånger i dokumentet räknas den flera gånger.
zh_hans: 返回文档中的条目数。如果一个字符串在文档中出现多次，则会对其进行多次计数。
zh_hant: 返回文件中的條目數。如果一個字串在文件中出現多次，則會對其進行多次計數。

source: Returns the msgid of the given number.
sv: Returnerar msgid för det angivna numret.
zh_hans: 返回给定数字的 msgid。
zh_hant: 返回給定數字的 msgid。

source: Returns the msgid with the given position in the document.
sv: Returnerar msgid med den angivna positionen i dokumentet.
zh_hans: 返回文档中具有给定位置的 msgid。
zh_hant: 返回文件中具有給定位置的 msgid。

source: Returns the type of the msgid with the given position in the document. This is probably only useful to gettextization, and it's stored separately from {$msgid}{'type'} because the later location may be overwritten by another type when the $msgid is duplicated in the master document.
sv: Returnerar typen av msgid med den angivna positionen i dokumentet. Detta är förmodligen endast användbart för gettextisering, och det lagras separat från {$msgid}{'type'} eftersom den senare platsen kan skrivas över av en annan typ när $msgid dupliceras i huvuddokumentet.

source: Returns the character set specified in the PO header. If it hasn't been set, it will return "UTF-8".
sv: Returnerar teckenuppsättningen som anges i PO-rubriken. Om den inte har angetts returneras "UTF-8".
zh_hans: 返回 PO 标头中指定的字符集。如果没有设置，则返回 "UTF-8"。
zh_hant: 返回 PO 標頭中指定的字符集。如果沒有設定，則返回 "UTF-8"。

source: A small utility function that returns a string with appropriate C<--no-wrap>/C<--width> gettext utilities' options corresponding to the given B<wrap-po> value.
sv: En liten verktygsfunktion som returnerar en sträng med lämpliga flaggor för C-<--no-wrap>/C-<--width> -gettext-verktygen som motsvarar det angivna B-<wrap-po> -värdet.

source: Locale::Po4a::Pod - convert POD data from/to PO files
sv: Locale::Po4a::Pod - konvertera POD-data från/till PO-filer
zh_hans: Locale::Po4a::Pod - 将 POD 数据从/转换为 PO 文件
zh_hant: Locale::Po4a::Pod - 將 POD 資料從/轉換為 PO 檔案

source: Locale::Po4a::Pod is a module to help the translation of documentation in the POD format (the preferred language for documenting Perl) into other [human] languages.
sv: Locale::Po4a::Pod är ett modul som hjälper till att översätta dokumentation i POD-format (det föredragna språket för att dokumentera Perl) till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Pod 是一个模块，用于帮助将 POD 格式(编写 Perl 文档的首选语言)的文档翻译成其他 [人类] 语言。
zh_hant: Locale::Po4a::Pod 是一個模組，用於幫助將 POD 格式(編寫 Perl 文件的首選語言)的文件翻譯成其他 [人類] 語言。

source: A new L<SimplePod|Locale::Po4a::SimplePod> parser is now available. Please consider using it instead of the current Pod module. If you encounter any bugs, your reports would be greatly appreciated.
sv: En ny L<SimplePod|Locale::Po4a::SimplePod>-parser är nu tillgänglig. Överväg att använda den istället för det nuvarande Pod-modulet. Om du stöter på några buggar skulle vi uppskatta om du rapporterar dem.

source: The above warning message will be displayed for a transitional period. To disable it, set the C<no-warn-simple> option.
sv: Ovanstående varningsmeddelande kommer att visas under en övergångsperiod. För att inaktivera det, ställ in flaggan C-<no-warn-simple>.

source: I think that this module is rock stable, and there is only one known bug with F</usr/lib/perl5/Tk/MainWindow.pod> (and some other pages, see below) which contains:
sv: Jag tycker att den här modulen är mycket stabil, och det finns bara en känd bugg med F</usr/lib/perl5/Tk/MainWindow.pod> (och några andra sidor, se nedan) som innehåller:
zh_hans: 我认为这个模块非常稳定，F</usr/lib/perl5/tk/MainWindow.pod> (以及其他一些页面，见下文)中只有一个已知的 bug：
zh_hant: 我認為這個模組非常穩定，F</usr/lib/perl5/tk/MainWindow.pod> (以及其他一些頁面，見下文)中只有一個已知的 bug：

source: Lack of luck, in the po4a version, this was split on the space by the wrapping. As result, in the original version, the man page contains:
sv: Oturen ville att detta i po4a-versionen delades upp på två rader på grund av radbrytningen. Som ett resultat innehåller man-sidan i originalversionen:

source: and mine contains:
sv: och min innehåller:

source: which is logic since CE<lt>foobarE<gt> is rewritten "foobar".
sv: vilket är logiskt eftersom CE<lt>foobarE<gt> omskrivs till "foobar".
zh_hans: 这是因为 CE<lt>foobarE<gt> 被重写为 "foobar" 的逻辑。
zh_hant: 這是因為 CE<lt>foobarE<gt> 被重寫為 "foobar" 的邏輯。

source: Complete list of pages having this problem on my box (from 564 pages; note that it depends on the chosen wrapping column):
sv: Komplett lista över sidor som har detta problem på min dator (av 564 sidor; observera att det beror på den valda radbrytningskolumnen):

source: INTERNALS
sv: INTERNA DELAR
zh_hans: 内件
zh_hant: 內件

source: As a derived class from Pod::Parser, Locale::Po4a::Pod supports the same methods and interfaces. See L<Pod::Parser> for all the details; briefly, one creates a new parser with C<< Locale::Po4a::Pod->new() >> and then calls either parse_from_filehandle() or parse_from_file().
sv: Som en härledd klass från Pod::Parser stöder Locale::Po4a::Pod samma metoder och gränssnitt. Se L<Pod::Parser> för alla detaljer; kortfattat skapar man en ny parser med C<< Locale::Po4a::Pod->new() >> och anropar sedan antingen parse_from_filehandle() eller parse_from_file().
zh_hans: 作为 Pod::Parser 的派生类，Locale::Po4a::Pod 支持相同的方法和接口。有关所有细节，请参见 L<Pod::Parser>；简而言之，使用 C<< Locale::Po4a::Pod->new() >> 创建一个新的解析器，然后调用 parse_from_filehandle() 或 parse_from_file()。
zh_hant: 作為 Pod::Parser 的派生類，Locale::Po4a::Pod 支援相同的方法和介面。有關所有細節，請參見 L<Pod::Parser>；簡而言之，使用 C<< Locale::Po4a::Pod->new() >> 創建一個新的解析器，然後呼叫 parse_from_filehandle() 或 parse_from_file()。

source: Locale::Po4a::RubyDoc -- Convert Ruby Document data from/to PO files
sv: Locale::Po4a::RubyDoc -- Konvertera Ruby Document-data från/till PO-filer
zh_hans: Locale::Po4a::RubyDoc - - 将 Ruby 文档数据从 PO 文件转换为 PO 文件
zh_hant: Locale::Po4a::RubyDoc - - 將 Ruby 文件資料從 PO 檔案轉換為 PO 檔案

source: Locale::Po4a::RubyDoc is a module to help the translation of documentation in the Ruby Document (RD) format (a language used to document Ruby) into other [human] languages.
sv: Locale::Po4a::RubyDoc är ett modul som hjälper till att översätta dokumentation i Ruby Document (RD)-format (ett språk som används för att dokumentera Ruby) till andra [mänskliga] språk.
zh_hans: Locale::Po4a::RubyDoc 是一个帮助将 Ruby 文档 (RD) 格式(一种用于记录 Ruby 的语言) 格式的文档翻译成其他[人类]语言的模块。
zh_hant: Locale::Po4a::RubyDoc 是一個幫助將 Ruby 文件 (RD) 格式(一種用於記錄 Ruby 的語言) 格式的文件翻譯成其他[人類]語言的模組。

source: This module has been successfully tested on simple Ruby Document files covering a good part of the format syntax.
sv: Denna modul har testats framgångsrikt på enkla Ruby Document-filer som täcker en stor del av formatsyntaxen.
zh_hans: 该模块已经在简单的 Ruby 文档文件上成功测试，该文件涵盖了格式语法的很大一部分。
zh_hant: 該模組已經在簡單的 Ruby 文件檔案上成功測試，該檔案涵蓋了格式語法的很大一部分。

source: A known limitation is that it fails to properly recognize the stacked structure of input Ruby Document: this implies that when, for instance, an EnumListItem consists of more than one Block, only the first Block is actually recognized as EnumListItem, while the subsequent ones are considered just as TextBlocks...
sv: En känd begränsning är att den inte korrekt känner igen den staplade strukturen i det inmatade Ruby-dokumentet: detta innebär att när till exempel ett EnumListItem består av mer än ett block, är det bara det första blocket som faktiskt känns igen som EnumListItem, medan de efterföljande blocken betraktas som TextBlocks...
zh_hans: 一个已知的限制是它无法正确识别输入 Ruby 文档的堆叠结构：这意味着，例如，当一个 EnumListItem 由多个 Block 组成时，只有第一个 Block 实际上被识别为 EnumListItem，而后续的块被视为TextBlock...
zh_hant: 一個已知的限制是它無法正確識別輸入 Ruby 文件的堆疊結構：這意味著，例如，當一個 EnumListItem 由多個 Block 組成時，只有第一個 Block 實際上被識別為 EnumListItem，而後續的塊被視為TextBlock...

source: This module supports the following option:
sv: Denna modul stöder följande flagga:
zh_hans: 此模块支持以下选项：
zh_hant: 此模組支援以下選項：

source: Handle files entirely made of Ruby Document formatted text (without any "=begin" line).
sv: Hantera filer som är helt skapade i Ruby-dokumentformaterad text (utan någon "=begin"-rad).
zh_hans: 处理完全由 Ruby 文档格式的文本组成的文件(没有任何 "=begin" 行)。
zh_hant: 處理完全由 Ruby 文件格式的文字組成的檔案(沒有任何 "=begin" 行)。

source: By default, this module only handles Ruby Document formatted text between "=begin" and "=end" lines (hence ignoring, among other things, everything that precedes the first "=begin" line).
sv: Som standard hanterar denna modul endast Ruby Document-formaterad text mellan raderna "=begin" och "=end" (och ignorerar därmed bland annat allt som föregår den första raden "=begin").
zh_hans: 默认情况下，该模块只处理 "=begin" 和 "=end" 行之间的 Ruby 文档格式的文本(因此忽略第一行 "=begin" 之前的所有内容)。
zh_hant: 預設情況下，該模組只處理 "=begin" 和 "=end" 行之間的 Ruby 文件格式的文字(因此忽略第一行 "=begin" 之前的所有內容)。

source: L<Locale::Po4a::TransTractor(3pm)>
sv: L<Locale::Po4a::TransTractor(15:00)>

source: This work is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
sv: Detta verk är fri programvara; du kan distribuera och/eller modifiera det enligt villkoren i GNU General Public License som publicerats av Free Software Foundation; antingen version 2 av licensen eller (efter eget val) någon senare version.
zh_hans: 本作品是自由软件；您可以根据自由软件基金会发布的 GNU 通用公共许可证的条款重新分发和/或修改它；可以是许可证的版本 2，也可以是(根据您的选择)任何更高版本。
zh_hant: 本作品是自由軟體；您可以根據自由軟體基金會發布的 GNU 通用公共許可證的條款重新分發和/或修改它；可以是許可證的版本 2，也可以是(根據您的選擇)任何更高版本。

source: This work is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
sv: Detta verk distribueras i hopp om att det ska vara till nytta, men UTAN NÅGON GARANTI, inte ens den underförstådda garantin om SÄLJBARHET eller LÄMPLIGHET FÖR ETT VISST SYFTE. Se GNU General Public License för mer information.
zh_hans: 分发这项工作的目的是希望它有用，但没有任何担保；甚至没有对适销性或是否适合特定目的的默示担保。有关详细信息，请参阅 GNU 通用公共许可证。
zh_hant: 分發這項工作的目的是希望它有用，但沒有任何擔保；甚至沒有對適銷性或是否適合特定目的的默示擔保。有關詳細資訊，請參閱 GNU 通用公共許可證。

source: You should have received a copy of the GNU General Public License along with this work; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
sv: Du bör ha fått en kopia av GNU General Public License tillsammans med detta verk. Om så inte är fallet, skriv till Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
zh_hans: 您应该已经收到了 GNU 通用公共许可证的副本；如果没有，请写信给自由软件基金会，Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
zh_hant: 您應該已經收到了 GNU 通用公共許可證的副本；如果沒有，請寫信給自由軟體基金會，Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.

source: Parts of the code (such as many regular expressions) were adapted from the source of rdtool, under the terms of the GNU General Public License, version 2 or later. These parts are originally:
sv: Delar av koden (såsom många reguljära uttryck) har anpassats från källkoden till rdtool, enligt villkoren i GNU General Public License, version 2 eller senare. Dessa delar är ursprungligen:
zh_hans: 根据 GNU 通用公共许可证版本 2 或更高版本的条款，部分代码(如许多正则表达式)改编自 rdTool 的源代码。这些部分最初是：
zh_hant: 根據 GNU 通用公共許可證版本 2 或更高版本的條款，部分程式碼(如許多正則表示式)改編自 rdTool 的原始碼。這些部分最初是：

source: The initialize code was adapted from the source of Locale::Po4a::Text, under the terms of the GNU General Public License, version 2 or later. This code was originally:
sv: Initialiseringskoden har anpassats från källkoden för Locale::Po4a::Text, enligt villkoren i GNU General Public License, version 2 eller senare. Denna kod var ursprungligen:
zh_hans: 根据 GNU 通用公共许可证版本 2 或更高版本的条款，从 Locale::Po4a::Text 的源代码改编了初始化代码。此代码最初是：
zh_hant: 根據 GNU 通用公共許可證版本 2 或更高版本的條款，從 Locale::Po4a::Text 的原始碼改編了初始化程式碼。此程式碼最初是：

source: Locale::Po4a::Sgml - convert SGML documents from/to PO files
sv: Locale::Po4a::Sgml - konvertera SGML-dokument från/till PO-filer
zh_hans: Locale::Po4a::Sgml - 将 SGML 文档从/转换为 PO 文件
zh_hant: Locale::Po4a::Sgml - 將 SGML 文件從/轉換為 PO 檔案

source: Locale::Po4a::Sgml is a module to help the translation of documentation in the SGML format into other [human] languages.
sv: Locale::Po4a::Sgml är ett modul som hjälper till att översätta dokumentation i SGML-format till andra [mänskliga] språk.
zh_hans: Locale::Po4a::Sgml 是一个帮助将 SGML 格式的文档翻译成其他 [人类] 语言的模块。
zh_hant: Locale::Po4a::Sgml 是一個幫助將 SGML 格式的文件翻譯成其他 [人類] 語言的模組。

source: This module uses L<onsgmls(1)> to parse the SGML files. Make sure it is installed. Also make sure that the DTD of the SGML files are installed in the system.
sv: Denna modul använder L<onsgmls(1)> för att analysera SGML-filerna. Se till att den är installerad. Se också till att DTD för SGML-filerna är installerade i systemet.

source: Space-separated list of keywords indicating which category of extra debug messages should be shown. Possible values are: C<entities>, C<generic>, C<onsgml>, C<refs> and C<tag>.
sv: Mellanslagsavgränsad lista med nyckelord som anger vilken kategori av extra felsökningsmeddelanden som ska visas. Möjliga värden är: C<entities>, C<generic>, C<onsgml>, C<refs> och C<tag>.

source: Give more information about what's going on.
sv: Ge mer information om vad som händer.
zh_hans: 给出更多关于正在发生的事情的信息。
zh_hant: 給出更多關於正在發生的事情的資訊。

source: Space-separated list of extra tags (beside the DTD provided ones) whose content should form an extra msgid, i.e that should be translated.
sv: Mellanslagsavgränsad lista över extra taggar (utöver de som tillhandahålls av DTD) vars innehåll ska bilda en extra msgid, dvs. som ska översättas.

source: Space-separated list of extra tags (beside the DTD provided ones) containing other tags, some of them being of category B<translate>.
sv: Mellanslagsavgränsad lista över extra taggar (utöver de som tillhandahålls av DTD) som innehåller andra taggar, varav vissa tillhör kategori B<translate>.

source: Space-separated list of tags which increase the indentation level. This will affect the indentation in the resulting document.
sv: Mellanslagsavgränsad lista över taggar som ökar indragningsnivån. Detta påverkar indragningen i det resulterande dokumentet.

source: The layout within those tags should not be changed. The paragraph won't get wrapped, and no extra indentation space or new line will be added for cosmetic purpose.
sv: Layouten inom dessa taggar bör inte ändras. Stycket kommer inte att brytas om, och ingen extra indragning eller ny rad kommer att läggas till av kosmetiska skäl.
zh_hans: 这些标签内的布局不应更改。段落不会换行，也不会添加额外的缩进空间或新行用于修饰。
zh_hant: 這些標籤內的佈局不應更改。段落不會換行，也不會新增額外的縮排空間或新行用於修飾。

source: Tags not needing to be closed.
sv: Taggar som inte behöver stängas.
zh_hans: 标签不需要关闭。
zh_hant: 標籤不需要關閉。

source: Tags ignored and considered as plain char data by po4a. That is to say that they can be part of an msgid. For example, E<lt>bE<gt> is a good candidate for this category since putting it in the B<translate> section would create msgids with only its content, which is bad since it's usually not a whole sentence.
sv: Taggar som ignoreras och betraktas som vanliga tecken av po4a. Det vill säga att de kan ingå i en msgid. Till exempel är E<lt>bE<gt> en bra kandidat för denna kategori, eftersom om man placerar den i avsnittet B<translate> skulle det skapas msgids med endast dess innehåll, vilket är dåligt eftersom det vanligtvis inte är en hel mening.

source: A space-separated list of attributes that need to be translated. You can specify the attributes by their name (for example, C<lang>), but you can also prefix it with a tag hierarchy, to specify that this attribute will only be translated when it is into the specified tag. For example: C<< <bbb><aaa>lang >> specifies that the C<lang> attribute will only be translated if it is in an C<< <aaa> >> tag, which is in a C<< <bbb> >> tag. The tag names are actually regular expressions so you can also write things like C<< <aaa|bbb>lang >> to only translate C<lang> attributes that are in an C<< <aaa> >> or a C<< <bbb> >> tag.
sv: En lista med attribut som behöver översättas, separerade med mellanslag. Du kan ange attributen med deras namn (till exempel C<lang>), men du kan också lägga till en tagghierarki framför namnet för att ange att attributet endast ska översättas när det finns i den angivna taggen. Till exempel: C<< <bbb><aaa>lang >> anger att attributet C<lang> endast ska översättas om det finns i en C<< <aaa> >>-tagg, som finns i en C<< <bbb> >>-tagg. Taggnamnen är egentligen reguljära uttryck, så du kan också skriva saker som C<< <aaa|bbb>lang >> för att endast översätta C<lang> -attribut som finns i en C<< <aaa> >>- eller en C<< <bbb> >>-tagg.

source: A space-separated list of attributes for which the translation must be qualified by the attribute name, i.e. the text extracted for the translation will include both the attributes name and it's value. E.g. for a tag like C<< <aaa lang_en="foo"> >> translators will be presented with the string C<lang_en="foo">. Note that this automatically adds the given attribute into the B<attributes> list, too.
sv: En lista med attribut separerade med mellanslag för vilka översättningen måste kvalificeras med attributnamnet, dvs. texten som extraheras för översättningen kommer att inkludera både attributnamnet och dess värde. Till exempel för en tagg som C<< <aaa lang_en="foo"> >> kommer översättarna att få strängen C<lang_en="foo">. Observera att detta automatiskt lägger till det angivna attributet i listan B<attributes> också.

source: Proceed even if the DTD is unknown or if L<onsgmls(1)> finds errors in the input file.
sv: Fortsätt även om DTD är okänt eller om L<onsgmls(1)> hittar fel i inmatningsfilen.
