Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: With this line, po4a will produce separate POT and PO files for each document to translate. For example, if you have 3 documents and 5 languages, this will result in 3 POT files and 15 PO files. These files are named as specified on the C<po4a_paths> template, with C<$master> substituted to the basename of each document to translate. In case of name conflict, you can specify the POT file to use as follows, with the C<pot=> parameter.
sv: Med denna rad kommer po4a att skapa separata POT- och PO-filer för varje dokument som ska översättas. Om du till exempel har 3 dokument och 5 språk kommer detta att resultera i 3 POT-filer och 15 PO-filer. Dessa filer namnges enligt specifikationen i mallen C<po4a_paths>, där C<$master> ersätts med basnamnet på varje dokument som ska översättas. Vid namnskonflikter kan du ange vilken POT-fil som ska användas på följande sätt, med parametern C<pot=>.

source: This feature can also be used to group several translated files into the same POT file. The following example only produces 2 POT files: F<l10n/po/foo.pot> (containing the material from F<foo/gui.xml>) and F<l10n/po/bar.pot> (containing the material from both F<bar/gui.xml> and F<bar/cli.xml>).
sv: Denna funktion kan också användas för att gruppera flera översatta filer i samma POT-fil. Följande exempel ger endast två POT-filer: F<l10n/po/foo.pot> (innehåller materialet från F<foo/gui.xml>) och F<l10n/po/bar.pot> (innehåller materialet från både F<bar/gui.xml> och F<bar/cli.xml>).

source: In split mode, B<po4a> builds a temporary compendium during the PO update, to share the translations between all the PO files. If two PO files have different translations for the same string, B<po4a> will mark this string as fuzzy and will submit both translations in all the PO files containing this string. When unfuzzied by the translator, the translation is automatically used in every PO files.
sv: I delat läge skapar B<po4a> ett tillfälligt kompendium under PO-uppdateringen för att dela översättningarna mellan alla PO-filer. Om två PO-filer har olika översättningar för samma sträng markerar B<po4a> denna sträng som oklar och skickar båda översättningarna i alla PO-filer som innehåller denna sträng. När översättaren har klargjort översättningen används den automatiskt i alla PO-filer.
zh_hans: 在 split 模式下，B<po4a> 在 PO 更新期间构建一个临时概要，以便在所有 PO 文件之间共享翻译。如果两个 PO 文件对同一字符串有不同的翻译，B<po4a> 将此字符串标记为 fuzzy，并将在包含此字符串的所有 PO 文件中提交两个翻译。当翻译人员解除困惑时，翻译将自动用于每个 PO 文件中。
zh_hant: 在 split 模式下，B<po4a> 在 PO 更新期間構建一個臨時概要，以便在所有 PO 檔案之間共享翻譯。如果兩個 PO 檔案對同一字串有不同的翻譯，B<po4a> 將此字串標記為 fuzzy，並將在包含此字串的所有 PO 檔案中提交兩個翻譯。當翻譯人員解除困惑時，翻譯將自動用於每個 PO 檔案中。

source: Specifying the documents to translate
sv: Ange vilka dokument som ska översättas
zh_hans: 指定要翻译的文档
zh_hant: 指定要翻譯的文件

source: You must also list the documents that should be translated. For each master file, you must specify the format parser to use, the location of the translated document to produce, and optionally some configuration. File names should be quoted or escaped if they contain spaces. Here is an example:
sv: Du måste också ange vilka dokument som ska översättas. För varje huvudfil måste du ange vilken formatparser som ska användas, var det översatta dokumentet ska sparas och eventuellt vissa konfigurationsinställningar. Filnamn ska anges inom citationstecken eller med escape-tecken om de innehåller mellanslag. Här är ett exempel:

source: But again, these complex lines are difficult to read and modify, e.g. when adding a new language. It is much simpler to reorganize things using the C<$lang> template as follows:
sv: Men återigen är dessa komplexa rader svåra att läsa och ändra, t.ex. när man lägger till ett nytt språk. Det är mycket enklare att omorganisera saker med hjälp av mallen C<$lang> enligt följande:
zh_hans: 但同样，这些复杂的行很难阅读和修改，例如在添加新语言时。使用 C<$lang> 模板重新组织内容要简单得多，如下所示：
zh_hant: 但同樣，這些複雜的行很難閱讀和修改，例如在新增新語言時。使用 C<$lang> 模板重新組織內容要簡單得多，如下所示：

source: Specifying options
sv: Ange flaggor
zh_hans: 指定选项
zh_hant: 指定選項

source: There is two types of options: I<po4a options> are default values to the po4a command line options while I<format options> are used to change the behavior of the format parsers. As a I<po4a options>, you could for example specify in your configuration file that the default value of the B<--keep> command line parameter is 50% instead of 80%. I<Format options> are documented on the specific page of each parsing module, e.g. L<Locale::Po4a::Xml(3pm)>. You could for example pass B<nostrip> to the XML parser to not strip the spaces around the extracted strings.
sv: Det finns två typer av flaggor: I<po4a options> är standardvärden för po4a-kommandoradsflaggorna, medan I<format options> används för att ändra formatparsarnas beteende. Som ett I<po4a options> kan du till exempel ange i din konfigurationsfil att standardvärdet för kommandoradsparametern B<--keep> är 50% i istället för 80 %. I<Format options> finns dokumentation på den specifika sidan för varje parsningsmodul, t.ex. L<Locale::Po4a::Xml(3pm)>. Du kan till exempel skicka B<nostrip> till XML-parsern för att inte ta bort mellanslagen runt de extraherade strängarna.
zh_hans: 有两种类型的选项：I<po4a options> 是 po4a 命令行选项的默认值，而 I<format options> 用于更改格式分析器的行为。作为 I<po4a options>，您可以在配置文件中指定 B<--keep> 命令行参数的默认值是 50%，而不是 80%。I<Format options> 记录在每个解析模块的特定页面上，例如 L<Locale::Po4a::Xml(3pm)>。例如，您可以将 B<nostrip> 传递给 XML 解析器，以不除去提取的字符串周围的空格。
zh_hant: 有兩種型別的選項：I<po4a options> 是 po4a 命令列選項的預設值，而 I<format options> 用於更改格式分析器的行為。作為 I<po4a options>，您可以在配置檔案中指定 B<--keep> 命令列引數的預設值是 50%，而不是 80%。I<Format options> 記錄在每個解析模組的特定頁面上，例如 L<Locale::Po4a::Xml(3pm)>。例如，您可以將 B<nostrip> 傳遞給 XML 解析器，以不除去提取的字串周圍的空格。

source: You can pass these options for a specific master file, or even for a specific translation of that file, using C<opt:> and C<opt_XX:> for the C<XX> language. In the following example, the B<nostrip> option is passed to the XML parser (for all languages), while the threshold will be reduced to 0% for the French translation (that is thus always kept).
sv: Du kan skicka dessa flaggor för en specifik huvudfil, eller till och med för en specifik översättning av den filen, med hjälp av C<opt:> och C<opt_XX:> för språket C<XX>. I följande exempel skickas flaggan B<nostrip> till XML-tolkaren (för alla språk), medan tröskelvärdet reduceras till 0% f för den franska översättningen (som därmed alltid behålls).
zh_hans: 您可以为特定主文件传递这些选项，甚至为该文件的特定翻译传递这些选项，使用 C<opt:> 和 C<opt_XX:> 作为 C<XX> 语言。在下面的示例中， B<nostrip> 选项被传递给 XML 解析器（对于所有语言），而对于法语翻译，阈值将降低到 0%（因此始终保持）。
zh_hant: 您可以為特定主檔案傳遞這些選項，甚至為該檔案的特定翻譯傳遞這些選項，使用 C<opt:> 和 C<opt_XX:> 作為 C<XX> 語言。在下面的示例中， B<nostrip> 選項被傳遞給 XML 解析器（對於所有語言），而對於法語翻譯，閾值將降低到 0%（因此始終保持）。

source: In any case, these configuration chunks must be located at the end of the line. The declaration of files must come first, then the addendum if any (see below), and then only the options. The grouping of configuration chunks is not very important, since elements are internally concatenated as strings. The following examples are all equivalent:
sv: I alla fall måste dessa konfigurationsdelar placeras i slutet av raden. Deklarationen av filer måste komma först, sedan eventuella tillägg (se nedan) och därefter endast flaggorna. Grupperingen av konfigurationsdelar är inte särskilt viktig, eftersom elementen internt sammanfogas som strängar. Följande exempel är alla likvärdiga:
zh_hans: 无论如何，这些配置块必须位于行的末尾。必须先声明文件，然后才是附录（如有）（见下文），然后才是选项。配置块的分组不是很重要，因为元素在内部连接为字符串。以下示例都是等效的：
zh_hant: 無論如何，這些配置塊必須位於行的末尾。必須先宣告檔案，然後才是附錄（如有）（見下文），然後才是選項。配置塊的分組不是很重要，因為元素在內部連線為字元串。以下示例都是等效的：

source: Note that language specific options are not used when building the POT file. It is for example impossible to pass B<nostrip> to the parser only when building the French translation, because the same POT file is used to update every languages. So the only options that can be language-specific are the ones that are used when producing the translation, as the C<--keep> option.
sv: Observera att språkspecifika flaggor inte används när POT-filen skapas. Det är till exempel omöjligt att endast skicka B<nostrip> till parsern när den franska översättningen skapas, eftersom samma POT-fil används för att uppdatera alla språk. De enda flaggor som kan vara språkspecifika är därför de som används när översättningen skapas, såsom flaggan C<--keep>.
zh_hans: 请注意，生成 POT 文件时不使用特定于语言的选项。例如，仅在构建法语翻译时，不可能将 B<nostrip> 传递给解析器，因为同一 POT 文件用于更新每种语言。因此，唯一可以特定于语言的选项是生成翻译时使用的选项，如 C<--keep> 选项。
zh_hant: 請注意，生成 POT 檔案時不使用特定於語言的選項。例如，僅在構建法語翻譯時，不可能將 B<nostrip> 傳遞給解析器，因為同一 POT 檔案用於更新每種語言。因此，唯一可以特定於語言的選項是生成翻譯時使用的選項，如 C<--keep> 選項。

source: Configuration aliases
sv: Konfigurationsalias
zh_hans: 配置别名
zh_hant: 配置別名

source: To pass the same options to several files, the best is to define a type alias as follows. In the next example, C<--keep 0> is passed to every Italian translation using this C<test> type, that is an extension of the C<man> type.
sv: För att överföra samma flaggor till flera filer är det bäst att definiera ett typalias enligt följande. I nästa exempel överförs C<--keep 0> till alla italienska översättningar med hjälp av denna C<test> -typ, som är en utvidgning av C<man> -typen.
zh_hans: 要将相同的选项传递给多个文件，最好的方法是按如下所示定义类型别名。在下一个示例中，使用此 C<test> 类型（即 C<man> 类型的扩展）将 C<--keep 0> 传递给每个意大利语翻译。
zh_hant: 要將相同的選項傳遞給多個檔案，最好的方法是按如下所示定義類型別名。在下一個示例中，使用此 C<test> 型別（即 C<man> 型別的擴充套件）將 C<--keep 0> 傳遞給每個意大利語翻譯。

source: You can also extend an existing type reusing the same name for the alias as follows. This is not interpreted as as an erroneous recursive definition.
sv: Du kan också utöka en befintlig typ genom att återanvända samma namn för aliaset på följande sätt. Detta tolkas inte som en felaktig rekursiv definition.
zh_hans: 还可以对现有类型进行扩展，对别名使用相同的名称，如下所示。这不是一个错误的递归定义。
zh_hant: 還可以對現有型別進行擴充套件，對別名使用相同的名稱，如下所示。這不是一個錯誤的遞歸定義。

source: Global default options
sv: Globala standardflaggor
zh_hans: 全局默认选项
zh_hant: 全域性預設選項

source: You can also use C<[options]> lines to define options that must be used for all files, regardless of their type.
sv: Du kan också använda C<[options]>-rader för att definiera flaggor som måste användas för alla filer, oavsett typ.
zh_hans: 您还可以使用 C<[options]> 行定义必须用于所有文件的选项，无论其类型如何。
zh_hant: 您還可以使用 C<[options]> 行定義必須用於所有檔案的選項，無論其型別如何。

source: [options] --keep 20 --option nostrip
sv: [flaggor] --keep 20 --option nostrip

source: As with the command line options, you can abbreviate the parameters passed in the configuration file:
sv: Precis som med kommandoradsflaggor kan du förkorta parametrarna som skickas i konfigurationsfilen:
zh_hans: 与命令行选项一样，您可以缩写配置文件中传递的参数：
zh_hant: 與命令列選項一樣，您可以縮寫配置檔案中傳遞的引數：

source: [options] -k 20 -o nostrip
sv: [flaggor] -k 20 -o nostrip

source: Option priorities
sv: Flaggprioriteringar
zh_hans: 选项优先权
zh_hant: 選項優先權

source: The options of every sources are concatenated, ensuring that the default values can easily be overridden by more specific options. The order is as follows:
sv: Flaggorna för varje källa är sammankopplade, vilket säkerställer att standardvärdena enkelt kan åsidosättas av mer specifika flaggor. Ordningen är följande:
zh_hans: 每个源的选项都是串联的，确保默认值可以很容易地被更具体的选项覆盖。顺序如下：
zh_hant: 每個源的選項都是串聯的，確保預設值可以很容易地被更具體的選項覆蓋。順序如下：

source: C<[options]> lines provide default values that can be overridden by any other source.
sv: C<[options]>-rader anger standardvärden som kan åsidosättas av andra källor.
zh_hans: C<[options]> 行提供可由任何其他源重写的默认值。
zh_hant: C<[options]> 行提供可由任何其他源重寫的預設值。

source: Type aliases are then used. Language specific settings override the ones applicable to all languages.
sv: Därefter används typalias. Språkspecifika inställningar åsidosätter de inställningar som gäller för alla språk.
zh_hans: 然后使用类型别名。特定于语言的设置将覆盖适用于所有语言的设置。
zh_hant: 然後使用類型別名。特定於語言的設定將覆蓋適用於所有語言的設定。

source: Settings that are specific to a given master file override both the default ones and the ones coming from the type alias. In this case also, language specific settings override the global ones.
sv: Inställningar som är specifika för en viss huvudfil åsidosätter både standardinställningarna och de som kommer från typalias. Även i detta fall åsidosätter språkspecifika inställningar de globala inställningarna.
zh_hans: 特定于给定主文件的设置将同时覆盖默认设置和来自类型别名的设置。在这种情况下，特定于语言的设置也会覆盖全局设置。
zh_hant: 特定於給定主檔案的設定將同時覆蓋預設設定和來自類型別名的設定。在這種情況下，特定於語言的設定也會覆蓋全域性設定。

source: Finally, parameters provided on the B<po4a> command line override any settings from the configuration file.
sv: Slutligen åsidosätter parametrar som anges på kommandoraden för B-<po4a> en alla inställningar från konfigurationsfilen.
zh_hans: 最后，B<po4a> 命令行上提供的参数会覆盖配置文件中的任何设置。
zh_hant: 最後，B<po4a> 命令列上提供的引數會覆蓋配置檔案中的任何設定。

source: Example
sv: Exempel
zh_hans: 示例
zh_hant: 示例

source: Here is an example showing how to quote the spaces and quotes:
sv: Här är ett exempel som visar hur man citerar mellanslag och citattecken:
zh_hans: 下面是一个示例，演示如何引用空格和引号：
zh_hant: 下面是一個示例，演示如何引用空格和引號：

source: Addendum: Adding extra content in the translation
sv: Tillägg: Lägga till extra innehåll i översättningen
zh_hans: 附录：在译文中增加额外内容
zh_hant: 附錄：在譯文中增加額外內容

source: If you want to add an extra section to the translation, for example to give credit to the translator, then you need to define an addendum to the line defining your master file. Please refer to the page L<po4a(7)> for more details on the syntax of addendum files.
sv: Om du vill lägga till ett extra avsnitt i översättningen, till exempel för att ge översättaren kredit, måste du definiera ett tillägg till raden som definierar din huvudfil. Se sidan L<po4a(7)> för mer information om syntaxen för tilläggsfiler.
zh_hans: 如果您想在翻译中添加一个额外的部分，例如给翻译人员加学分，那么您需要在定义主文件的行中定义一个附录。有关附录文件语法的更多详细信息，请参阅第 L<po4a(7)> 页。
zh_hant: 如果您想在翻譯中新增一個額外的部分，例如給翻譯人員加學分，那麼您需要在定義主檔案的行中定義一個附錄。有關附錄檔案語法的更多詳細資訊，請參閱第 L<po4a(7)> 頁。

source: You can also use language templates as follow:
sv: Du kan också använda språkmallar enligt följande:
zh_hans: 您还可以使用语言模板，如下所示：
zh_hant: 您還可以使用語言模板，如下所示：

source: If an addendum fails to apply, the translation is discarded.
sv: Om ett tillägg inte är tillämpligt, kasseras översättningen.
zh_hans: 如果补遗不适用，翻译将被丢弃。
zh_hant: 如果補遺不適用，翻譯將被丟棄。

source: Modifiers for the addendum declaration
sv: Modifierare för tilläggsdeklarationen
zh_hans: 附录声明的修饰符
zh_hant: 附錄宣告的修飾符

source: Addendum modifiers can simplify the configuration file in the case where not all languages provide an addendum, or when the list of addenda changes from one language to the other. The modifier is a single char located before the file name.
sv: Tilläggsmodifierare kan förenkla konfigurationsfilen i fall där inte alla språk har ett tillägg, eller när listan över tillägg varierar mellan olika språk. Modifieraren är ett enda tecken som placeras före filnamnet.
zh_hans: 在并非所有语言都提供附录的情况下，或者当附录列表从一种语言更改为另一种语言时，附录修饰符可以简化配置文件。修饰符是位于文件名之前的单个字符。
zh_hant: 在並非所有語言都提供附錄的情況下，或者當附錄列表從一種語言更改為另一種語言時，附錄修飾符可以簡化配置檔案。修飾符是位於檔名之前的單個字元。

source: Include I<addendum_path> if this file does exist, otherwise do nothing.
sv: Inkludera I<addendum_path> om denna fil finns, annars gör ingenting.
zh_hans: 如果此文件确实存在，请包括 I<appendment_path>，否则不执行任何操作。
zh_hant: 如果此檔案確實存在，請包括 I<appendment_path>，否則不執行任何操作。

source: I<addendum_path> is not a regular addendum but a file containing a list of addenda, one by line. Each addendum may be preceded by modifiers.
sv: I<addendum_path> är inte ett vanligt tillägg utan en fil som innehåller en lista med tillägg, ett per rad. Varje tillägg kan föregås av modifierare.
zh_hans: I<addendment_path> 不是常规的附录，而是一个逐行包含附录列表的文件。每个附录前面都可以加上修饰符。
zh_hant: I<addendment_path> 不是常規的附錄，而是一個逐行包含附錄列表的檔案。每個附錄前面都可以加上修飾符。

source: I<addendum_path> is discarded, it is not loaded and will not be loaded by any further addendum specification.
sv: I<addendum_path> kasseras, det laddas inte och kommer inte att laddas av någon ytterligare tilläggsspecifikation.
zh_hans: I<appendment_path> 被丢弃，它不会被加载，也不会被任何进一步的附录规范加载。
zh_hant: I<appendment_path> 被丟棄，它不會被載入，也不會被任何進一步的附錄規範載入。

source: The following includes an addendum in any language, but if only it exists. No error is reported if the addendum does not exist.
sv: Följande inkluderar ett tillägg på valfritt språk, men endast om det finns. Inget fel rapporteras om tillägget inte finns.
zh_hans: 以下内容包括任何语言的附录，但前提是该附录存在。如果附录不存在，则不会报告任何错误。
zh_hant: 以下內容包括任何語言的附錄，但前提是該附錄存在。如果附錄不存在，則不會報告任何錯誤。

source: The following includes a list of addendum for every language:
sv: Nedan följer en lista med tillägg för varje språk:
zh_hans: 以下为每种语言的附录清单：
zh_hant: 以下為每種語言的附錄清單：

source: Filtering the translated strings
sv: Filtrera de översatta strängarna
zh_hans: 过滤翻译的字符串
zh_hant: 過濾翻譯的字串

source: Sometimes, you want to hide some strings from the translation process. To that extend, you can give a C<pot_in> parameter to your master file to specify the name of the file to use instead of the real master when building the POT file. Here is an example:
sv: Ibland vill man dölja vissa strängar från översättningsprocessen. I så fall kan man ange en C<pot_in>-parameter i huvudfilen för att ange namnet på den fil som ska användas istället för den riktiga huvudfilen när POT-filen skapas. Här är ett exempel:
zh_hans: 有时候，你想在翻译过程中隐藏一些字符串。为此，可以为主文件指定一个 C<pot_in> 参数，以指定在生成 pot 文件时要使用的文件名，而不是实际的主文件名。下面是一个例子：
zh_hant: 有時候，你想在翻譯過程中隱藏一些字串。為此，可以為主檔案指定一個 C<pot_in> 引數，以指定在生成 pot 檔案時要使用的檔名，而不是實際的主檔名。下面是一個例子：

source: With this setting, the strings to translate will be extracted from the F<book-filtered.xml> (that must be produced before calling B<po4a>) while the translated files will be built from F<book.xml>. As a result, any string that is part of F<book.xml> but not in F<book-filtered.xml> will not be included in the PO files, preventing the translators from providing a translation for them. So these strings will be left unmodified when producing the translated documents. This naturally decreases the level of translation, so you may need the C<--keep> option to ensure that the document is produced anyway.
sv: Med denna inställning kommer strängarna som ska översättas att extraheras från F<book-filtered.xml> (som måste skapas innan B<po4a> anropas), medan de översatta filerna kommer att skapas från F<book.xml>. Som ett resultat kommer alla strängar som ingår i F<book.xml> men inte i F<book-filtered.xml> inte att inkluderas i PO-filerna, vilket förhindrar översättarna från att översätta dem. Dessa strängar kommer alltså att lämnas oförändrade när de översatta dokumenten skapas. Detta minskar naturligtvis översättningsnivån, så du kan behöva flaggan C<--keep> för att säkerställa att dokumentet skapas ändå.
zh_hans: 使用此设置，将从 F<book-filtered.xml> （必须在调用 B<po4a> 之前生成），而转换后的文件将从生成 F<book.xml> 文件. 因此，任何属于F的字符串 F<book.xml> 文件但不在 F<book-filtered.xml> 不会包含在 PO 文件中，从而阻止翻译人员为其提供翻译。因此，在生成翻译的文档时，这些字符串将保持不变。这自然会降低翻译的级别，因此您可能需要使用 C<--keep> 选项来确保无论如何都会生成文档。
zh_hant: 使用此設定，將從 F<book-filtered.xml> （必須在呼叫 B<po4a> 之前生成），而轉換後的檔案將從生成 F<book.xml> 檔案. 因此，任何屬於F的字串 F<book.xml> 檔案但不在 F<book-filtered.xml> 不會包含在 PO 檔案中，從而阻止翻譯人員為其提供翻譯。因此，在生成翻譯的文件時，這些字串將保持不變。這自然會降低翻譯的級別，因此您可能需要使用 C<--keep> 選項來確保無論如何都會生成文件。

source: AUTHORS
sv: UPPHOVSPERSONER
zh_hans: 作者
zh_hant: 作者

source: COPYRIGHT AND LICENSE
sv: UPPHOVSRÄTT OCH LICENS
zh_hans: 版权和许可
zh_hant: 版權和許可

source: Copyright 2002-2023 by SPI, inc.
sv: Copyright 2002-2023 av SPI, inc.

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL v2.0 or later (see the COPYING file).
sv: Detta program är fri programvara; du får distribuera och/eller modifiera det enligt villkoren i GPL v2.0 eller senare (se filen COPYING).

source: po4a-gettextize - convert an original file (and its translation) to a PO file
sv: po4a-gettextize - konvertera en originalfil (och dess översättning) till en PO-fil
zh_hans: po4a-gettexalize-convert 将原始文件(及其翻译)转换为 PO 文件
zh_hant: po4a-gettexalize-convert 將原始檔案(及其翻譯)轉換為 PO 檔案

source: (I<XX.po> is the output, all others are inputs)
sv: (I<XX.po> är utdata, alla andra är indata)

source: The B<po4a-gettextize> script helps you converting your previously existing translations into a po4a-based workflow. This is only to be done once to salvage an existing translation while converting to po4a, not on a regular basis after the conversion of your project. This tedious process is explained in details in Section 'Converting a manual translation to po4a' below.
sv: Skriptet B<po4a-gettextize> hjälper dig att konvertera dina befintliga översättningar till ett po4a-baserat arbetsflöde. Detta behöver endast göras en gång för att rädda en befintlig översättning vid konvertering till po4a, inte regelbundet efter konverteringen av ditt projekt. Denna mödosamma process förklaras i detalj i avsnittet "Konvertera en manuell översättning till po4a" nedan.

source: You must provide both a master file (e.g., the source in English) and an existing translated file (e.g., a previous translation attempt without po4a). If you provide more than one master or translation files, they will be used in sequence, but it may be easier to gettextize each page or chapter separately and then use L<msgmerge(1)> to merge all produced PO files. As you wish.
sv: Du måste tillhandahålla både en huvudfil (t.ex. källan på engelska) och en befintlig översatt fil (t.ex. ett tidigare översättningsförsök utan po4a). Om du tillhandahåller mer än en huvudfil eller översättningsfil kommer de att användas i sekvens, men det kan vara enklare att gettextisera varje sida eller kapitel separat och sedan använda L<msgmerge(1)> för att slå samman alla producerade PO-filer. Som du önskar.

source: If the master document has non-ASCII characters, the new generated PO file will be in UTF-8. If the master document is completely in ASCII, the generated PO will use the encoding of the translated input document.
sv: Om huvuddokumentet innehåller icke-ASCII-tecken kommer den nya genererade PO-filen att vara i UTF-8. Om huvuddokumentet är helt i ASCII kommer den genererade PO-filen att använda kodningen i det översatta indokumentet.

source: Format of the documentation you want to handle. Use the B<--help-format> option to see the list of available formats.
sv: Format på den dokumentation du vill hantera. Använd flaggan B-<--help-format> för att se listan över tillgängliga format.
zh_hans: 要处理的文档的格式。使用 B<--help-format> 帮助格式选项查看可用格式的列表。
zh_hant: 要處理的文件的格式。使用 B<--help-format> 幫助格式選項檢視可用格式的列表。

source: File containing the master document to translate. You can use this option multiple times if you want to gettextize multiple documents.
sv: Fil som innehåller huvuddokumentet som ska översättas. Du kan använda den här flaggan flera gånger om du vill gettexta flera dokument.
zh_hans: 包含要翻译的主文档的文件。如果要对多个文档进行文本化，可以多次使用此选项。
zh_hant: 包含要翻譯的主文件的檔案。如果要對多個文件進行文字化，可以多次使用此選項。

source: Charset of the file containing the document to translate.
sv: Teckenuppsättning för filen som innehåller dokumentet som ska översättas.
zh_hans: 包含要翻译的文档的文件的字符集。
zh_hant: 包含要翻譯的文件的檔案的字符集。

source: File containing the localized (translated) document. If you provided multiple master files, you may wish to provide multiple localized file by using this option more than once.
sv: Fil som innehåller det lokaliserade (översatta) dokumentet. Om du har angett flera huvudfiler kan du ange flera lokaliserade filer genom att använda den här flaggan flera gånger.
zh_hans: 包含本地化（已翻译）文档的文件。如果提供了多个主文件，您可能希望多次使用此选项提供多个本地化文件。
zh_hant: 包含本地化（已翻譯）文件的檔案。如果提供了多個主檔案，您可能希望多次使用此選項提供多個本地化檔案。

source: Charset of the file containing the localized document.
sv: Teckenuppsättning för filen som innehåller det lokaliserade dokumentet.
zh_hans: 包含本地化文档的文件的字符集。
zh_hant: 包含本地化文件的檔案的字符集。

source: File where the message catalog should be written. If not given, the message catalog will be written to the standard output.
sv: Fil där meddelandekatalogen ska skrivas. Om ingen fil anges kommer meddelandekatalogen att skrivas till standardutmatningen.
zh_hans: 消息目录应写入的文件。如果未给出，消息目录将写入标准输出。
zh_hant: 訊息目錄應寫入的檔案。如果未給出，訊息目錄將寫入標準輸出。
