Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: po4a-translate - convert a PO file back to documentation format
sv: po4a-translate – konvertera en PO-fil tillbaka till dokumentationsformat
zh_hans: po4a-translate - 将 PO 文件转换回文档格式
zh_hant: po4a-translate - 將 PO 檔案轉換回文件格式

source: (I<XX.doc> is the output, all others are inputs)
sv: (I<XX.doc> är utdata, alla andra är indata)
zh_hans: （I<XX.doc> 是输出，所有其他都是输入）
zh_hant: （I<XX.doc> 是輸出，所有其他都是輸入）

source: The B<po4a-translate> script is in charge of converting the translation (which was done in a PO file) back into the documentation format. The provided PO file should be the translation of the POT file which was produced by L<po4a-gettextize(1)>.
sv: Skriptet B<po4a-translate> ansvarar för att konvertera översättningen (som gjordes i en PO-fil) tillbaka till dokumentationsformatet. Den medföljande PO-filen ska vara översättningen av POT-filen som skapades av L<po4a-gettextize(1)>.
zh_hans: B<po4a-translate> 负责将翻译（在 PO 文件中完成）转换回文档格式。提供的 PO 文件应该是由 L<po4a-gettextize(1)> 生成产生的 POT 文件的翻译。
zh_hant: B<po4a-translate> 負責將翻譯（在 PO 檔案中完成）轉換回文件格式。提供的 PO 文件應該是由 L<po4a-gettextize(1)> 生成產生的 POT 檔案的翻譯。

source: Add a file to the resulting file (to put translator's name or a section "About this translation", for example). The first line of the file to insert should be a PO4A header indicating where it should be added (see section B<HOWTO add extra text to translations> in L<po4a(7)>).
sv: Lägg till en fil till den resulterande filen (för att till exempel ange översättarens namn eller en sektion "Om denna översättning"). Den första raden i filen som ska infogas ska vara en PO4A-rubrik som anger var den ska läggas till (se avsnitt B<HOWTO add extra text to translations> i L<po4a(7)>).
zh_hans: 将文件添加到生成的文件中（例如，将翻译的名称或"关于此翻译"部分）。要插入的文件的第一行应该是 PO4A 标头，指示应添加它的位置（请参阅 L<po4a(7)> 中的第 B<HOWTO add extra text to translations> 部分）。
zh_hant: 將檔案新增到生成的檔案中（例如，將翻譯的名稱或"關於此翻譯"部分）。要插入的檔案的第一行應該是 PO4A 標頭，指示應新增它的位置（請參閱 L<po4a(7)> 中的第 B<HOWTO add extra text to translations> 部分）。

source: File containing the master document to translate.
sv: Fil som innehåller huvuddokumentet som ska översättas.
zh_hans: 包含要翻译的主文档的文件。
zh_hant: 包含要翻譯的主文件的檔案。

source: File where the localized (translated) document should be written.
sv: Fil där det lokaliserade (översatta) dokumentet ska skrivas.
zh_hans: 应写入本地化（已翻译）文档的文件。
zh_hant: 應寫入本地化（已翻譯）文件的檔案。

source: File from which the message catalog should be read.
sv: Fil från vilken meddelandekatalogen ska läsas.
zh_hans: 应从中读取消息目录的文件。
zh_hant: 應從中讀取訊息目錄的檔案。

source: Minimal threshold for translation percentage to keep (i.e. write) the resulting file (default: 80). I.e. by default, files have to be translated at least at 80% to get written.
sv: Minimigräns för översättningsprocent för att behålla (dvs. skriva) den resulterande filen (standard: 80). Dvs. som standard måste filer översättas till minst 80% to för att skrivas.
zh_hans: 要保留（即写入）生成的文件（默认值：80）的最小阈值。即默认情况下，文件必须至少翻译 80% 才能写入。
zh_hant: 要保留（即寫入）生成的檔案（預設值：80）的最小閾值。即預設情況下，檔案必須至少翻譯 80% 才能寫入。

source: Adding content (beside translations) to generated files
sv: Lägga till innehåll (förutom översättningar) till genererade filer
zh_hans: 向生成的文件添加内容（翻译旁边）
zh_hant: 向生成的檔案新增內容（翻譯旁邊）

source: To add some extra content to the generated document beside what you translated (like the name of the translator, or an "About this translation" section), you should use the B<--addendum> option.
sv: För att lägga till extra innehåll till det genererade dokumentet utöver det du översatt (som översättarens namn eller ett avsnitt om översättningen) bör du använda flaggan B-<--addendum>.
zh_hans: 若要在翻译的内容旁边向生成的文档添加一些额外内容（如翻译人员的姓名或"关于此翻译"部分），应使用 B<--addendum> 选项。
zh_hant: 若要在翻譯的內容旁邊向生成的文件新增一些額外內容（如翻譯人員的姓名或"關於此翻譯"部分），應使用 B<--addendum> 選項。

source: The first line of the addendum must be a header indicating where to put it in the document (it can be before or after a given part of the document). The rest of the file will be added verbatim to the resulting file without further processing.
sv: Den första raden i tillägget måste vara en rubrik som anger var det ska placeras i dokumentet (det kan vara före eller efter en viss del av dokumentet). Resten av filen läggs till ordagrant i den resulterande filen utan ytterligare bearbetning.
zh_hans: 增编的第一行必须是指示在文档中的放放位置的标头（它可以在文档的给定部分之前或之后）。 文件的其余部分将逐字添加到生成的文件中，而无需进一步处理。
zh_hant: 增編的第一行必須是指示在文件中的放放位置的標頭（它可以在文件的給定部分之前或之後）。 檔案的其餘部分將逐字新增到生成的檔案中，而無需進一步處理。

source: Note that if po4a-translate fails to add one of the given files, it discards the whole translation (because the missing file could be the one indicating the author, what would prevent the users to contact him to report bugs in the translation).
sv: Observera att om po4a-translate inte lyckas lägga till någon av de angivna filerna, kasseras hela översättningen (eftersom den saknade filen kan vara den som anger författaren, vilket skulle hindra användarna från att kontakta honom för att rapportera fel i översättningen).
zh_hans: 请注意，如果 po4a 翻译无法添加给定文件之一，它将丢弃整个翻译（因为丢失的文件可能是指示作者的文件，因此会阻止用户联系他报告翻译中的 Bug）。
zh_hant: 請注意，如果 po4a 翻譯無法新增給定檔案之一，它將丟棄整個翻譯（因為丟失的檔案可能是指示作者的檔案，因此會阻止使用者聯絡他報告翻譯中的 Bug）。

source: The header has a pretty rigid syntax. For more information on how to use this feature and how it works, please refer to the L<po4a(7)> man page.
sv: Rubriken har en ganska strikt syntax. För mer information om hur du använder den här funktionen och hur den fungerar, se man-sidan för L<po4a(7)>.
zh_hans: 标头具有相当严格的语法。有关如何使用此功能及其工作原理的详细信息，请参阅 L<po4a(7)> man 页面。
zh_hant: 標頭具有相當嚴格的語法。有關如何使用此功能及其工作原理的詳細資訊，請參閱 L<po4a(7)> man 頁面。

source: po4a-updatepo - update the translation (in PO format) of documentation
sv: po4a-updatepo - uppdatera översättningen (i PO-format) av dokumentationen
zh_hans: po4a-updatepo - 更新文档的翻译（PO 格式）
zh_hant: po4a-updatepo - 更新文件的翻譯（PO 格式）

source: (I<XX.po> are the outputs, all others are inputs)
sv: (I<XX.po> är utgångarna, alla andra är ingångar)
zh_hans: （I<XX.po> 是输出，所有其他都是输入）
zh_hant: （I<XX.po> 是輸出，所有其他都是輸入）

source: The B<po4a-updatepo> script is in charge of updating PO files to make them reflect the changes made to the original documentation file. For that, it converts the documentation file to a POT file, and call L<msgmerge(1)> on this new POT and on the provided PO files.
sv: Skriptet B<po4a-updatepo> ansvarar för att uppdatera PO-filer så att de återspeglar ändringarna som gjorts i den ursprungliga dokumentationsfilen. För detta konverterar det dokumentationsfilen till en POT-fil och anropar L<msgmerge(1)> på denna nya POT-fil och på de tillhandahållna PO-filerna.
zh_hans: B<po4a-updatepo>负责更新 PO 文件，使其反映对原始文档文件所做的更改。为此，它将文档文件转换为 POT 文件，并在此新 POT 和提供的 PO 文件中调用 L<msgmerge(1)> 。
zh_hant: B<po4a-updatepo>負責更新 PO 檔案，使其反映對原始文件檔案所做的更改。為此，它將文件檔案轉換為 POT 檔案，並在此新 POT 和提供的 PO 檔案中呼叫 L<msgmerge(1)> 。

source: It is possible to give more than one PO file (if you want to update several languages at once), and several documentation files (if you want to store the translations of several documents in the same PO file).
sv: Det är möjligt att ange mer än en PO-fil (om du vill uppdatera flera språk samtidigt) och flera dokumentationsfiler (om du vill lagra översättningarna av flera dokument i samma PO-fil).
zh_hans: 可以提供多个 PO 文件（如果要同时更新多种语言）和多个文档文件（如果要将多个文档的翻译存储在同一个 PO 文件中）。
zh_hant: 可以提供多個 PO 檔案（如果要同時更新多種語言）和多個文件檔案（如果要將多個文檔的翻譯儲存在同一個 PO 檔案中）。

source: If the master document has non-ASCII characters, this script will convert the PO files to UTF-8 (if they weren't already), for a transparent handling of non-standard characters.
sv: Om huvuddokumentet innehåller icke-ASCII-tecken kommer detta skript att konvertera PO-filerna till UTF-8 (om de inte redan är det) för en transparent hantering av icke-standardtecken.
zh_hans: 如果主文档包含非 ASCII 字符，该脚本将把 PO 文件转换为 UTF-8 (如果它们还没有)，以便透明地处理非标准字符。
zh_hant: 如果主文件包含非 ASCII 字元，該指令碼將把 PO 檔案轉換為 UTF-8 (如果它們還沒有)，以便透明地處理非標準字元。

source: File(s) containing the master document to translate.
sv: Fil(er) som innehåller huvuddokumentet som ska översättas.
zh_hans: 包含要翻译的主文档的文件。
zh_hant: 包含要翻譯的主文件的檔案。

source: Charset of the files containing the document to translate. Note that all files must have the same charset.
sv: Teckenuppsättning för filerna som innehåller dokumentet som ska översättas. Observera att alla filer måste ha samma teckenuppsättning.
zh_hans: 包含要翻译的文档的文件的字符集。请注意，所有文件必须具有相同的字符集。
zh_hant: 包含要翻譯的文件的檔案的字符集。請注意，所有檔案必須具有相同的字符集。

source: PO file(s) to update. If these files do not exist, they are created by B<po4a-updatepo>.
sv: PO-fil(er) som ska uppdateras. Om dessa filer inte finns skapas de av B<po4a-updatepo>.
zh_hans: 要更新的 PO 文件。如果这些文件不存在，则由 B <po4a-updatepo>。
zh_hant: 要更新的 PO 檔案。如果這些檔案不存在，則由 B <po4a-updatepo>。

source: This option removes B<--previous> from the options passed to L<msgmerge(1)>. This helps supporting old versions of L<gettext(3)> (before v0.16).
sv: Den här flaggan tar bort B<--previous> från flaggorna som skickas till L<msgmerge(1)>. Det här hjälper till att stödja gamla versioner av L<gettext(3)> (före v0.16).

source: Argument can be followed by a comma and either B<wrap> or B<nowrap> keyword. References are written by default on a single line. The B<wrap> option wraps references on several lines, to mimic L<gettext(3)> tools (L<xgettext(1)> and L<msgmerge(1)>). This option will become the default in a future release, because it is more sensible. The B<nowrap> option is available so that users who want to keep the old behavior can do so.
sv: Argumentet kan följas av ett kommatecken och antingen nyckelordet B<wrap> eller B<nowrap>. Referenser skrivs som standard på en enda rad. Flaggan B<wrap> bryter referenser på flera rader för att efterlikna L<gettext(3)> -verktyg (L<xgettext(1)> och L<msgmerge(1)>). Denna flagga kommer att bli standard i en framtida version, eftersom det är mer praktiskt. Flaggan B<nowrap> finns tillgängligt så att användare som vill behålla det gamla beteendet kan göra det.

source: Historically, the gettext suite has reformatted the po files at the 77th column for cosmetics. This option specifies the behavior of po4a. If set to a numerical value, po4a will wrap the po file after this column and after newlines in the content. If set to B<newlines>, po4a will only split the msgid and msgstr after newlines in the content. If set to B<no>, po4a will not wrap the po file at all. The wrapping of the reference comments is controlled by the B<--porefs> option.
sv: Historiskt sett har gettext-paketet omformaterat po-filerna vid den 77:e kolumnen av kosmetiska skäl. Denna flagga anger po4a:s beteende. Om det är inställt på ett numeriskt värde kommer po4a att bryta po-filen efter denna kolumn och efter radbrytningar i innehållet. Om det är inställt på B<newlines> kommer po4a endast att dela upp msgid och msgstr efter radbrytningar i innehållet. Om det är inställt på B<no> kommer po4a inte att bryta po-filen alls. Brytningen av referenskommentarerna styrs av flaggan B<--porefs>.
zh_hans: 从历史上看， gettext 套件重新格式化了化妆品第 77 列的 po 文件。此选项指定 po4a 的行为。如果设置为数值，po4a 将在此列之后和内容中的换行符之后换行 po 文件。如果设置为 B <newlines>，po4a 将仅在内容中的符线后拆分 msgid 和 msgstr。如果设置为 B<no>，po4a 将不会封装 po 文件。 引用注释的封装由 B<--porefs> 选项控制。
zh_hant: 從歷史上看， gettext 套件重新格式化了化妝品第 77 列的 po 檔案。此選項指定 po4a 的行為。如果設定為數值，po4a 將在此列之後和內容中的換行符之後換行 po 文件。如果設定為 B <newlines>，po4a 將僅在內容中的符線後拆分 msgid 和 msgstr。如果設定為 B<no>，po4a 將不會封裝 po 檔案。 引用註釋的封裝由 B<--porefs> 選項控制。

source: msguntypot - update PO files when a typo is fixed in POT file
sv: msguntypot - uppdatera PO-filer när ett stavfel har rättats i POT-filen
zh_hans: msguntypot - 更新 PO文件时， 拼写错误修复在 POT 文件
zh_hant: msguntypot - 更新 PO檔案時， 拼寫錯誤修復在 POT 檔案

source: When you fix a trivial error which surely doesn't affect translations (e.g. a typo) in a POT file, you should unfuzzy the corresponding msgstr in the translated PO files to avoid so extra work to the translators.
sv: När du rättar ett trivialt fel som säkert inte påverkar översättningarna (t.ex. ett stavfel) i en POT-fil, bör du ta bort oklarheten i motsvarande msgstr i de översatta PO-filerna för att undvika extra arbete för översättarna.
zh_hans: 当您修复一个无关紧要的错误，这肯定不会影响翻译（例如， 一个拼写错误）在一个 POT 文件中，你应该解开翻译的 PO 文件中对应的 msgstr，以避免如此额外的工作给翻译。
zh_hant: 當您修復一個無關緊要的錯誤，這肯定不會影響翻譯（例如， 一個拼寫錯誤）在一個 POT 檔案中，你應該解開翻譯的 PO 檔案中對應的 msgstr，以避免如此額外的工作給翻譯。

source: This task is difficult and error prone when done manually, and this tool is there to help doing so correctly. You just need to provide the two versions of the POT file: before the edition and after as marked in the above synopsis, and it all becomes automatic.
sv: Denna uppgift är svår och felbenägen när den utförs manuellt, och detta verktyg finns till för att hjälpa dig att göra det korrekt. Du behöver bara tillhandahålla de två versionerna av POT-filen: före redigeringen och efter, som markerat i sammanfattningen ovan, och sedan sker allt automatiskt.
zh_hans: 此任务在手动完成时很难，容易出错，并且此工具可以帮助正确完成。你只需要提供两个版本的 POT 文件：版本之前和之后，如上述概要中标记，这一切都成为自动的。
zh_hant: 此任務在手動完成時很難，容易出錯，並且此工具可以幫助正確完成。你只需要提供兩個版本的 POT 檔案：版本之前和之後，如上述概要中標記，這一切都成為自動的。

source: HOW TO USE IT
sv: HUR MAN ANVÄNDER DEN
zh_hans: 如何使用它
zh_hant: 如何使用它

source: In short, when you discover a typo in one of your [english] message, do the following:
sv: Kort sagt, när du upptäcker ett stavfel i ett av dina [engelska] meddelanden, gör följande:
zh_hans: 简而言之，当您在一条 [english] 消息中发现拼写错误时，请执行以下操作：
zh_hant: 簡而言之，當您在一條 [english] 訊息中發現拼寫錯誤時，請執行以下操作：

source: - Regenerate your POT and PO files.
sv: - Regenerera dina POT- och PO-filer.
zh_hans: - 重新生成您的 POT 和 PO 文件。
zh_hant: - 重新生成您的 POT 和 PO 檔案。

source: make -C po/ update-po # for message program translations debconf-updatepo # for debconf translations po4a po4a.conf # for po4a based documentation translations
sv: make -C po/ update-po # för översättningar av meddelandeprogram debconf-updatepo # för debconf-översättningar po4a po4a.conf # för po4a-baserade dokumentationsöversättningar

source: or something else, depending on your project's building settings. You know how to make sure your POT and PO files are uptodate, don't you??
sv: eller något annat, beroende på projektets bygginställningar. Du vet väl hur du ser till att dina POT- och PO-filer är uppdaterade?
zh_hans: 或其他内容，具体取决于项目的构建设置。你知道如何确保你的 POT 和 PO 文件是最新的，不是吗？
zh_hant: 或其他內容，具體取決於專案的構建設定。你知道如何確保你的 POT 和 PO 檔案是最新的，不是嗎？

source: - Make a copy of your POT file.
sv: - Gör en kopia av din POT-fil.
zh_hans: - 制作一份 POT 文件。
zh_hant: - 製作一份 POT 檔案。

source: cp myfile.pot myfile.pot.orig
sv: cp minfil.pot minfil.pot.orig

source: - Make a copy of all your PO files.
sv: - Gör en kopia av alla dina PO-filer.
zh_hans: - 制作所有 PO 文件的副本。
zh_hant: - 製作所有 PO 檔案的副本。

source: - Fix your typo.
sv: - Rätta till ditt stavfel.
zh_hans: - 修复您的拼写错误。
zh_hant: - 修復您的拼寫錯誤。

source: $EDITOR the_file_in_which_there_is_a_typo
sv: $EDITOR filen_där_det_finns_ett_stavfel

source: See above.
sv: Se ovan.
zh_hans: 见上文。
zh_hant: 見上文。

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the PO files of your main directory and the one from the fridge. Here is how to solve this.
sv: Vid denna punkt har rättningen av stavfelet gjort alla översättningar otydliga, och denna olyckliga förändring är den enda mellan PO-filerna i din huvudkatalog och den från kylskåpet. Så här löser du detta.
zh_hans: 此时，拼写错误修复了所有翻译的模糊，这个不幸的更改是主目录的 PO 文件和冰箱中的唯一一个。下面是解决此问题的方法。
zh_hant: 此時，拼寫錯誤修復了所有翻譯的模糊，這個不幸的更改是主目錄的 PO 檔案和冰箱中的唯一一個。下面是解決此問題的方法。

source: - Discard fuzzy translation, restore the ones from the fridge.
sv: - Kasta bort otydliga översättningar, återställ de från kylskåpet.
zh_hans: - 放弃模糊翻译，从冰箱恢复。
zh_hant: - 放棄模糊翻譯，從冰箱恢復。

source: - Manually merge the PO files with the new POT file, but taking the useless fuzzy into account.
sv: - Slå ihop PO-filerna manuellt med den nya POT-filen, men ta hänsyn till onödiga fuzzy-termer.
zh_hans: - 手动将 PO 文件与新的 POT 文件合并，但将无用的模糊考虑在内。
zh_hant: - 手動將 PO 檔案與新的 POT 檔案合併，但將無用的模糊考慮在內。

source: msguntypot -o myfile.pot.orig -n myfile.pot *.po
sv: msguntypot -o minfil.pot.orig -n minfil.pot *.po

source: - Cleanups.
sv: - Städning.
zh_hans: - 清理。
zh_hant: - 清理。

source: rm -rf myfile.pot.orig po_fridge
sv: rm -rf minfil.pot.orig po_fridge

source: You're done. The typo was eradicated from msgstr of both your POT and PO files, and the PO files were not fuzzyied in the process. Your translators love you already.
sv: Du är klar. Felstavningen har raderats från msgstr i både dina POT- och PO-filer, och PO-filerna har inte blivit otydliga under processen. Dina översättare älskar dig redan.
zh_hans: 你做完了该错别字从您的 POT 和 PO 文件的 msgstr 中根除了，并且 PO 文件在这个过程中没有模糊化。你的翻译已经爱你了。
zh_hant: 你做完了該錯別字從您的 POT 和 PO 檔案的 msgstr 中根除了，並且 PO 檔案在這個過程中沒有模糊化。你的翻譯已經愛你了。

source: Despite its name, this tool is not part of the gettext tool suite. It is instead part of po4a. More precisely, it's a random Perl script using the fine po4a modules. For more information about po4a, please see:
sv: Trots sitt namn ingår detta verktyg inte i gettext-verktygssviten. Det ingår istället i po4a. Mer exakt är det ett slumpmässigt Perl-skript som använder de fina po4a-modulerna. För mer information om po4a, se:
zh_hans: 尽管它的名称，此工具不是 gettext 工具套件的一部分。而是 po4a 的一部分。更确切地说，它是使用精细 po4a 模块的随机 Perl 脚本。有关 po4a 的信息，请参阅：
zh_hant: 儘管它的名稱，此工具不是 gettext 工具套件的一部分。而是 po4a 的一部分。更確切地說，它是使用精細 po4a 模組的隨機 Perl 指令碼。有關 po4a 的資訊，請參閱：

source: Copyright 2005 by SPI, inc.
sv: Copyright 2005 av SPI, inc.
zh_hans: 版权所有 2005 by SPI, inc.
zh_hant: 版權所有 2005 by SPI, inc.

source: po4a - framework to translate documentation and other materials
sv: po4a – ramverk för översättning av dokumentation och annat material
zh_hans: po4a - 翻译文档和其他资料的框架
zh_hant: po4a - 翻譯文件和其他資料的框架

source: Introduction
sv: Introduktion
zh_hans: 简介
zh_hant: 簡介

source: po4a (PO for anything) eases the maintenance of documentation translation using the classical gettext tools. The main feature of po4a is that it decouples the translation of content from its document structure.
sv: po4a (PO for anything) underlättar underhållet av dokumentationsöversättningar med hjälp av de klassiska gettext-verktygen. Den viktigaste funktionen i po4a är att det separerar översättningen av innehållet från dokumentstrukturen.
zh_hans: po4a(PO For Anything) 使用经典的 gettext 工具简化了文档翻译的维护。po4a 的主要特征是它将内容翻译与文档结构分离。
zh_hant: po4a(PO For Anything) 使用經典的 gettext 工具簡化了文件翻譯的維護。po4a 的主要特徵是它將內容翻譯與文件結構分離。

source: This document serves as an introduction to the po4a project with a focus on potential users considering whether to use this tool and on the curious wanting to understand why things are the way they are.
sv: Detta dokument fungerar som en introduktion till po4a-projektet med fokus på potentiella användare som överväger att använda detta verktyg och på nyfikna som vill förstå varför saker och ting är som de är.
zh_hans: 本文档是对 po4a 项目的介绍，重点关注考虑是否使用此工具的潜在用户，以及想要了解事物为什么是这样的好奇用户。
zh_hant: 本文件是對 po4a 專案的介紹，重點關注考慮是否使用此工具的潛在使用者，以及想要了解事物為什麼是這樣的好奇使用者。

source: Why po4a?
sv: Varför po4a?
zh_hans: 为什么是 po4a？
zh_hant: 為什麼是 po4a？

source: The philosophy of Free Software is to make the technology truly available to everyone. But licensing is not the only consideration: untranslated free software is useless for non-English speakers. Therefore, we still have some work to do to make software available to everybody.
sv: Filosofin bakom fri programvara är att göra tekniken tillgänglig för alla. Men licensiering är inte det enda man måste tänka på: fri programvara som inte är översatt är värdelös för dem som inte talar engelska. Därför har vi fortfarande en del arbete kvar att göra för att göra programvaran tillgänglig för alla.
zh_hans: 自由软件的理念是让技术真正为每个人所用。但许可并不是唯一的考虑因素：未翻译的自由软件对非英语国家的人来说毫无用处。因此，要让每个人都可以使用软件，我们还有一些工作要做。
zh_hant: 自由軟體的理念是讓技術真正為每個人所用。但許可並不是唯一的考慮因素：未翻譯的自由軟體對非英語國家的人來說毫無用處。因此，要讓每個人都可以使用軟體，我們還有一些工作要做。

source: This situation is well understood by most projects and everybody is now convinced of the necessity to translate everything. Yet, the actual translations represent a huge effort of many individuals, crippled by small technical difficulties.
sv: Denna situation är välkänd för de flesta projekt och alla är nu övertygade om nödvändigheten av att översätta allt. Ändå kräver de faktiska översättningarna en enorm insats av många individer, som hindras av små tekniska svårigheter.
zh_hans: 大多数项目都很好地理解了这种情况，现在每个人都相信有必要翻译所有的东西。然而，实际的翻译代表了许多个人的巨大努力，他们因小小的技术困难而步履蹒跚。
zh_hant: 大多數專案都很好地理解了這種情況，現在每個人都相信有必要翻譯所有的東西。然而，實際的翻譯代表了許多個人的巨大努力，他們因小小的技術困難而步履蹣跚。

source: Thankfully, Open Source software is actually very well translated using the gettext tool suite. These tools are used to extract the strings to translate from a program and present the strings to translate in a standardized format (called PO files, or translation catalogs). A whole ecosystem of tools has emerged to help the translators actually translate these PO files. The result is then used by gettext at run time to display translated messages to the end users.
sv: Tack och lov är öppen källkodsprogramvara faktiskt mycket väl översatt med hjälp av verktygssviten gettext. Dessa verktyg används för att extrahera strängarna som ska översättas från ett program och presentera strängarna i ett standardiserat format (kallat PO-filer eller översättningskataloger). Ett helt ekosystem av verktyg har vuxit fram för att hjälpa översättarna att översätta dessa PO-filer. Resultatet används sedan av gettext vid körning för att visa översatta meddelanden för slutanvändarna.
zh_hans: 值得庆幸的是，使用 gettext 工具套件实际上可以很好地翻译开放源码软件。这些工具用于从程序中提取要翻译的字符串，并以标准化格式(称为 PO 文件或翻译目录)显示要翻译的字符串。一个完整的工具生态系统已经出现，可以帮助翻译人员实际翻译这些 PO 文件。然后，gettext 在运行时使用结果向最终用户显示翻译后的消息。
zh_hant: 值得慶幸的是，使用 gettext 工具套件實際上可以很好地翻譯開放原始碼軟體。這些工具用於從程式中提取要翻譯的字串，並以標準化格式(稱為 PO 檔案或翻譯目錄)顯示要翻譯的字串。一個完整的工具生態系統已經出現，可以幫助翻譯人員實際翻譯這些 PO 檔案。然後，gettext 在執行時使用結果向終端使用者顯示翻譯後的訊息。

source: Regarding documentation, however, the situation still somewhat disappointing. At first translating documentation may seem to be easier than translating a program as it would seem that you just have to copy the documentation source file and start translating the content. However, when the original documentation is modified, keeping track of the modifications quickly turns into a nightmare for the translators. If done manually, this task is unpleasant and error-prone.
sv: När det gäller dokumentation är situationen dock fortfarande något nedslående. Vid första anblicken kan det verka enklare att översätta dokumentation än att översätta ett program, eftersom det verkar som om man bara behöver kopiera dokumentationens källfil och börja översätta innehållet. Men när den ursprungliga dokumentationen ändras blir det snabbt en mardröm för översättarna att hålla reda på ändringarna. Om detta görs manuellt är uppgiften otrevlig och felbenägen.
