Repository: mquinson/po4a
Catalog: po/pod/*.po
Languages: sv, zh_hans, zh_hant

source: Although this context search may be considered to operate roughly on each line of the B<translated> document, it actually operates on the internal data string of the translated document. This internal data string may be a text spanning a paragraph containing multiple lines or may be a XML tag itself alone. The exact I<insertion point> of the addendum must be before or after the internal data string and can not be within the internal data string.
sv: Även om denna kontextsökning kan anses fungera ungefär på varje rad i B-<translated> sdokumentet, fungerar den i själva verket på den interna datasträngen i det översatta dokumentet. Denna interna datasträng kan vara en text som sträcker sig över ett stycke som innehåller flera rader eller kan vara en XML-tagg i sig själv. Den exakta I-<insertion point> en av tillägget måste vara före eller efter den interna datasträngen och kan inte finnas inom den interna datasträngen.
zh_hans: 尽管该上下文搜索可能被认为是对 B<translated> 文档的每一行进行粗略操作，但它实际上是对已翻译文档的内部数据串进行操作。该内部数据串可以是跨越包含多行的段落的文本，或者可以是单独的 XML 标签。附录的确切 I<insertion point> 必须在内部数据字符串之前或之后，并且不能在内部数据字符串内。
zh_hant: 儘管該上下文搜尋可能被認為是對 B<translated> 文件的每一行進行粗略操作，但它實際上是對已翻譯文件的內部資料串進行操作。該內部資料串可以是跨越包含多行的段落的文字，或者可以是單獨的 XML 標籤。附錄的確切 I<insertion point> 必須在內部數據字串之前或之後，並且不能在內部資料字串內。

source: Pass the C<-vv> argument to B<po4a> to understand how the addenda are added to the translation. It may also help to run B<po4a> in debug mode to see the actual internal data string when your addendum does not apply.
sv: Skicka argumentet C<-vv> till B<po4a> för att förstå hur tilläggen läggs till i översättningen. Det kan också vara bra att köra B<po4a> i felsökningsläge för att se den faktiska interna datasträngen när ditt tillägg inte gäller.

source: Addenda examples
sv: Exempel på tillägg
zh_hans: 附录示例
zh_hant: 附錄示例

source: If you want to add something after the following nroff section:
sv: Om du vill lägga till något efter följande nroff-avsnitt:
zh_hans: 如果要在以下 nroff 部分之后添加内容：
zh_hant: 如果要在以下 nroff 部分之後新增內容：

source: .SH "AUTHORS"
sv: .SH "UPPHOVSPERSONER"

source: You should select a two-step approach by setting B<mode=after>. Then you should narrow down search to the line after B<AUTHORS> with the B<position> argument regex. Then, you should match the beginning of the next section (i.e., B<^\.SH>) with the B<beginboundary> argument regex. That is to say:
sv: Du bör välja en tvåstegsmetod genom att ställa in B<mode=after>. Sedan bör du begränsa sökningen till raden efter B<AUTHORS> med argumentet B<position> regex. Därefter bör du matcha början av nästa avsnitt (dvs. B<^\.SH>) med argumentet B<beginboundary> regex. Det vill säga:

source: PO4A-HEADER:mode=after;position=AUTHORS;beginboundary=\.SH
sv: PO4A-HEADER:läge=efter;position=FÖRFATTARE;början av gräns=\.SH

source: If you want to add something right after a given line (e.g. after the line "Copyright Big Dude"), use a B<position> matching this line, B<mode=after> and give a B<beginboundary> matching any line.
sv: Om du vill lägga till något direkt efter en viss rad (t.ex. efter raden "Copyright Big Dude"), använd en B-<position> som matchar denna rad, B-<mode=after>, och ange en B-<beginboundary>, som matchar vilken rad som helst.
zh_hans: 如果您想要在给定行之后添加某些内容(例如，在“版权所有 Big Dude”行之后)，请使用与此行匹配的 B<position>，B<mode=After>，并给出与任何行匹配的 B<beginboundary>。
zh_hant: 如果您想要在給定行之後新增某些內容(例如，在“版權所有 Big Dude”行之後)，請使用與此行匹配的 B<position>，B<mode=After>，並給出與任何行匹配的 B<beginboundary>。

source: PO4A-HEADER:mode=after;position=Copyright Big Dude, 2004;beginboundary=^
sv: PO4A-HEADER:läge=efter;position=Copyright Big Dude, 2004;början=^

source: If you want to add something at the end of the document, give a B<position> matching any line of your document (but only one line. Po4a won't proceed if it's not unique), and give an B<endboundary> matching nothing. Don't use simple strings here like B<"EOF">, but prefer those which have less chance to be in your document.
sv: Om du vill lägga till något i slutet av dokumentet, ange en B<position> som matchar valfri rad i dokumentet (men endast en rad. Po4a fortsätter inte om den inte är unik) och ange en B<endboundary> som inte matchar något. Använd inte enkla strängar här, såsom B<"EOF">, utan välj hellre sådana som har mindre chans att förekomma i dokumentet.
zh_hans: 如果要在文档末尾添加某些内容，请在文档的任意行加上匹配的 B<position> (但只有一行，如果不是唯一的，po4a 将不会继续)。并给出一个不匹配的 B<endboundary> 。这里不要使用像 B<"EOF"> 这样的简单字符串，而要使用那些在文档中出现的机会较小的字符串。
zh_hant: 如果要在文件末尾新增某些內容，請在文件的任意行加上匹配的 B<position> (但只有一行，如果不是唯一的，po4a 將不會繼續)。並給出一個不匹配的 B<endboundary> 。這裡不要使用像 B<"EOF"> 這樣的簡單字串，而要使用那些在文件中出現的機會較小的字串。

source: PO4A-HEADER:mode=after;position=About this document;beginboundary=FakePo4aBoundary
sv: PO4A-HEADER:läge=efter;position=Om detta dokument;början av gräns=FakePo4aBoundary

source: More detailed example
sv: Mer detaljerat exempel
zh_hans: 更详细的示例
zh_hant: 更詳細的示例

source: Original document (POD formatted):
sv: Originaldokument (POD-format):
zh_hans: 原始文件(POD 格式)：
zh_hant: 原始檔案(POD 格式)：

source: |=head1 NAME | |dummy - a dummy program | |=head1 AUTHOR | |me
sv: |=head1 NAMN | |dummy - ett dummyprogram | |=head1 UPPHOVSPERSON | |jag

source: Then, the following addendum will ensure that a section (in French) about the translator is added at the end of the file (in French, "TRADUCTEUR" means "TRANSLATOR", and "moi" means "me").
sv: Därefter kommer följande tillägg att säkerställa att ett avsnitt (på franska) om översättaren läggs till i slutet av filen (på franska betyder "TRADUCTEUR" "ÖVERSÄTTARE" och "moi" betyder "jag").
zh_hans: 然后，以下附录将确保在文件的末尾添加有关翻译器的部分（简体中文）（简体中文， "翻译" 表示 "TRANSLATOR"，"我" 表示 "me"）。
zh_hant: 然後，以下附錄將確保在檔案的末尾新增有關翻譯器的部分（簡體中文）（簡體中文， "翻譯" 表示 "TRANSLATOR"，"我" 表示 "me"）。

source: To put your addendum before the AUTHOR, use the following header:
sv: För att lägga till ditt tillägg före FÖRFATTAREN, använd följande rubrik:
zh_hans: 要将附录放在作者之前，请使用以下标题：
zh_hant: 要將附錄放在作者之前，請使用以下標題：

source: PO4A-HEADER:mode=after;position=NOM;beginboundary=^=head1
sv: PO4A-HEADER:läge=efter;position=NOM;början av gräns=^=head1

source: This works because the next line matching the B<beginboundary> C</^=head1/> after the section "NAME" (translated to "NOM" in French), is the one declaring the authors. So, the addendum will be put between both sections. Note that if another section is added between NAME and AUTHOR sections later, po4a will wrongfully put the addenda before the new section.
sv: Detta fungerar eftersom nästa rad som matchar B<beginboundary> C</^=head1/> efter avsnittet "NAME" (översatt till "NOM" på franska) är den som anger författarna. Tillägget kommer alltså att placeras mellan de båda avsnitten. Observera att om ett annat avsnitt läggs till mellan avsnitten NAME och AUTHOR senare, kommer po4a felaktigt att placera tilläggen före det nya avsnittet.

source: To avoid this you may accomplish the same using B<mode>=I<before>:
sv: För att undvika detta kan du uppnå samma resultat med hjälp av B<mode>=I<before>:
zh_hans: 要避免出现这种情况，您可以使用 B<mode>=I<BEFORE> 来完成相同的操作：
zh_hant: 要避免出現這種情況，您可以使用 B<mode>=I<BEFORE> 來完成相同的操作：

source: PO4A-HEADER:mode=before;position=^=head1 AUTEUR
sv: PO4A-HEADER:läge=före;position=^=head1 AUTEUR

source: How does it work?
sv: Hur fungerar det?
zh_hans: 它是如何工作的？
zh_hant: 它是如何工作的？

source: This chapter gives you a brief overview of the po4a internals, so that you may feel more confident to help us to maintain and to improve it. It may also help you to understand why it does not do what you expected, and how to solve your problems.
sv: Detta kapitel ger dig en kort översikt över po4a:s interna funktioner, så att du kan känna dig mer säker på att hjälpa oss att underhålla och förbättra det. Det kan också hjälpa dig att förstå varför det inte fungerar som du förväntat dig och hur du kan lösa dina problem.

source: TransTractors and project architecture
sv: TransTractors och projektarkitektur

source: At the core of the po4a project, the L<Locale::Po4a::TransTractor(3pm)|TransTractor> class is the common ancestor to all po4a parsers. This strange name comes from the fact that it is at the same time in charge of translating document and extracting strings.
sv: I kärnan av po4a-projektet är klassen L<Locale::Po4a::TransTractor(3pm)|TransTractor> den gemensamma förfadern till alla po4a-parsers. Detta märkliga namn kommer från det faktum att den samtidigt ansvarar för att översätta dokument och extrahera strängar.

source: More formally, it takes a document to translate plus a PO file containing the translations to use as input while producing two separate outputs: Another PO file (resulting of the extraction of translatable strings from the input document), and a translated document (with the same structure as the input one, but with all translatable strings replaced with content of the input PO). Here is a graphical representation of this:
sv: Mer formellt krävs ett dokument att översätta samt en PO-fil som innehåller översättningarna som ska användas som indata för att producera två separata utdata: En annan PO-fil (resultatet av extraheringen av översättningsbara strängar från indatadokumentet) och ett översatt dokument (med samma struktur som indatadokumentet, men där alla översättningsbara strängar har ersatts med innehållet i indataprofilen). Här är en grafisk representation av detta:

source: This little bone is the core of all the po4a architecture. If you provide both input and disregard the output PO, you get B<po4a-translate>. If you disregard the output document instead, you get B<po4a-updatepo>. The B<po4a> uses a first TransTractor to get an up-to-date output POT file (disregarding the output documents), calls B<msgmerge -U> to update the translation PO files on disk, and builds a second TransTractor with these updated PO files to update the output documents. In short, B<po4a> provides one-stop solution to update what needs to be, using a single configuration file.
sv: Denna lilla kod är kärnan i hela po4a-arkitekturen. Om du anger både indata och bortser från utdata PO får du B<po4a-translate>. Om du istället bortser från utdatadokumentet får du B<po4a-updatepo>. B<po4a> använder en första TransTractor för att få en uppdaterad utdatapot-fil (utan att ta hänsyn till utdatadokumenten), anropar B<msgmerge -U> för att uppdatera översättningspo-filerna på disken och bygger en andra TransTractor med dessa uppdaterade po-filer för att uppdatera utdatadokumenten. Kort sagt, B<po4a> erbjuder en helhetslösning för att uppdatera det som behövs, med hjälp av en enda konfigurationsfil.

source: B<po4a-gettextize> also uses two TransTractors, but another way: It builds one TransTractor per language, and then build a new PO file using the msgids of the original document as msgids, and the msgids of the translated document as msgstrs. Much care is needed to ensure that the strings matched this way actually match, as described in L<po4a-gettextize(1)>.
sv: B<po4a-gettextize> använder också två TransTractors, men på ett annat sätt: Det skapar en TransTractor per språk och skapar sedan en ny PO-fil med msgids från originaldokumentet som msgids och msgids från det översatta dokumentet som msgstrs. Det krävs stor noggrannhet för att säkerställa att strängarna som matchas på detta sätt verkligen matchar, vilket beskrivs i L<po4a-gettextize(1)>.

source: Format-specific parsers
sv: Formatspecifika parsers

source: All po4a format parsers are implemented on top of the TransTractor. Some of them are very simple, such as the Text, Markdown and AsciiDoc ones. They load the lines one by one using C<TransTractor::shiftline()>, accumulate the paragraphs' content or whatever. Once a string is completely parsed, the parser uses C<TransTractor::translate()> to (1) add this string to the output PO file and (2) get the translation from the input PO file. The parser then pushes the result to the output file using C<TransTractor::pushline()>.
sv: Alla po4a-formatparsers är implementerade ovanpå TransTractor. Vissa av dem är mycket enkla, såsom Text, Markdown och AsciiDoc. De laddar raderna en efter en med hjälp av C<TransTractor::shiftline()>, samlar in innehållet i styckena eller vad det nu är. När en sträng är helt parsad använder parsern C<TransTractor::translate()> för att (1) lägga till denna sträng till utdata-PO-filen och (2) hämta översättningen från inmatnings-PO-filen. Parsern skickar sedan resultatet till utdatafilen med hjälp av C<TransTractor::pushline()>.

source: Some other parsers are more complex because they rely on an external parser to analyze the input document. The Xml, HTML, SGML and Pod parsers are built on top of SAX parsers. They declare callbacks to events such as "I found a new title which content is the following" to update the output document and output POT files according to the input content using C<TransTractor::translate()> and C<TransTractor::pushline()>. The Yaml parser is similar but different: it serializes a data structure produced by the YAML::Tiny parser. This is why the Yaml module of po4a fails to declare the reference lines: the location of each string in the input file is not kept by the parser, so we can only provide "$filename:1" as a string location. The SAX-oriented parsers use globals and other tricks to save the file name and line numbers of references.
sv: Vissa andra parsers är mer komplexa eftersom de förlitar sig på en extern parser för att analysera indatadokumentet. Parsers för Xml, HTML, SGML och Pod är byggda på SAX-parsers. De deklarerar återkopplingar till händelser som "Jag har hittat en ny titel med följande innehåll" för att uppdatera utdatadokumentet och mata ut POT-filer enligt indatainnehållet med hjälp av C<TransTractor::translate()> och C<TransTractor::pushline()>. Yaml-parsern är liknande men ändå annorlunda: den serialiserar en datastruktur som producerats av YAML::Tiny-parsern. Det är därför som Yaml-modulen i po4a inte kan deklarera referensraderna: parsern sparar inte platsen för varje sträng i inmatningsfilen, så vi kan bara ange "$filename:1" som strängplats. De SAX-orienterade parsrarna använder globala variabler och andra knep för att spara filnamn och radnummer för referenser.

source: One specific issue arises from file encodings and BOM markers. Simple parsers can forget about this issue, that is handled by C<TransTractor::read()> (used internally to get the lines of an input document), but the modules relying on an external parser must ensure that all files are read with an appropriate PerlIO decoding layer. The easiest is to open the file yourself, and provide an filehandle or directly the full string to your external parser. Check on C<Pod::read()> and C<Pod::parse()> for an example. The content read by the TransTractor is ignored, but a fresh filehandle is passed to the external parser. The important part is the C<< "<:encoding($charset)" >> mode that is passed to the B<open()> perl function.
sv: Ett specifikt problem uppstår i samband med filkodningar och BOM-markörer. Enkla parsers kan bortse från detta problem, som hanteras av C<TransTractor::read()> (används internt för att hämta raderna i ett indatadokument), men moduler som är beroende av en extern parser måste se till att alla filer läses med ett lämpligt PerlIO-avkodningslager. Det enklaste är att öppna filen själv och tillhandahålla en filhanterare eller direkt hela strängen till din externa parser. Se C<Pod::read()> och C<Pod::parse()> för ett exempel. Innehållet som läses av TransTractor ignoreras, men ett nytt filhandtag skickas till den externa parsern. Den viktiga delen är läget C<< "<:encoding($charset)" >> som skickas till B<open()>-funktionen i Perl.

source: Po objects
sv: Po-objekt

source: The L<Locale::Po4a::Po(3pm)|Po> class is in charge of loading and using PO and POT files. Basically, you can read a file, add entries, get translations with the B<gettext()> method, write the PO into a file. More advanced features such as merging a PO file against a POT file or validating a file are delegated to L<msgmerge(1)> and L<msgfmt(1)> respectively.
sv: Klassen L<Locale::Po4a::Po(3pm)|Po> ansvarar för att ladda och använda PO- och POT-filer. I grund och botten kan du läsa en fil, lägga till poster, hämta översättningar med metoden B<gettext()> och skriva PO till en fil. Mer avancerade funktioner, såsom att slå samman en PO-fil med en POT-fil eller validera en fil, delegeras till L<msgmerge(1)> respektive L<msgfmt(1)>.

source: Contributing to po4a
sv: Bidra till po4a

source: Even if you have never contributed to any Open Source project in the past, you are welcome: we are willing to help and mentor you here. po4a is best maintained by its users nowadays. As we lack manpower, we try to make the project welcoming by improving the doc and the automatic tests to make you confident in contributing to the project. Please refer to the CONTRIBUTING.md file for more details.
sv: Även om du aldrig tidigare har bidragit till något öppen källkodsprojekt är du välkommen: vi är villiga att hjälpa och handleda dig här. po4a underhålls numera bäst av sina användare. Eftersom vi saknar arbetskraft försöker vi göra projektet välkomnande genom att förbättra dokumentationen och de automatiska testerna så att du känner dig trygg med att bidra till projektet. Se filen CONTRIBUTING.md för mer information.

source: Open-source projects using po4a
sv: Öppen källkodsprojekt som använder po4a
zh_hans: 使用 po4a 的开源项目
zh_hant: 使用 po4a 的開源專案

source: Here is a very partial list of projects that use po4a in production for their documentation. If you want to add your project to the list, just drop us an email (or a Merge Request).
sv: Här är en mycket ofullständig lista över projekt som använder po4a i produktionen för sin dokumentation. Om du vill lägga till ditt projekt i listan, skicka oss ett e-postmeddelande (eller en Merge Request).
zh_hans: 以下是在生产中使用 po4a 进行文档编制的项目的非常部分的列表。如果您想将您的项目添加到列表中，只需给我们发送电子邮件(或合并请求)即可。
zh_hant: 以下是在生產中使用 po4a 進行文件編制的專案的非常部分的列表。如果您想將您的項目新增到列表中，只需給我們傳送電子郵件(或合併請求)即可。

source: adduser (man): users and groups management tool.
sv: adduser (man): verktyg för hantering av användare och grupper.
zh_hans: adduser (man): 用户和组管理工具。
zh_hant: adduser (man): 使用者和組管理工具。

source: apt (man, docbook): Debian package manager.
sv: apt (man, docbook): Debians pakethanterare.
zh_hans: apt (man, docbook): Debian 包管理器。
zh_hant: apt (man, docbook): Debian 包管理器。

source: aptitude (docbook, svg): terminal-based package manager for Debian
sv: aptitude (docbook, svg): terminalbaserad pakethanterare för Debian
zh_hans: aptitude (docbook, svg): Debian 基于终端的包管理器
zh_hant: aptitude (docbook, svg): Debian 基於終端的包管理器

source: L<F-Droid website|https://gitlab.com/fdroid/fdroid-website> (markdown): installable catalog of FOSS (Free and Open Source Software) applications for the Android platform.
sv: L<F-Droid-webbplats|https://gitlab.com/fdroid/fdroid-website> (markdown): installerbara katalog med FOSS-applikationer (fri och öppen källkod) för Android-plattformen.

source: L<git|https://github.com/jnavila/git-manpages-l10n> (asciidoc): distributed version-control system for tracking changes in source code.
sv: L<git|https://github.com/jnavila/git-manpages-l10n> (asciidoc): distribuerat versionshanteringssystem för att spåra ändringar i källkoden.
zh_hans: L<git|https://github.com/jnavila/git-manpages-l10n> (asciidoc): 用于跟踪源代码更改的分布式版本控制系统。
zh_hant: L<git|https://github.com/jnavila/git-manpages-l10n> (asciidoc): 用於跟蹤源代碼更改的分散式版本控制系統。

source: This project provides an infrastructure for translating many manpages to different languages, ready for integration into several major distributions (Arch Linux, Debian and derivatives, Fedora).
sv: Detta projekt tillhandahåller en infrastruktur för översättning av många man-sidor till olika språk, redo för integration i flera stora distributioner (Arch Linux, Debian och derivat, Fedora).
zh_hans: 该项目提供了将许多手册页翻译成不同语言的基础设施，可以集成到几个主要的发行版中(Arch Linux、Debian 和衍生品、Fedora)。
zh_hant: 該專案提供了將許多手冊頁翻譯成不同語言的基礎設施，可以整合到幾個主要的發行版中(Arch Linux、Debian 和衍生品、Fedora)。

source: L<Stellarium|https://github.com/Stellarium/stellarium> (HTML): a free open source planetarium for your computer. po4a is used to translate the sky culture descriptions.
sv: L<Stellarium|https://github.com/Stellarium/stellarium> (HTML): ett gratis planetarium med öppen källkod för din dator. po4a används för att översätta beskrivningarna av himmelskulturen.
zh_hans: L<Stellarium|https://github.com/Stellarium/stellarium> (HTML): 为您的计算机提供免费的开源天文馆。po4a 用于翻译天空文化描述。
zh_hant: L<Stellarium|https://github.com/Stellarium/stellarium> (HTML): 為您的計算機提供免費的開源天文館。po4a 用於翻譯天空文化描述。

source: L<Jamulus|https://jamulus.io/> (markdown, yaml, HTML): a FOSS application for online jamming in real time. The website documentation is maintained in multiple languages using po4a.
sv: L<Jamulus|https://jamulus.io/> (markdown, yaml, HTML): ett FOSS-program för online-jamming i realtid. Webbplatsens dokumentation underhålls på flera språk med hjälp av po4a.

source: Other item to sort out: L<https://gitlab.com/fdroid/fdroid-website/> L<https://github.com/fsfe/reuse-docs/pull/61>
sv: Andra saker att reda ut: L<https://gitlab.com/fdroid/fdroid-website/> L<https://github.com/fsfe/reuse-docs/pull/61>
zh_hans: 其他要排序的项目：L<https://gitlab.com/fdroid/fdroid-website/> L<https://github.com/fsfe/reuse-docs/pull/61>
zh_hant: 其他要排序的專案：L<https://gitlab.com/fdroid/fdroid-website/> L<https://github.com/fsfe/reuse-docs/pull/61>

source: How do you pronounce po4a?
sv: Hur uttalar man po4a?
zh_hans: 如何发音 po4a？
zh_hant: 如何發音 po4a？

source: I personally vocalize it as L<pouah|https://en.wiktionary.org/wiki/pouah>, which is a French onomatopoetic that we use in place of yuck :) I may have a strange sense of humor :)
sv: Personligen uttalar jag det som L<pouah|https://en.wiktionary.org/wiki/pouah>, vilket är ett franskt onomatopoetiskt uttryck som vi använder istället för yuck :) Jag kanske har ett konstigt sinne för humor :)
zh_hans: 我个人把它念成 L<pouah|https://en.wiktionary.org/wiki/pouah>，这是一个法语拟声词，我们用它来代替 yuck(雅克 ) :) 我可能有一种奇怪的幽默感 :)
zh_hant: 我個人把它念成 L<pouah|https://en.wiktionary.org/wiki/pouah>，這是一個法語擬聲詞，我們用它來代替 yuck(雅克 ) :) 我可能有一種奇怪的幽默感 :)

source: Why are the individual scripts deprecated?
sv: Varför är de enskilda skripten föråldrade?

source: Indeed, B<po4a-updatepo> and B<po4a-translate> are deprecated in favor of B<po4a>. The reason is that while B<po4a> can be used as a replacement to these scripts once you provide a config file, there is quite a lot of code duplication here. Individual scripts last around 150 lines of codes while the B<po4a> program lasts 1200 lines, so they do a lot in addition of the common internals. The code duplication results in bugs occurring in both versions and needing two fixes. One example of such duplication are the bugs #1022216 in Debian and the issue #442 in GitHub that had the exact same fix, but one in B<po4a> and the other B<po4a-updatepo>.
sv: Faktum är att B<po4a-updatepo> och B<po4a-translate> är föråldrade till förmån för B<po4a>. Anledningen är att även om B<po4a> kan användas som ersättning för dessa skript när du har tillhandahållit en konfigurationsfil, finns det ganska mycket kodduplicering här. Enskilda skript är cirka 150 rader långa, medan programmet B<po4a> är 1200 rader långt, så de gör mycket utöver de gemensamma interna funktionerna. Koddupliceringen resulterar i buggar i båda versionerna och kräver två korrigeringar. Ett exempel på sådan duplicering är buggarna #1022216 i Debian och problemet #442 i GitHub som hade exakt samma korrigering, men den ena i B<po4a> och den andra i B<po4a-updatepo>.
